__CapabilityDescription=\u4ECE\u5305\u542B\u97F3\u9891\u3001\u89C6\u9891\u3001\u56FE\u7247\u548C\u5176\u5B83\u6587\u4EF6\u7C7B\u578B\u7684\u6D41\u6587\u4EF6\u4E2D\u63D0\u53D6\u5185\u5BB9\u5143\u6570\u636E(metadata)\uFF0C\u8BE5\u7EC4\u4EF6\u4F9D\u8D56\u4E8EApache Tika\u9879\u76EE\u8FDB\u884C\u6587\u4EF6\u683C\u5F0F\u68C0\u6D4B\u4EE5\u53CA\u89E3\u6790\uFF0C\u5B83\u4ECE\u5A92\u4F53\u6587\u4EF6(\u5305\u62EC\u97F3\u9891\u3001\u89C6\u9891\u7B49)\u63D0\u53D6\u4E00\u957F\u4E32\u5143\u6570\u636E\u7C7B\u578B\u3002\u6CE8\u610F\uFF1A\u5728\u4E0D\u540C\u7684\u5347\u7EA7\u8FC7\u7A0B\u4E2D\uFF0C\u63D0\u53D6\u5230\u7684\u5C5E\u6027\u540D\u79F0\u4EE5\u53CA\u5185\u5BB9\u53EF\u80FD\u6709\u53D8\uFF0C\u56E0\u4E3A\u89E3\u6790\u662F\u901A\u8FC7Tika\u5DE5\u5177\u5B9E\u73B0\u7684\uFF0C\u800CTika\u5DE5\u5177\u53C8\u4F9D\u8D56\u4E8E\u5176\u5B83\u9879\u76EE\u6765\u63D0\u53D6\u5143\u6570\u636E\u3002\u60F3\u4E86\u89E3\u652F\u6301\u7684\u6587\u4EF6\u7C7B\u578B\u7B49\u66F4\u8BE6\u7EC6\u4FE1\u606F\u7684\u8BDD\uFF0C\u53EF\u4EE5\u8BBF\u95EEhttp://tika.apache.org/\u3002
__Tags=media, file, format, metadata, audio, video, image, document, pdf, \u5A92\u4F53, \u5143\u6570\u636E, \u97F3\u9891, \u89C6\u9891
Max_Number_of_Attributes.displayName=\u5C5E\u6027\u6570\u6700\u5927\u503C
Max_Number_of_Attributes.description=\u6307\u5B9A\u8981\u6DFB\u52A0\u5230\u6D41\u6587\u4EF6\u4E2D\u7684\u6700\u5927\u5C5E\u6027\u4E2A\u6570\u3002\u5904\u7406\u7684\u65F6\u5019\u6807\u7B7E\u7684\u987A\u5E8F\u4E0D\u80FD\u4FDD\u8BC1\uFF0C\u9ED8\u8BA4\u60C5\u51B5\u4E0B\uFF0C\u5B83\u5C06\u5904\u7406\u6240\u6709\u7684\u6807\u7B7E\u3002
Max_Attribute_Length.displayName=\u5C5E\u6027\u957F\u5EA6\u6700\u5927\u503C
Max_Attribute_Length.description=\u6307\u5B9A\u5355\u4E2A\u5C5E\u6027\u503C\u7684\u6700\u5927\u957F\u5EA6\u3002\u5F53\u4E00\u4E2A\u5143\u6570\u636E\u9879\u5305\u542B\u591A\u4E2A\u503C\u65F6\uFF0C\u8FD9\u4E9B\u503C\u4F1A\u88AB\u5408\u5E76\u5728\u4E00\u8D77\uFF0C\u76F4\u5230\u957F\u5EA6\u8FBE\u5230\u8BE5\u6700\u5927\u957F\u5EA6\u503C\uFF0C\u7136\u540E\u5728\u540E\u9762\u6DFB\u52A0",..."\u5B57\u7B26\u4E32\uFF0C\u8868\u793A\u989D\u5916\u7684\u503C\u88AB\u4E22\u5F03\u4E86\u3002\u5982\u679C\u5355\u4E2A\u503C\u7684\u957F\u5EA6\u6BD4\u8BE5\u503C\u8FD8\u5927\uFF0C\u90A3\u4E48\u5B83\u5C06\u88AB\u622A\u65AD\uFF0C\u5E76\u5728\u540E\u9762\u6DFB\u52A0"(truncated)"\u5B57\u7B26\u4E32\uFF0C\u4EE5\u8868\u793A\u53D1\u751F\u4E86\u622A\u65AD\u3002
Metadata_Key_Filter.displayName=\u5143\u6570\u636E\u952E\u8FC7\u6EE4\u5668
Metadata_Key_Filter.description=\u6B63\u5219\u8868\u8FBE\u5F0F\uFF0C\u6807\u8BC6\u4ECE\u89E3\u6790\u5668\u63A5\u6536\u5230\u7684\u54EA\u4E9B\u5143\u6570\u636E\u952E\u5E94\u8BE5\u6DFB\u52A0\u5230\u6D41\u6587\u4EF6\u5C5E\u6027\u4E2D\u3002\u5982\u679C\u4E3A\u7A7A\uFF0C\u5219\u6240\u6709\u7684\u5143\u6570\u636E\u952E\u90FD\u5C06\u88AB\u52A0\u5230\u6D41\u6587\u4EF6\u5C5E\u6027\u4E2D\u3002
Metadata_Key_Prefix.displayName=\u5143\u6570\u636E\u952E\u524D\u7F00
Metadata_Key_Prefix.description=\u6DFB\u52A0\u5230\u5143\u6570\u636E\u952E\u7684\u524D\u7F00\u6587\u672C\uFF0C\u5143\u6570\u636E\u7684\u952E\u5C06\u6DFB\u52A0\u5230\u6D41\u6587\u4EF6\u7684\u5C5E\u6027\u4E2D\u3002\u5EFA\u8BAE\u4EE5\u7C7B\u4F3C"."\u6216"-"\u7684\u5206\u9694\u7B26\u7ED3\u5C3E\uFF0C\u7EC4\u4EF6\u9ED8\u8BA4\u4E0D\u6DFB\u52A0\u5206\u9694\u7B26\u3002
__Relationship.success.description=\u4EFB\u4F55\u6210\u529F\u63D0\u53D6\u5A92\u4F53\u5143\u6570\u636E\u7684\u6D41\u6587\u4EF6\u90FD\u5C06\u88AB\u8DEF\u7531\u5230\u6B64\u8FDE\u7EBF\u3002
__Relationship.failure.description=\u4EFB\u4F55\u63D0\u53D6\u5A92\u4F53\u5143\u6570\u636E\u5931\u8D25\u7684\u6D41\u6587\u4EF6\u90FD\u5C06\u88AB\u8DEF\u7531\u5230\u6B64\u8FDE\u7EBF\u3002
__WritesAttribute.Metadata_Key_Prefixattribute.description=\u5982\u679C\u6307\u5B9A"\u5143\u6570\u636E\u952E\u524D\u7F00"\uFF0C\u5219\u63D0\u53D6\u7684\u5185\u5BB9\u5143\u6570\u636E\u5C06\u4EE5\u5C5E\u6027\u540D"<\u5143\u6570\u636E\u952E\u524D\u7F00><\u5C5E\u6027\u540D>"\u63D2\u5165\u5230\u6D41\u6587\u4EF6\u4E2D\uFF0C\u5426\u5219\u4EE5"<\u5C5E\u6027\u540D>"\u65B9\u5F0F\u63D2\u5165\u3002
