__CapabilityDescription=DNS\u67e5\u8be2\u5904\u7406\u5668, \u4e3b\u8981\u7528\u4e8e\u901a\u8fc7\u57fa\u4e8e DNS \u7684 APIs \u6765\u4e30\u5bcc\u6570\u636e\u6d41 (\u4f8b\u5982\uff1aRBLs, ShadowServer \u7684 ASN \u67e5\u8be2), \u4e5f\u53ef\u7528\u4e8e\u6267\u884c\u5e38\u89c4 \u7684DNS\u67e5\u8be2\u3002
__Tags=dns, enrich, ip
QUERY_INPUT.displayName=\u67e5\u8be2\u5185\u5bb9
QUERY_INPUT.description=DNS\u67e5\u8be2\u5185\u5bb9\u7684\u503c
QUERY_PARSER.displayName=\u5207\u5206\u7ed3\u679c\u7684\u65b9\u6cd5
QUERY_PARSER.description=\u6307\u5b9a\u5207\u5206\u65b9\u6cd5\uff0c\u7528\u6765\u5c06\u67e5\u8be2\u540e\u7684\u7ed3\u679c\u5207\u5206\u6210\u6d41\u6587\u4ef6\u5c5e\u6027\u7ec4
__AllowableValue.QUERY_PARSER.None.displayName=\u65e0
__AllowableValue.QUERY_PARSER.None.description=\u4e0d\u62c6\u5206\u67e5\u8be2\u7ed3\u679c
__AllowableValue.QUERY_PARSER.RegEx.displayName=\u6b63\u5219\u8868\u8fbe\u5f0fRegEx
__AllowableValue.QUERY_PARSER.RegEx.description=\u4f7f\u7528\u6b63\u5219\u8868\u8fbe\u5f0f\u5c06\u67e5\u8be2\u7ed3\u679c\u5206\u5272\u6210\u5c5e\u6027\u7ec4Use a regular expression to split the results into attributes 
__AllowableValue.QUERY_PARSER.Split.displayName=\u5206\u9694Split
__AllowableValue.QUERY_PARSER.Split.description=\u4f7f\u7528\u5206\u9694\u7b26\u6216\u8005\u6b63\u5219\u8868\u8fbe\u5f0f\u5c06\u67e5\u8be2\u7ed3\u679c\u5206\u5272\u6210\u5c5e\u6027\u7ec4
QUERY_PARSER_INPUT.displayName=\u62c6\u5206\u539f\u5219
QUERY_PARSER_INPUT.description=\u62c6\u5206\u539f\u5219\uff0c\u586b\u5165\u76f8\u5e94\u7684\u5206\u5272\u7b26\u6216\u8005\u6b63\u5219\u8868\u8fbe\u5f0f\uff0c\u4ee5\u4fbf\u5c06\u67e5\u8be2\u7ed3\u679c\u6839\u636e\u586b\u5165\u7684\u5206\u5272\u7b26\u6216\u8005\u6b63\u5219\u7684\u5339\u914d\u6a21\u5f0f\uff0c\u5728\u62c6\u5206\u6216\u5339\u914d\u5b8c\u6210\u540e\u653e\u5165\u5230\u6d41\u6587\u4ef6\u5c5e\u6027\u7ec4\u4e2d\u3002\n\u6ce8\u610f\: \u5982\u6d89\u53ca\u591a\u884c\u6b63\u5219\u5339\u914d,\u9700\u8981\u8003\u8651\u8ffd\u5c3e\u6362\u884c\u7b26\u7684\u5904\u7406\u3002
DNS_RETRIES.displayName=DNS\u67e5\u8be2\u7684\u91cd\u8bd5\u6b21\u6570
DNS_RETRIES.description=\u6307\u5b9aDNS\u67e5\u8be2\u7684\u5c1d\u8bd5\u6b21\u6570
DNS_TIMEOUT.displayName=\u67e5\u8be2\u8d85\u65f6
DNS_TIMEOUT.description=\u8bbe\u7f6e\u7b49\u5f85\u65f6\u957f\uff0c\u5f53\u65f6\u95f4\u8d85\u8fc7\u8be5\u8bbe\u5b9a\u7684\u503c\u65f6\u5219\u88ab\u8ba4\u4e3aDNS\u67e5\u8be2\u5931\u8d25\u3002
DNS_SERVER.displayName=DNS\u670d\u52a1\u5730\u5740\uff08\u6216\u5730\u5740\u5217\u8868\uff09
DNS_SERVER.description=\u9017\u53f7\u5206\u9694\u7684DNS\u670d\u52a1\u5668\u5217\u8868\uff08\u5982\u679c\u4e0d\u586b\u5219\u9ed8\u8ba4\u91c7\u7528\u5f53\u524d\u7cfb\u7edf\u7ea7\u522b\u7684DNS\u670d\u52a1\u5668\uff09
DNS_QUERY_TYPE.displayName=DNS\u67e5\u8be2\u7c7b\u578b
DNS_QUERY_TYPE.description=\u4e3aDNS\u67e5\u8be2\u8bbe\u7f6e\u67e5\u8be2\u65b9\u5f0f\uff08\u6bd4\u5982\uff1a TXT\: \u4e00\u822c\u6307\u67d0\u4e2a\u4e3b\u673a\u540d\u6216\u57df\u540d\u7684\u8bf4\u660e\uff0cA\:Address\u5730\u5740,CNAME\: Canonical Name \u89c4\u8303\u540d\u79f0, NS\:NameServer \u57df\u540d\u670d\u52a1\u5668\uff09
__Relationship.not_found.description=\u8def\u7531\u6307\u5411-\u672a\u5339\u914d\u5230\u7ed3\u679c\u7684\u903b\u8f91\u5206\u652f\uff0c\u5f53DNS\u67e5\u8be2\u7ed3\u679c\u4e2d\u6ca1\u6709\u5305\u542b\uff08\u6839\u636e\u62c6\u5206\u539f\u5219\u6240\u8fc7\u6ee4\u51fa\u6765\u7684\uff09\u67e5\u8be2\u4fe1\u606f\u65f6\uff0c\u5728\u8be5\u7ec4\u4ef6\u5904\u7406\u5b8c\u6210\u540e\u6240\u6d41\u5411\u7684\u903b\u8f91\u5206\u652f\u3002Where to route flow files if data enrichment query rendered no results
__Relationship.found.description=\u8def\u7531\u6307\u5411-\u5339\u914d\u5230\u7ed3\u679c\u7684\u903b\u8f91\u5206\u652f\uff0c\u5f53DNS\u67e5\u8be2\u7ed3\u679c\u4e2d\u5305\u542b\uff08\u6839\u636e\u62c6\u5206\u539f\u5219\u6240\u8fc7\u6ee4\u51fa\u6765\u7684\uff09\u67e5\u8be2\u4fe1\u606f\u65f6\uff0c\u67e5\u8be2\u7ed3\u679c\u88ab\u653e\u7f6e\u6d41\u6587\u4ef6\u5c5e\u6027\u7ec4\u4e2d\uff0c\u5728\u8be5\u7ec4\u4ef6\u5904\u7406\u5b8c\u6210\u540e\u6240\u6d41\u5411\u7684\u903b\u8f91\u5206\u652f\u3002
__WritesAttribute.enrich.dns.record_.group_.description=\u6839\u636e\u62c6\u5206\u539f\u5219\u88ab\u6355\u83b7\u7684\u5b57\u6bb5\u96c6\uff0c\u4f1a\u88ab\u76f8\u5e94\u5730\u5206\u6210\u4e0d\u540c\u7684\u6d41\u6587\u4ef6\u5c5e\u6027\u7ec4\uff08\u5206\u914d\u4f9d\u636e\uff1a\u57fa\u4e8e\u5176\u5728\u67e5\u8be2\u7ed3\u679c\u4e2d\u6240\u5904\u7684\u7ed3\u679c\u96c6\u4f4d\u7f6e\uff09\u3002
