__CapabilityDescription=\u57fa\u4e8e\u8bc4\u4f30\u6bcf\u4e2a\u6d41\u6587\u4ef6\u7684\u8868\u8fbe\u5f0f\u8bed\u8a00\u8868\u8fbe\u5f0f\u6765\u8ddf\u8e2a\u6eda\u52a8\u7a97\u53e3\uff0c\u5e76\u5c06\u8be5\u503c\u6dfb\u52a0\u5230\u5904\u7406\u5668\u72b6\u6001\u3002 \u6bcf\u4e00\u4e2a\u6d41\u6587\u4ef6\u5c06\u4f1a\u7531\u6d41\u6587\u4ef6\u7684\u6570\u91cf\u548c\u5f53\u524d\u65f6\u95f4\u7a97\u53e3\u5904\u7406\u7684\u603b\u805a\u5408\u503c\u53d1\u51fa\u3002
__Tags=Attribute Expression Language, state, data science, rolling, window, \u5c5e\u6027\u8868\u8fbe\u8bed\u8a00, \u72b6\u6001, \u6570\u636e\u79d1\u5b66, \u6eda\u52a8, \u7a97\u53e3
Value_to_track.displayName=\u8ddf\u8e2a\u503c
Value_to_track.description=\u8bc4\u4f30\u6bcf\u4e2a\u6d41\u6587\u4ef6\u7684\u8868\u8fbe\u5f0f\u3002\u8868\u8fbe\u5f0f\u7684\u7ed3\u679c\u5c06\u4f1a\u52a0\u5165\u5230\u6eda\u52a8\u7a97\u53e3\u7684\u503c\u4e2d\u3002
Time_window.displayName=\u65f6\u95f4\u7a97\u53e3
Time_window.description=\u6765\u8ba1\u7b97\u6eda\u52a8\u7a97\u53e3\u7684\u65f6\u95f4\u7a97\u53e3\u3002
Sub-window_length.displayName=\u5b50\u7a97\u53e3\u957f\u5ea6
Sub-window_length.description=\u5f53\u8bbe\u5b9a\u540e\uff0c\u8be5\u503c\u5c06\u4f1a\u5206\u6279\u5230\u8bbe\u5b9a\u957f\u5ea6\u7684\u5b50\u7a97\u53e3\u4e2d\u3002\u8fd9\u5c06\u5141\u8bb8\u8bbe\u5b9a\u66f4\u5927\u957f\u5ea6\u7684\u603b\u7a97\u53e3\u4f46\u662f\u4f1a\u727a\u7272\u4e00\u4e9b\u7cbe\u5ea6\u3002 \u5982\u679c\u8be5\u503c\u6ca1\u6709\u88ab\u8bbe\u5b9a\uff08\u6216\u8005\u662f0\uff09\uff0c\u90a3\u4e48\u6bcf\u4e00\u4e2a\u503c\u5c06\u4f1a\u548c\u5176\u88ab\u6536\u5230\u65f6\u7684\u65f6\u95f4\u6233\u4e00\u8d77\u88ab\u4fdd\u5b58\u8fdb\u72b6\u6001\u4e2d\u3002\u5728\u65f6\u95f4\u957f\u5ea6\u5728\u65f6\u95f4\u7a97\u53e3\u4e2d\u6d88\u901d\u540e\uff0c\u8be5\u503c\u5c06\u88ab\u79fb\u9664\u3002\u5982\u679c\u8be5\u503c\u88ab\u8bbe\u5b9a\uff0c\u8be5\u503c\u5c06\u4f1a\u4e0e\u6bcf\u4e00\u4e2aX\u65f6\u95f4\u76f8\u7ec4\u5408\uff08X\u4e3a\u8be5\u5c5e\u6027\u7684\u65f6\u95f4\u5468\u671f\uff09\u5e76\u4e14\u5c06\u4f1a\u4e00\u8d77\u88ab\u5220\u9664\u3002
__Relationship.set_state_fail.description=\u5f53\u5904\u7406\u6d41\u6587\u4ef6\u65f6\u72b6\u6001\u4fdd\u5b58\u5931\u8d25\u65f6\uff0c\u6d41\u6587\u4ef6\u5c06\u4f1a\u88ab\u8def\u7531\u5230\u8fd9\u91cc\u3002
__Relationship.success.description=\u6240\u6709\u88ab\u6210\u529f\u5904\u7406\u7684\u6d41\u6587\u4ef6\u5c06\u4f1a\u88ab\u8def\u7531\u5230\u8fd9\u91cc\u3002
__Relationship.failure.description=\u5f53\u4e00\u4e2a\u6d41\u6587\u4ef6\u56e0\u4e3a\u67d0\u79cd\u539f\u56e0\u5931\u8d25\u800c\u4e0d\u662f\u8bbe\u7f6e\u72b6\u6001\u5931\u8d25\u7684\u5c06\u4f1a\u88ab\u8def\u7531\u5230\u8fd9\u91cc\u3002
__WritesAttribute.rolling_window_value.description=\u6eda\u52a8\u7a97\u53e3\u7684\u503c\uff08\u6240\u6709\u4fdd\u5b58\u7684\u503c\u7684\u603b\u548c\uff09\u3002
__WritesAttribute.rolling_window_count.description=\u5728\u6eda\u52a8\u7a97\u53e3\u91cc\u9762\u53ef\u770b\u5230\u7684\u6d41\u6587\u4ef6\u7684\u6570\u91cf\u7684\u8ba1\u6570\u3002
__WritesAttribute.rolling_window_mean.description=\u5728\u6eda\u52a8\u7a97\u53e3\u91cc\u9762\u53ef\u4ee5\u770b\u5230\u7684\u6d41\u6587\u4ef6\u7684\u5747\u503c\u3002
__Stateful.description=\u50a8\u5b58\u652f\u6301\u6eda\u52a8\u7a97\u53e3\u7684\u503c\u3002\u8be5\u503c\u5305\u62ec\u4e86\u50a8\u5b58\u6240\u6709\u72ec\u7acb\u503c\u548c\u4ed6\u4eec\u7684\u65f6\u95f4\u6233\uff0c\u6216\u8005\u7ec4\u5408\u503c\u548c\u4ed6\u4eec\u7684\u8ba1\u6570\u3002
