__CapabilityDescription=\u8be5\u7ec4\u4ef6\u5c06\u8f93\u5165\u6570\u636e\u6d41\u7684\u5185\u5bb9\u901a\u8fc7Hive Streaming\u5c06\u6570\u636e\u5199\u5165\u5230Hive\u8868\u4e2d\u3002\u8f93\u5165\u6570\u636e\u6d41\u5fc5\u987b\u662fAvro\u683c\u5f0f\u4e14Hive\u8868\u5fc5\u987b\u5b58\u5728\u3002\u5206\u533a\u503c\u662f\u6839\u636e\u7ec4\u4ef6\u4e2d\u6307\u5b9a\u7684\u300a\u5206\u533a\u5217\u300b\u7684\u540d\u79f0\u4eceAvro\u8bb0\u5f55\u4e2d\u63d0\u53d6\u7684\u3002 \u6ce8\u610f\uff1a\u5982\u679c\u7ec4\u4ef6\u591a\u7ebf\u7a0b\u8fd0\u884c\uff0c\u4e00\u4e2a\u7ebf\u7a0b\u5728\u4efb\u4f55\u65f6\u5019\u53ea\u80fd\u5199\u5165\u4e00\u4e2a\u8868\u3002\u6253\u7b97\u5199\u5165\u540c\u4e00\u8868\u7684\u5176\u4ed6\u4efb\u52a1\u5c06\u7b49\u5f85\u5f53\u524d\u4efb\u52a1\u5b8c\u6210\u5bf9\u8868\u7684\u5199\u5165\u3002
__Tags=hive, streaming, put, database, store, \u6d41, \u5199\u5165
hive-stream-metastore-uri.displayName=Hive Metastore URI
hive-stream-metastore-uri.description=\u6307\u5b9aHive Metastore\u7684URI\u5730\u5740. \u6ce8\u610f\u8fd9\u4e0d\u662fHive \u670d\u52a1\u7684\u5730\u5740\u3002\u9ed8\u8ba4\u7aef\u53e3\u53f7\u4e3a 9043
hive-config-resources.displayName=Hive\u914d\u7f6e
hive-config-resources.description=\u6307\u5b9a\u7531\u9017\u53f7\u5206\u9694\u7b26\u5206\u9694\u7684\u591a\u4e2aHive\u914d\u7f6e\u6587\u4ef6\u3002\u5982\u679c\u4e0d\u8bbe\u7f6e\uff0c\u5219Hadoop\u5c06\u641c\u7d22\u7c7b\u8def\u5f84(classpath)\u67e5\u627e'hive-site.xml'\u6587\u4ef6\uff0c\u6216\u8fd8\u539f\u4e3a\u9ed8\u8ba4\u914d\u7f6e\u3002 \u6ce8\u610f\uff0c\u5982\u679c\u542f\u7528\u4e86Kerberos\u8ba4\u8bc1\uff0c\u5219\u5fc5\u987b\u63d0\u4f9b\u914d\u7f6e\u6587\u4ef6\u3002\u540c\u65f6\uff0c\u5982\u679c\u591a\u7ebf\u7a0b\u4efb\u52a1\u5927\u4e8e1\uff0c\u5219\u9700\u8981\u5c06 'hcatalog.hive.client.cache.disabled'\u5c5e\u6027\u8bbe\u7f6e\u4e3a'true' \u6765\u907f\u514d\u5e76\u53d1\u95ee\u9898
hive-stream-database-name.displayName=\u6570\u636e\u5e93\u540d
hive-stream-database-name.description=\u6307\u5b9a\u6570\u636e\u5199\u5165\u7684\u6570\u636e\u5e93\u540d
hive-stream-table-name.displayName=\u8868\u540d
hive-stream-table-name.description=\u6307\u5b9a\u6570\u636e\u5199\u5165\u6570\u636e\u5e93\u7684\u8868\u540d
hive-stream-partition-cols.displayName=\u5206\u533a\u5217
hive-stream-partition-cols.description=\u5bf9\u8868\u8fdb\u884c\u5206\u533a\u7684\u4ee5\u9017\u53f7\u5206\u9694\u7684\u5217\u540d\u5217\u8868\uff0c\u6b64\u5217\u8868\u4e2d\u7684\u503c\u7684\u987a\u5e8f\u5fc5\u987b\u4e0e\u8868\u521b\u5efa\u671f\u95f4\u6307\u5b9a\u7684\u5206\u533a\u5217\u7684\u987a\u5e8f\u5b8c\u5168\u5bf9\u5e94\u3002
hive-stream-autocreate-partition.displayName=\u81ea\u52a8\u521b\u5efa\u5206\u533a
hive-stream-autocreate-partition.description=\u6307\u5b9a\u662f\u5426\u81ea\u52a8\u521b\u5efa\u4e0d\u5b58\u5728\u7684\u5206\u533a
__AllowableValue.hive-stream-autocreate-partition.false.displayName=\u5426
__AllowableValue.hive-stream-autocreate-partition.true.displayName=\u662f
hive-stream-max-open-connections.displayName=\u6700\u5927\u5f00\u653e\u8fde\u63a5\u6570
hive-stream-max-open-connections.description=\u540c\u65f6\u4ece\u8fd9\u4e2a\u6c60\u4e2d\u5206\u914d\u7684\u6700\u5927\u6253\u5f00\u8fde\u63a5\u6570\uff0c\u6216\u8005\u4e3a\u8d1f\uff0c\u6ca1\u6709\u9650\u5236
hive-stream-heartbeat-interval.displayName=\u5fc3\u8df3\u95f4\u9694
hive-stream-heartbeat-interval.description=\u5f53\u7ecf\u8fc7\u6307\u5b9a\u7684\u79d2\u6570\u65f6\u5e94\u53d1\u9001\u5fc3\u8df3\u3002\u503c0\u8868\u793a\u4e0d\u5e94\u8be5\u53d1\u9001\u5fc3\u8df3\u3002\u6ce8\u610f\u8be5\u53c2\u6570\u4e0d\u652f\u6301\u6570\u636e\u6d41\u5c5e\u6027\u7684\u8868\u8fbe\u5f0f\u5c5e\u6027
hive-stream-transactions-per-batch.displayName=\u5206\u6279\u6570\u91cf(\u4e8b\u52a1)
hive-stream-transactions-per-batch.description=\u6307\u5b9a\u4e00\u6279\u4e8b\u52a1\u5904\u7406\u591a\u5c11\u6570\u636e\uff0c\u5fc5\u987b\u5927\u4e8e1
hive-stream-records-per-transaction.displayName=\u6bcf\u6279\u8bb0\u5f55\u6570
hive-stream-records-per-transaction.description=\u6bcf\u6b21\u63d0\u4ea4\u4e8b\u52a1\u8981\u5904\u7406\u7684\u8bb0\u5f55\u6570\u3002\u8fd9\u4e2a\u503c\u5fc5\u987b\u5927\u4e8e1\u3002
hive-stream-call-timeout.displayName=\u8c03\u7528\u8d85\u65f6
hive-stream-call-timeout.description=\u5141\u8bb8Hive Streaming\u5b8c\u6210\u64cd\u4f5c\u9700\u8981\u7684\u65f6\u957f\uff08\u79d2\u6570\uff09\uff0c0\u8868\u793a\u4e00\u76f4\u7b49\u5f85\u5b8c\u6210\u3002\u6ce8\u610f\u8be5\u53c2\u6570\u4e0d\u652f\u6301\u6570\u636e\u6d41\u5c5e\u6027\u7684\u8868\u8fbe\u5f0f\u5c5e\u6027
rollback-on-failure.displayName=\u5931\u8d25\u56de\u6eda
rollback-on-failure.description=\u6307\u5b9a\u5982\u4f55\u5904\u7406\u5931\u8d25\u3002\u9ed8\u8ba4\u4e0d\u56de\u6eda\uff0c\u5982\u679c\u6709\u4efb\u4f55\u9519\u8bef\u5c06\u6839\u636e\u9519\u8bef\u7c7b\u578b\u8def\u7531\u5230\u5931\u8d25\u8fde\u7ebf\u6216\u91cd\u8bd5\u8fde\u7ebf\uff0c\u800c\u4e0d\u963b\u6b62\u4e0b\u6b21\u6570\u636e\u6d41\u5904\u7406\u3002\u76f8\u53cd\uff0c\u5982\u679c\u60f3\u56de\u6eda\u5f53\u524d\u6570\u636e\u6d41\u5e76\u7acb\u5373\u505c\u6b62\u5904\u7406\uff0c\u5219\u53ef\u8bbe\u7f6e\u4e3a\u56de\u6eda\u3002 \u5982\u679c\u542f\u7528\u56de\u6eda\uff0c\u5931\u8d25\u7684\u6570\u636e\u6d41\u5c06\u4fdd\u7559\u5728\u8f93\u5165\u8fde\u7ebf\u4e2d\u4e14\u6ca1\u6709\u60e9\u7f5a\uff0c\u76f4\u5230\u88ab\u91cd\u590d\u5904\u7406\u5e76\u6210\u529f\u6216\u8005\u88ab\u5220\u9664\u6389\u3002\u91cd\u8981\u7684\u662f\u8981\u8bbe\u7f6e\u8db3\u591f\u7684\u201c\u5ef6\u8fdf\u65f6\u957f\u201d\uff0c\u4ee5\u907f\u514d\u8fc7\u4e8e\u9891\u7e41\u5730\u91cd\u8bd5\u3002 \u6ce8\u610f\uff1a When an error occurred after a Hive streaming transaction which is derived from the same input FlowFile is already committed, (i.e. a FlowFile contains more records than 'Records per Transaction' and a failure occurred at the 2nd transaction or later) then the succeeded records will be transferred to 'success' relationship while the original input FlowFile stays in incoming queue. Duplicated records can be created for the succeeded ones when the same FlowFile is processed again.
__AllowableValue.rollback-on-failure.false.displayName=false
__AllowableValue.rollback-on-failure.true.displayName=true
kerberos-credentials-service.displayName=Kerberos\u8bc1\u4e66\u670d\u52a1
kerberos-credentials-service.description=\u6307\u5b9a\u7528\u4e8eKerberos\u6388\u6743\u7684\u8bc1\u4e66\u670d\u52a1\u914d\u7f6e
Kerberos_Principal.displayName=Kerberos Principal
Kerberos_Principal.description=\u6307\u5b9a\u7528\u4e8e\u8ba4\u8bc1\u7684Kerberos principal\u3002 \u9700\u8981\u8bbe\u7f6e\u5728 orchsym.properties \u914d\u7f6e\u6587\u4ef6\u4e2d\u8bbe\u7f6e orchsym.kerberos.krb5.file
Kerberos_Keytab.displayName=Kerberos Keytab
Kerberos_Keytab.description=\u6307\u5b9a\u7528\u4e8e\u5173\u8054Principal\u8ba4\u8bc1\u7684Kerberos keytab\u3002 \u9700\u8981\u8bbe\u7f6e\u5728 orchsym.properties \u914d\u7f6e\u6587\u4ef6\u4e2d\u8bbe\u7f6e orchsym.kerberos.krb5.file
__Relationship.retry.description=\u5982\u679c\u8f93\u5165\u6570\u636e\u6d41\u7684\u8bb0\u5f55\u4e0d\u80fd\u4f20\u5199\u5165Hive\uff0c\u5219\u5c06\u5176\u8def\u7531\u5230\u6b64\u8fde\u7ebf\u3002\u6ce8\u610f\uff0c\u4e00\u4e9b\u8bb0\u5f55\u53ef\u80fd\u5df2\u7ecf\u6210\u529f\u5904\u7406\uff0c\u5b83\u4eec\u5c06\u88ab\u8def\u7531\u5230\u6210\u529f\u5173\u7cfb(\u4f5c\u4e3aAvro)\u3002\u91cd\u8bd5\u3001\u6210\u529f\u548c\u5931\u8d25\u8fde\u7ebf\u7684\u7ec4\u5408\u8868\u660e\u6709\u591a\u5c11\u8bb0\u5f55\u6210\u529f\u548c/\u6216\u5931\u8d25\u3002\u8fd9\u53ef\u4ee5\u7528\u6765\u63d0\u4f9b\u91cd\u8bd5\u529f\u80fd\uff0c\u56e0\u4e3a\u4e0d\u53ef\u80fd\u5b8c\u5168\u56de\u6eda\u3002
__Relationship.success.description=\u8bb0\u5f55\u6210\u529f\u5199\u5165\u5230Hive\u540e\u8def\u7531\u5230\u6b64\u8fde\u7ebf
__Relationship.failure.description=\u8f93\u5165\u6570\u636e\u6d41\u8bb0\u5f55\u4e0d\u80fd\u5199\u5165Hive\u5c06\u8def\u7531\u5230\u6b64\u8fde\u7ebf
__WritesAttribute.hivestreaming.record.count.description=\u8be5\u5c5e\u6027\u5747\u5728\u6210\u529f\u548c\u5931\u8d25\u8fde\u7ebf\uff0c\u5206\u522b\u5305\u542b\u5199\u5165\u6210\u529f\u548c\u4e0d\u6210\u529f\u7684\u4f20\u5165\u6d41\u6587\u4ef6\u4e2d\u7684\u8bb0\u5f55\u6570
__WritesAttribute.query.output.tables.description=\u5305\u542b\u683c\u5f0f\u4e3a 'databaseName.tableName'\u7684\u8f93\u51fa\u8868\u5217\u8868
