__CapabilityDescription=\u4F7F\u7528\u7279\u6B8A\u7684\u8BB0\u5F55\u8BFB\u53D6\u5668\u5C06\u8F93\u5165\u6570\u636E\u6D41\u7684\u8BB0\u5F55\uFF08\u53EF\u80FD\u591A\u4E2A\uFF09\u5199\u5165\u6570\u636E\u5E93\u3002 \u8BB0\u5F55\u5C06\u88AB\u8F6C\u6362\u6210SQL\u8BED\u53E5\u5E76\u88AB\u6279\u91CF\u6267\u884C\u3002 \u5982\u679C\u6709\u9519\u8BEF\u53D1\u751F\uFF0C\u6570\u636E\u6D41\u5C06\u901A\u8FC7'failure'\u6216\u8005'retry'\u8FDE\u7EBF\u8F93\u51FA\uFF0C\u5982\u679C\u8BB0\u5F55\u90FD\u4F20\u8F93\u6210\u529F\uFF0C\u5219\u8F93\u5165\u6570\u636E\u6D41\u5C06\u901A\u8FC7'success'\u8FDE\u7EBF\u8F93\u51FA.  \u8BED\u53E5\u7C7B\u578B\u901A\u8FC7\u8BE5\u7EC4\u4EF6\u63D0\u4F9B\u53C2\u6570\u9009\u62E9'INSERT'\u3001'UPDATE'\u548C'DELETE'\uFF0C\u4EE5\u53CA\u901A\u8FC7\u53C2\u6570 '\u4F7F\u7528statement.type\u5C5E\u6027'\uFF08\u6765\u81EA\u4E8E\u8F93\u5165\u6570\u636E\u6D41\u4E0A\u7684\u5C5E\u6027\uFF09\u6765\u6307\u5B9A\u3002 \u6CE8\u610F\uFF1A\u5982\u679C\u8BED\u53E5\u7C7B\u578B\u662F'UPDATE'\uFF0C\u5219\u8F93\u5165\u6570\u636E\u6D41\u7684\u8BB0\u5F55\u4E0D\u80FD\u7528\u4E8E\u6539\u53D8\u4E3B\u952E\uFF08\u6216\u7528\u6237\u6307\u5B9A\u7684\u66F4\u65B0\u952E\uFF09\u7684\u503C\u3002\u5982\u679C\u9047\u5230\u6B64\u79CD\u60C5\u51B5\uFF0C\u5411\u6570\u636E\u5E93\u53D1\u51FA\u7684UPDATE\u8BED\u53E5\u53EF\u80FD\u4EC0\u4E48\u4E5F\u4E0D\u505A\uFF08\u5982\u679C\u4E0D\u5B58\u5728\u4E8E\u8BB0\u5F55\u4E2D\u7684\u65B0\u7684\u4E3B\u952E\u503C\u6CA1\u6709\u627E\u5230\uFF09\u3002\u6216\u8005\u53EF\u80FD\u65E0\u610F\u4E2D\u7834\u574F\u73B0\u6709\u6570\u636E\uFF08\u901A\u8FC7\u66F4\u6539\u4E3B\u952E\u7684\u66F4\u65B0\u503C\u6240\u5728\u7684\u8BB0\u5F55)\u3002
__Tags=sql, record, jdbc, put, database, update, insert, delete, \u6570\u636E\u5E93, \u66F4\u65B0, \u63D2\u5165, \u5220\u9664
put-db-record-record-reader.displayName=\u8BB0\u5F55\u8BFB\u53D6\u5668
put-db-record-record-reader.description=\u6307\u5B9A\u7528\u4E8E\u89E3\u6790\u8F93\u5165\u6570\u636E\u6D41\u6570\u636E\u683C\u5F0F\u7684\u670D\u52A1
put-db-record-statement-type.displayName=\u8BED\u53E5\u7C7B\u578B
put-db-record-statement-type.description=\u6307\u5B9A\u751F\u6210SQL\u8BED\u53E5\u7684\u7C7B\u578B\u3002\u5982\u679C\u9009\u62E9'\u4F7F\u7528statement.type\u5C5E\u6027\u8BBE\u7F6E'\uFF0C\u90A3\u4E48\u5C06\u4ECE\u6570\u636E\u6D41\u4E0A\u8BFB\u53D6\u8BE5\u5C5E\u6027\u3002 
__AllowableValue.put-db-record-statement-type.DELETE.displayName=DELETE
__AllowableValue.put-db-record-statement-type.INSERT.displayName=INSERT
__AllowableValue.put-db-record-statement-type.UPDATE.displayName=UPDATE
__AllowableValue.put-db-record-statement-type.Use_statement.type_Attribute.displayName=\u4F7F\u7528statement.type\u5C5E\u6027\u8BBE\u7F6E
put-db-record-dcbp-service.displayName=\u6570\u636E\u5E93\u8FDE\u63A5\u6C60
put-db-record-dcbp-service.description=\u7528\u4E8E\u521B\u5EFA\u6570\u636E\u5E93\u8FDE\u63A5\u6C60\u7684\u670D\u52A1
database-transaction-session.displayName=\u6570\u636E\u5E93\u4E8B\u52A1\u4F1A\u8BDD\u670D\u52A1
database-transaction-session.description=\u6307\u5B9A\u7528\u4E8E\u5173\u8054\u6570\u636E\u6D41\u4E0B\u6E38\u6570\u636E\u5E93\u4E8B\u52A1\u8FDE\u63A5\u7684\u4F1A\u8BDD\u670D\u52A1
transaction-in-flow.displayName=\u4E8B\u52A1\u5904\u7406\u65B9\u5F0F
transaction-in-flow.description=\u662F\u5426\u5728\u4E0B\u6E38\u7EC4\u4EF6\uFF08CommitDatabase\u3001RollbackDatabase\uFF09\u4E2D\u5904\u7406\u4E8B\u52A1\u3002\u5982\u679C\u9009\u62E9\u4E0B\u6E38\u7EC4\u4EF6\u5904\u7406\u4E8B\u52A1\uFF0C\u901A\u8FC7\u952E\u503C\u5B58\u50A8\u670D\u52A1\u5B58\u50A8\u6570\u636E\u5E93\u8FDE\u63A5\uFF0C\u5E76\u4E14\u5728\u4E0B\u6E38\u670D\u52A1\u4E2D\uFF0C\u901A\u8FC7database.connection.identifier\u83B7\u53D6\u6570\u636E\u5E93\u8FDE\u63A5\uFF0C\u505A\u63D0\u4EA4&\u56DE\u6EDA\u64CD\u4F5C\u3002
__AllowableValue.transaction-in-flow.true.displayName=\u4E0B\u6E38\u7EC4\u4EF6\u5904\u7406\u4E8B\u52A1
__AllowableValue.transaction-in-flow.false.displayName=\u5F53\u524D\u7EC4\u4EF6\u5904\u7406\u4E8B\u52A1
put-db-record-catalog-name.displayName=Catalog\u540D
put-db-record-catalog-name.description=\u7528\u4E8E\u66F4\u65B0\u8BED\u53E5\u7684\u6570\u636E\u5E93Catalog\u540D\u5B57\u3002\u5982\u679C\u6570\u636E\u5E93\u4E0D\u652F\u6301Catalog\uFF0C\u53EF\u5C06\u8BE5\u53C2\u6570\u7F6E\u7A7A\u3002
put-db-record-schema-name.displayName=Schema\u540D
put-db-record-schema-name.description=\u6307\u5B9A\u6570\u636E\u5E93\u8868\u7684Schema\u540D\u3002\u5982\u679C\u6570\u636E\u5E93\u4E0D\u652F\u6301Catalog\uFF0C\u53EF\u5C06\u8BE5\u53C2\u6570\u7F6E\u7A7A\u3002
put-db-record-table-name.displayName=\u8868\u540D
put-db-record-table-name.description=\u751F\u6548\u8BED\u53E5\u7684\u6570\u636E\u5E93\u8868\u540D
put-db-record-translate-field-names.displayName=\u8F6C\u6362\u5B57\u6BB5\u540D
put-db-record-translate-field-names.description=\u662F\u5426\u5C1D\u8BD5\u9002\u5F53\u7B2C\u8F6C\u6362\u5B57\u6BB5\u540D\u4E3A\u6570\u636E\u5E93\u53EF\u63A5\u53D7\u7684\u8868\u5B57\u6BB5\u540D\u3002\u5426\u5219\u8F93\u5165\u8BB0\u5F55\u5B57\u6BB5\u540D\u5FC5\u987B\u7CBE\u786E\u5339\u914D\u6570\u636E\u5E93\u7684\u5B57\u6BB5\u540D\uFF0C\u4E0D\u7136\u5219\u6570\u636E\u5E93\u5B57\u6BB5\u5C06\u4E0D\u88AB\u66F4\u65B0\u3002
__AllowableValue.put-db-record-translate-field-names.false.displayName=\u4E0D\u8F6C\u6362
__AllowableValue.put-db-record-translate-field-names.true.displayName=\u8F6C\u6362
put-db-record-unmatched-field-behavior.displayName=\u6570\u636E\u6D41\u5B57\u6BB5\u4E0D\u5339\u914D\u5904\u7406
put-db-record-unmatched-field-behavior.description=\u5982\u679C\u8F93\u5165\u6570\u636E\u6D41\u8BB0\u5F55\u4E2D\u6709\u4E00\u5B57\u6BB5\u4E0D\u5339\u914D\u6570\u636E\u5E93\u8868\u7684\u5B57\u6BB5\uFF0C\u8BE5\u53C2\u6570\u51B3\u5B9A\u5982\u4F55\u5904\u7406\u8FD9\u79CD\u60C5\u51B5\u3002
__AllowableValue.put-db-record-unmatched-field-behavior.Fail_on_Unmatched_Fields.displayName=\u5931\u8D25
__AllowableValue.put-db-record-unmatched-field-behavior.Fail_on_Unmatched_Fields.description=\u5982\u679C\u6709\u4EFB\u4F55\u4E00\u4E2A\u5B57\u6BB5\u4E0D\u80FD\u5339\u914D\u6570\u636E\u5E93\u7684\u5B57\u6BB5\uFF0C\u5219\u6570\u636E\u6D41\u5C06\u8F93\u51FA\u5230'failure'\u8FDE\u7EBF
__AllowableValue.put-db-record-unmatched-field-behavior.Ignore_Unmatched_Fields.displayName=\u5FFD\u7565
__AllowableValue.put-db-record-unmatched-field-behavior.Ignore_Unmatched_Fields.description=\u4EFB\u4F55\u4E0D\u80FD\u5339\u914D\u6570\u636E\u5E93\u7684\u5B57\u6BB5\u90FD\u5C06\u88AB\u5FFD\u7565
put-db-record-unmatched-column-behavior.displayName=\u6570\u636E\u5E93\u5B57\u6BB5\u4E0D\u5339\u914D\u5904\u7406
put-db-record-unmatched-column-behavior.description=\u5982\u679C\u6570\u636E\u5E93\u8868\u7684\u5B57\u6BB5\u6CA1\u6709\u4E00\u4E2A\u8F93\u5165\u6570\u636E\u6D41\u8BB0\u5F55\u7684\u5B57\u6BB5\u6240\u5339\u914D\uFF0C\u8BE5\u53C2\u6570\u51B3\u5B9A\u5982\u4F55\u5904\u7406\u8FD9\u79CD\u60C5\u51B5\u3002
__AllowableValue.put-db-record-unmatched-column-behavior.Fail_on_Unmatched_Columns.displayName=\u5931\u8D25
__AllowableValue.put-db-record-unmatched-column-behavior.Fail_on_Unmatched_Columns.description=\u5982\u679C\u6570\u636E\u5E93\u8868\u7684\u5B57\u6BB5\u6CA1\u6709\u4E00\u4E2A\u8F93\u5165\u8BB0\u5F55\u5B57\u6BB5\u5339\u914D\uFF0C\u5219\u6570\u636E\u6D41\u5904\u7406\u5C06\u5931\u8D25\uFF0C\u5E76\u8BB0\u5F55\u9519\u8BEF\u65E5\u5FD7
__AllowableValue.put-db-record-unmatched-column-behavior.Ignore_Unmatched_Columns.displayName=\u5FFD\u7565
__AllowableValue.put-db-record-unmatched-column-behavior.Ignore_Unmatched_Columns.description=\u4EFB\u4F55\u6570\u636E\u5E93\u8868\u7684\u5B57\u6BB5\u6CA1\u6709\u4E00\u4E2A\u8F93\u5165\u8BB0\u5F55\u5B57\u6BB5\u5339\u914D\uFF0C\u5219\u5047\u5B9A\u8BE5\u5B57\u6BB5\u4E3A\u4E0D\u5FC5\u987B\uFF0C\u5E76\u5FFD\u7565
__AllowableValue.put-db-record-unmatched-column-behavior.Warn_on_Unmatched_Columns.displayName=\u8B66\u544A
__AllowableValue.put-db-record-unmatched-column-behavior.Warn_on_Unmatched_Columns.description=\u4EFB\u4F55\u6570\u636E\u5E93\u8868\u7684\u5B57\u6BB5\u6CA1\u6709\u4E00\u4E2A\u8F93\u5165\u8BB0\u5F55\u5B57\u6BB5\u5339\u914D\uFF0C\u5219\u5047\u5B9A\u8BE5\u5B57\u6BB5\u4E3A\u4E0D\u5FC5\u987B\uFF0C\u5E76\u8BB0\u5F55\u8B66\u544A\u65E5\u5FD7
put-db-record-update-keys.displayName=\u66F4\u65B0\u5B57\u6BB5
put-db-record-update-keys.description=\u7528\u4E8E\u6570\u636E\u5E93\u505AUPDATE\u66F4\u65B0\u64CD\u4F5C\u7684\u5B57\u6BB5\u5217\u8868\uFF0C\u4E14\u7531\u82F1\u6587\u9017\u53F7\u5206\u9694\u591A\u4E2A\u5B57\u6BB5\u540D\u3002\u5982\u679C<\u8BED\u53E5\u7C7B\u578B>\u4E3A'UPDATE'\u4E14\u4E0D\u8BBE\u7F6E\u6539\u53C2\u6570\uFF0C\u5219\u89C6\u4E3A\u81EA\u52A8\u4F7F\u7528\u6570\u636E\u5E93\u7684\u4E3B\u952E\u5217\u8868\uFF0C\u5982\u679C\u8868\u6CA1\u6709\u4E3B\u952E\u4E14\u2019\u6570\u636E\u5E93\u5B57\u6BB5\u4E0D\u5339\u914D\u5904\u7406\u2018\u88AB\u8BBE\u7F6E\u4E3A'\u5931\u8D25'\uFF0C\u5219\u8F6C\u6362SQL\u5C06\u5931\u8D25\u3002\u5982\u679C<\u8BED\u53E5\u7C7B\u578B>\u662F'INSERT'\u5219\u5FFD\u7565\u8BE5\u53C2\u6570\u3002
put-db-record-field-containing-sql.displayName=\u5305\u542BSQL\u7684\u5B57\u6BB5
put-db-record-field-containing-sql.description=\u5982\u679C\u8BED\u53E5\u7C7B\u578B\u662F'SQL' (\u901A\u8FC7'statement.type'\u5C5E\u6027)\uFF0C\u8BE5\u53C2\u6570\u6307\u5B9A\u90A3\u4E9B\u8F93\u5165\u8BB0\u5F55\u5B57\u6BB5\u4E2D\u5305\u542B\u6709SQL\u8BED\u53E5\u5E76\u5C06\u6267\u884C\u3002\u5B57\u6BB5\u503C\u5FC5\u987B\u662F\u7B80\u5355\u7684SQL\u8BED\u53E5\u3002\u5982\u679C\u8BED\u53E5\u7C7B\u578B\u4E0D\u662F'SQL'\uFF0C\u5C06\u5FFD\u7565\u8BE5\u53C2\u6570\u3002
put-db-record-quoted-identifiers.displayName=\u8F6C\u4E49\u5B57\u6BB5\u540D
put-db-record-quoted-identifiers.description=\u662F\u5426\u652F\u6301\u5C06\u6240\u6709\u5B57\u6BB5\u90FD\u8F6C\u4E49\uFF0C\u8FD9\u6837\u5C31\u53EF\u4EE5\u7528\u4E00\u4E9B\u7279\u6B8A\u5B57\u7B26\u4F5C\u4E3A\u6570\u636E\u5E93\u8868\u5B57\u6BB5\u540D\u7684\u4E00\u90E8\u5206\u3002
__AllowableValue.put-db-record-quoted-identifiers.false.displayName=\u4E0D\u8F6C\u4E49
__AllowableValue.put-db-record-quoted-identifiers.true.displayName=\u8F6C\u4E49
put-db-record-quoted-table-identifiers.displayName=\u8F6C\u4E49\u8868\u540D
put-db-record-quoted-table-identifiers.description=\u662F\u5426\u652F\u6301\u5C06\u4E00\u4E9B\u7279\u6B8A\u5B57\u7B26\u4F5C\u4E3A\u6570\u636E\u5E93\u8868\u540D\u7684\u4E00\u90E8\u5206\u3002
__AllowableValue.put-db-record-quoted-table-identifiers.false.displayName=\u4E0D\u8F6C\u4E49
__AllowableValue.put-db-record-quoted-table-identifiers.true.displayName=\u8F6C\u4E49
put-db-record-query-timeout.displayName=\u67E5\u8BE2\u8D85\u65F6
put-db-record-query-timeout.description=\u5141\u8BB8\u6267\u884CSQL\u8BED\u53E5\u7684\u6700\u5927\u7B49\u5F85\u65F6\u95F4\uFF0C0\u8868\u793A\u65E0\u9650\u5236\uFF0C\u4E14\u5C0F\u4E8E1\u79D2\u88AB\u89C6\u4E3A\u7B49\u540C0\u79D2\u3002
rollback-on-failure.displayName=\u5931\u8D25\u56DE\u6EDA
rollback-on-failure.description=\u6307\u5B9A\u5982\u4F55\u5904\u7406\u6267\u884C\u9519\u8BEF\u60C5\u51B5\uFF0C\u9ED8\u8BA4\u60C5\u51B5\u4E0B\uFF08'\u5426'\uFF09\uFF0C\u5982\u679C\u5728\u5904\u7406\u6570\u636E\u91CF\u65F6\u6709\u9519\u8BEF\u53D1\u751F\uFF0C\u90A3\u4E48\u6570\u636E\u6D41\u5C06\u6839\u636E\u9519\u8BEF\u7C7B\u578B\u6765\u51B3\u5B9A\u901A\u8FC7'failure'\u6216\u8005'retry'\u8FDE\u7EBF\u8F93\u51FA\uFF0C\u5E76\u4F7F\u5F97\u7EC4\u4EF6\u53EF\u4EE5\u7EE7\u7EED\u4E0B\u4E00\u4E2A\u6570\u636E\u6D41\u5904\u7406\u3002\u53CD\u4E4B\uFF0C\u5982\u679C\u60F3\u8981\u56DE\u6EDA\u5F53\u524D\u5904\u7406\u7684\u6570\u636E\u6D41\u5E76\u7ACB\u5373\u505C\u6B62\u5176\u4ED6\u5904\u7406\uFF0C\u5219\u53EF\u5C06\u8BE5\u9009\u9879\u8BBE\u7F6E\u4E3A'\u662F'\u3002\u5E76\u4E14\u5931\u8D25\u7684\u6570\u636E\u6D41\u5C06\u4FDD\u7559\u5728\u8F93\u5165\u8FDE\u7EBF\u4E0A\u800C\u4E0D\u4F1A\u542F\u7528\u60E9\u7F5A\u6A21\u5F0F\uFF0C\u76F4\u5230\u53EF\u7EE7\u7EED\u5904\u7406\u6210\u529F\u6216\u9009\u62E9\u5176\u4ED6\u65B9\u5F0F\u5904\u7406\u3002\u540C\u65F6\u9700\u8981\u6CE8\u610F\u975E\u5E38\u91CD\u8981\u7684\u4E00\u70B9\u5C31\u662F\u9002\u5F53\u52A0\u5927'\u7B49\u5F85\u65F6\u957F'\u8BBE\u7F6E\uFF0C\u4EE5\u5E94\u5BF9\u91CD\u8BD5\u8FC7\u4E8E\u9891\u7E41\u7684\u60C5\u51B5\u3002
__AllowableValue.rollback-on-failure.false.displayName=\u4E0D\u56DE\u6EDA
__AllowableValue.rollback-on-failure.true.displayName=\u56DE\u6EDA
__Relationship.retry.description=\u5982\u679C\u6570\u636E\u5E93\u4E0D\u80FD\u66F4\u65B0\u4F46\u53EF\u901A\u8FC7\u518D\u6B21\u5C1D\u8BD5\u64CD\u4F5C\u53EF\u80FD\u6210\u529F\u65F6\uFF0C\u6570\u636E\u6D41\u5C06\u901A\u8FC7\u6B64\u8FDE\u7EBF\u8F93\u51FA
__Relationship.success.description=\u6210\u529F\u6267\u884CSQL\u8BED\u53E5\u540E\uFF0C\u6570\u636E\u6D41\u901A\u8FC7\u6B64\u8FDE\u7EBF\u8F93\u51FA
__Relationship.failure.description=\u5982\u679C\u6570\u636E\u5E93\u4E0D\u80FD\u66F4\u65B0\u5E76\u901A\u8FC7\u518D\u6B21\u5C1D\u8BD5\u64CD\u4F5C\u8FD8\u662F\u5931\u8D25\uFF0C\u4F8B\u5982\u65E0\u6548\u67E5\u8BE2\u6216\u8FDD\u53CDSQL\u7EA6\u675F\u89C4\u8303\uFF0C\u6570\u636E\u6D41\u5C06\u901A\u8FC7\u6B64\u8FDE\u7EBF\u8F93\u51FA
__ReadsAttribute.statement.type.description=\u5982\u679C\u9009\u62E9<\u8BED\u53E5\u7C7B\u578B>\u7684'\u4F7F\u7528statement.type\u5C5E\u6027'\uFF0C\u8BE5\u5C5E\u6027\u503C\u5C06\u88AB\u7528\u6765\u51B3\u5B9A\u8BED\u53E5\u7C7B\u578B\u7684\u751F\u6210\u548C\u6267\u884C\uFF0C\u6BD4\u5982INSERT, UPDATE, DELETE, SQL,\u7B49\u7B49
__WritesAttribute.putdatabaserecord.error.description=\u5728\u6267\u884C\u5904\u7406\u8FC7\u7A0B\u4E2D\uFF0C\u5982\u679C\u6709\u9519\u8BEF\uFF0C\u6570\u636E\u6D41\u5C06\u901A\u8FC7'failure'\u6216'retry'\u8FDE\u7EBF\u8F93\u51FA,\u8BE5\u5C5E\u6027\u5C06\u88AB\u7528\u6765\u8BB0\u5F55\u53D1\u751F\u7684\u9519\u8BEF
