__CapabilityDescription=\u901a\u8fc7\u8bbe\u7f6e\u62c6\u5206\u884c\u6570\u548c\u5927\u5c0f\u53c2\u6570\u5c06\u6587\u672c\u6587\u4ef6\u62c6\u5206\u4e3a\u591a\u4e2a\u8f83\u5c0f\u7684\u6587\u672c\u6587\u4ef6\u3002\u6bcf\u4e2a\u8f93\u51fa\u62c6\u5206\u6587\u4ef6\u5c06\u5305\u542b\u7684\u884c\u6570\u6216\u5b57\u8282\u6570\u4e0d\u8d85\u8fc7\u914d\u7f6e\u7684\u884c\u6570\u6216\u5b57\u8282\u6570\u3002 \u5982\u679c\u540c\u65f6\u8bbe\u7f6e\u300a\u62c6\u5206\u884c\u300b\u548c\u300a\u62c6\u5206\u5927\u5c0f\u300b\uff0c\u5219\u4ee5\u6700\u5c0f\u7684\u90a3\u4e2a\u62c6\u5206\u503c\u4e3a\u57fa\u51c6\u3002\u5982\u679c\u5206\u7247\u7684\u7b2c\u4e00\u884c\u8d85\u8fc7\u4e86\u300a\u62c6\u5206\u5927\u5c0f\u300b\uff0c\u5219\u8be5\u884c\u5c06\u76f4\u63a5\u8f93\u51fa\uff0c\u5176\u7ed3\u679c\u5c31\u662f\u8d85\u8fc7\u4e86\u8bbe\u7f6e\u503c\uff0c\u800c\u5ffd\u7565\u8bbe\u7f6e\u3002\u6b64\u7ec4\u4ef6\u8fd8\u5141\u8bb8\u6307\u5b9a\u6bcf\u4e2a\u62c6\u5206\u90fd\u53ef\u5305\u542b\u6807\u9898\u884c\u3002 \u53ef\u4ee5\u901a\u8fc7\u6307\u5b9a\u5e94\u6784\u6210\u6807\u9898\u7684\u884c\u7684\u6570\u91cf\u6216\u4f7f\u7528\u6807\u9898\u6807\u8bb0\u4e0e\u8bfb\u53d6\u884c\u5339\u914d\u6765\u8ba1\u7b97\u6807\u9898\u884c\u3002\u5982\u679c\u53d1\u751f\u8fd9\u79cd\u5339\u914d\uff0c\u5219\u76f8\u5e94\u7684\u884c\u5c06\u88ab\u89c6\u4e3a\u6807\u9898\u3002\u8bf7\u8bb0\u4f4f\uff0c\u5728\u5934\u6807\u8bb0\u5339\u914d\u7b2c\u4e00\u6b21\u5931\u8d25\u65f6\uff0c\u5c06\u4e0d\u518d\u6267\u884c\u4efb\u4f55\u5339\u914d\uff0c\u5176\u4f59\u6570\u636e\u5c06\u88ab\u89e3\u6790\u4e3a\u7ed9\u5b9a\u62c6\u5206\u7684\u5e38\u89c4\u884c\u3002\u5982\u679c\u5728\u8ba1\u7b97\u6807\u9898\u5934\u4e4b\u540e\u6ca1\u6709\u66f4\u591a\u7684\u6570\u636e\uff0c\u90a3\u4e48\u5f97\u5230\u7684\u62c6\u5206\u5c06\u53ea\u5305\u542b\u6807\u9898\u5934\u884c\u3002
__Tags=split, text, \u62c6\u5206, \u6587\u672c, \u5207\u5272
Line_Split_Count.displayName=\u62c6\u5206\u884c\u6570
Line_Split_Count.description=\u5c06\u6dfb\u52a0\u5230\u6bcf\u4e2a\u62c6\u5206\u6587\u4ef6\u4e2d\u7684\u884c\u6570\uff0c\u4e0d\u5305\u62ec\u6807\u9898\u5934\u884c\u3002 \u5f53\u503c\u4e3a0\u65f6\u3002\u5219\u8981\u6c42\u5fc5\u987b\u8bbe\u7f6e\u300a\u62c6\u5206\u5927\u5c0f\u300b\uff0c\u800c\u4e0d\u8003\u8651\u884c\u6570
Maximum_Fragment_Size.displayName=\u62c6\u5206\u5927\u5c0f
Maximum_Fragment_Size.description=\u6bcf\u4e2a\u62c6\u5206\u6587\u4ef6\u7684\u5927\u5c0f\uff0c\u5305\u542b\u6807\u9898\u5934\u884c\u3002\u6ce8\u610f\uff1a\u5982\u679c\u4e00\u884c\u8d85\u8fc7\u6b64\u5c5e\u6027\uff08\u5305\u62ec\u6807\u9898\uff0c\u5982\u679c\u9002\u7528\uff09\uff0c\u5219\u8be5\u884c\u5c06\u76f4\u63a5\u8f93\u51fa\uff0c\u800c\u8d85\u8fc7\u8be5\u53c2\u6570\u8bbe\u7f6e
Header_Line_Count.displayName=\u6807\u9898\u884c\u6570
Header_Line_Count.description=\u5e94\u89c6\u4e3a\u6807\u9898\u90e8\u5206\u7684\u884c\u6570\uff1b\u6807\u9898\u884c\u5c06\u590d\u5236\u5230\u6240\u6709\u62c6\u5206\u6587\u4ef6\u4e2d
Header_Line_Marker_Characters.displayName=\u6807\u9898\u884c\u6807\u8bb0
Header_Line_Marker_Characters.description=\u6570\u636e\u6587\u4ef6\u884c\u4e0a\u8868\u793a\u6807\u9898\u884c\u7684\u7b2c\u4e00\u4e2a\u5b57\u7b26\u3002\u5f53\u300a\u6807\u9898\u884c\u6570\u300b\u4e3a\u975e\u96f6\u65f6\uff0c\u5c06\u5ffd\u7565\u6b64\u503c\u3002\u4e0d\u5305\u542b\u6807\u9898\u884c\u6807\u8bb0\u5b57\u7b26\u7684\u7b2c\u4e00\u884c\u548c\u6240\u6709\u540e\u7eed\u884c\u88ab\u89c6\u4e3a\u975e\u6807\u9898\u884c\u3002
Remove_Trailing_Newlines.displayName=\u5220\u9664\u5c3e\u90e8\u6362\u884c\u7b26
Remove_Trailing_Newlines.description=\u662f\u5426\u5220\u9664\u6bcf\u4e2a\u62c6\u5206\u6587\u4ef6\u672b\u5c3e\u7684\u6362\u884c\u7b26\u3002\u5982\u679c\u60a8\u6253\u7b97\u7a0d\u540e\u5408\u5e76\u62c6\u5206\u7684\u6587\u4ef6\uff0c\u8fd9\u5e94\u8be5\u9009\u62e9\u201c\u4fdd\u7559\u201d\u3002\u5982\u679c\u9009\u62e9\u201c\u5220\u9664\u201d\uff0c\u5e76\u4e14\u751f\u6210\u7684\u6570\u636e\u6d41\u4ec5\u5305\u542b\u201c\u7a7a\u884c\u201d\uff08\u5373\u4ec5\u5305\u542b\r\u548c\n\u5b57\u7b26\uff09\uff0c\u5219\u4e0d\u4f1a\u751f\u6210\u6570\u636e\u6d41\u8f93\u51fa\u3002\u4f46\u662f\uff0c\u8bf7\u6ce8\u610f\uff0c\u5982\u679c\u6307\u5b9a\u4e86\u6807\u9898\u884c\uff0c\u5219\u7ed3\u679c\u6d41\u6587\u4ef6\u5c06\u6c38\u8fdc\u4e0d\u4f1a\u4e3a\u7a7a\uff0c\u56e0\u4e3a\u5b83\u5c06\u7531\u6807\u9898\u884c\u7ec4\u6210\uff0c\u56e0\u6b64\u53ef\u80fd\u4f1a\u53d1\u51fa\u53ea\u5305\u542b\u6807\u9898\u884c\u7684\u6570\u636e\u6d41\u3002
__AllowableValue.Remove_Trailing_Newlines.false.displayName=\u4fdd\u7559
__AllowableValue.Remove_Trailing_Newlines.true.displayName=\u5220\u9664
__Relationship.failure.description=\u5982\u679c\u7531\u4e8e\u67d0\u79cd\u539f\u56e0\u65e0\u6cd5\u62c6\u5206\u6587\u4ef6\uff0c\u5219\u539f\u59cb\u6587\u4ef6\u5c06\u8def\u7531\u5230\u6b64\u8fde\u7ebf\uff0c\u800c\u4e0d\u4f1a\u8def\u7531\u5230\u5176\u4ed6\u8fde\u7ebf
__Relationship.original.description=\u5f53\u539f\u59cb\u8f93\u5165\u6587\u4ef6\u6210\u529f\u62c6\u5206\u4e3a\u4e00\u4e2a\u6216\u591a\u4e2a\u6587\u4ef6\u65f6\uff0c\u5b83\u5c06\u88ab\u8def\u7531\u5230\u6b64\u8fde\u7ebf
__Relationship.splits.description=\u5f53\u8f93\u5165\u6587\u4ef6\u6210\u529f\u62c6\u5206\u4e3a\u4e00\u4e2a\u6216\u591a\u4e2a\u62c6\u5206\u6587\u4ef6\u65f6\uff0c\u62c6\u5206\u6587\u4ef6\u5c06\u8def\u7531\u5230\u6b64\u8fde\u7ebf
__WritesAttribute.text.line.count.description=\u4ece\u539f\u59cb\u6d41\u6587\u4ef6\u590d\u5236\u5230\u6b64\u6570\u636e\u6d41\u4e2d\u7684\u6587\u672c\u884c\u6570
__WritesAttribute.fragment.size.description=\u4ece\u539f\u59cb\u6d41\u6587\u4ef6\u590d\u5236\u5230\u6b64\u6570\u636e\u6d41\u4e2d\u7684\u5b57\u8282\u6570\uff0c\u5305\u62ec\u5728\u6bcf\u4e2a\u62c6\u5206\u6570\u636e\u6d41\u4e2d\u6807\u9898\u5934\uff08\u5982\u679c\u9002\u7528\uff09\u3002
__WritesAttribute.fragment.identifier.description=\u4ece\u540c\u4e00\u7236\u6570\u636e\u6d41\u751f\u6210\u7684\u6240\u6709\u62c6\u5206\u6570\u636e\u6d41\u90fd\u5c06\u6dfb\u52a0\u5177\u6709\u76f8\u540c\u7684\u968f\u673a\u751f\u6210\u7684UUID\u503c\u3002
__WritesAttribute.fragment.index.description=\u4e00\u4e2a\u5411\u4e0a\u7684\u6570\u5b57\uff0c\u6307\u793a\u4ece\u5355\u4e2a\u7236\u6570\u636e\u6d41\u521b\u5efa\u7684\u62c6\u5206\u6570\u636e\u6d41\u5e8f\u53f7
__WritesAttribute.fragment.count.description=\u4ece\u7236\u6570\u636e\u6d41\u751f\u6210\u7684\u62c6\u5206\u6570\u636e\u6d41\u603b\u6570
__WritesAttribute.segment.original.filename_.description=\u7236\u6570\u636e\u6d41\u7684\u6587\u4ef6\u540d
__SystemResource.MEMORY.description=\u6570\u636e\u6d41\u7684\u5c5e\u6027\u5b58\u50a8\u5728\u5185\u5b58\u4e2d\uff0c\u800c\u4e0d\u662f\u6570\u636e\u6d41\u7684\u5185\u5bb9\u3002\u5982\u679c\u7531\u4e8e\u5185\u5bb9\u7684\u5927\u5c0f\u6216\u5982\u4f55\u5c06\u5185\u5bb9\u914d\u7f6e\u4e3a\u62c6\u5206\u800c\u751f\u6210\u8bb8\u591a\u62c6\u5206\uff0c\u5219\u53ef\u80fd\u9700\u8981\u4f7f\u7528\u4e24\u9636\u6bb5\u65b9\u6cd5\u6765\u907f\u514d\u8fc7\u5ea6\u4f7f\u7528\u5185\u5b58\u3002
