__CapabilityDescription=\u6839\u636e\u4e00\u7ec4\u7528\u6237\u81ea\u5b9a\u4e49\u7684\u6587\u672c\u6570\u636e\u89c4\u5219\u8def\u7531\u6570\u636e\u6d41\u7684\u8f93\u51fa\u3002 \u8f93\u5165\u7684\u6570\u636e\u6d41\u4e2d\u7684\u6bcf\u4e00\u884c\u90fd\u9700\u8981\u4e0e\u7528\u6237\u81ea\u5b9a\u4e49\u7684\u5c5e\u6027\u503c\u8fdb\u884c\u6bd4\u8f83\u5339\u914d\u3002 \u5c06\u6587\u672c\u4e0e\u8fd9\u4e9b\u7528\u6237\u81ea\u5b9a\u4e49\u7684\u5c5e\u6027\u8fdb\u884c\u6bd4\u8f83\u7684\u673a\u5236\u7531\u201c\u5339\u914d\u7b56\u7565\u201d\u6765\u51b3\u5b9a\u3002 \u7136\u540e\u6839\u636e\u8fd9\u4e9b\u89c4\u5219\u8def\u7531\u6570\u636e\uff0c\u5e76\u5206\u522b\u8def\u7531\u6587\u672c\u4e2d\u7684\u6bcf\u4e00\u884c\u3002
__Tags=attributes, routing, text, regexp, regex, Regular Expression, Expression Language, csv, filter, logs, delimited, \u8def\u7531, \u6b63\u5219, \u8fc7\u6ee4
Routing_Strategy.displayName=\u8def\u7531\u7b56\u7565
Routing_Strategy.description=\u6839\u636e\u8def\u7531\u7b56\u7565\u548c\u7528\u6237\u81ea\u5b9a\u4e49\u5c5e\u6027\u6765\u5339\u914d\u6bcf\u4e00\u884c\u8f93\u5165\u6587\u672c\uff0c\u5e76\u51b3\u5b9a\u8f93\u51fa\u5230\u54ea\u4e2a\u8f93\u51fa\u6570\u636e\u6d41
__AllowableValue.Routing_Strategy.Route_to_matched_if_line_matches_all_conditions.displayName=\u6ee1\u8db3\u6240\u6709\u6761\u4ef6\u65f6\u8def\u7531\u5230\u201cmatched\u201d\u8fde\u7ebf
__AllowableValue.Routing_Strategy.Route_to_matched_if_line_matches_all_conditions.description=\u6240\u6709\u7528\u6237\u81ea\u5b9a\u4e49\u7684\u8868\u8fbe\u5f0f\u4e3a\u201ctrue\u201d\u65f6\uff0c\u5219\u89c6\u4e3a\u5339\u914d
__AllowableValue.Routing_Strategy.Route_to_matched_if_lines_matches_any_condition.displayName=\u6ee1\u8db3\u4efb\u4e00\u4e2a\u6761\u4ef6\u65f6\u8def\u7531\u5230\u201cmatched\u201d
__AllowableValue.Routing_Strategy.Route_to_matched_if_lines_matches_any_condition.description=\u4efb\u610f\u4e00\u4e2a\u7528\u6237\u81ea\u5b9a\u4e49\u7684\u8868\u8fbe\u5f0f\u4e3a\u201ctrue\u201d\u65f6\uff0c\u5219\u89c6\u4e3a\u5339\u914d
__AllowableValue.Routing_Strategy.Route_to_each_matching_Property_Name.displayName=\u8def\u7531\u5230\u6bcf\u4e00\u4e2a\u5339\u914d\u5230\u7684\u5c5e\u6027\u503c
__AllowableValue.Routing_Strategy.Route_to_each_matching_Property_Name.description=\u5c5e\u6027\u8868\u8fbe\u5f0f\u503c\u4e3a\u201ctrue\u201d\u503c\u7684\u6587\u672c\u884c\u76f8\u5339\u914d\u7684\u6bcf\u4e00\u4e2a\u6570\u636e\u6d41\u8f93\u51fa
Matching_Strategy.displayName=\u5339\u914d\u7b56\u7565
Matching_Strategy.description=\u6307\u5b9a\u4f20\u5165\u7684\u6587\u672c\u884c\u5982\u4f55\u5339\u914d\u7528\u6237\u81ea\u5b9a\u4e49\u5c5e\u6027\u503c\u3002
__AllowableValue.Matching_Strategy.Contains.displayName=\u5305\u542b
__AllowableValue.Matching_Strategy.Contains.description=\u6587\u672c\u884c\u5305\u542b\u5c5e\u6027\u503c
__AllowableValue.Matching_Strategy.Contains_Regular_Expression.displayName=\u6b63\u5219\u8868\u8fbe\u5f0f\u5305\u542b
__AllowableValue.Matching_Strategy.Contains_Regular_Expression.description=\u6587\u672c\u884c\u662f\u5426\u5305\u542b\u80fd\u5339\u914d\u63d0\u4f9b\u7684\u6b63\u5219\u8868\u8fbe\u5f0f\u7684\u5185\u5bb9
__AllowableValue.Matching_Strategy.Ends_With.displayName=\u7ed3\u5c3e\u5339\u914d
__AllowableValue.Matching_Strategy.Ends_With.description=\u5c5e\u6027\u503c\u5339\u914d\u6587\u672c\u884c\u7684\u672b\u5c3e
__AllowableValue.Matching_Strategy.Equals.displayName=\u76f8\u540c
__AllowableValue.Matching_Strategy.Equals.description=\u6587\u672c\u884c\u4e0e\u5c5e\u6027\u503c\u76f8\u540c
__AllowableValue.Matching_Strategy.Matches_Regular_Expression.displayName=\u6b63\u5219\u8868\u8fbe\u5f0f\u5339\u914d
__AllowableValue.Matching_Strategy.Matches_Regular_Expression.description=\u6587\u672c\u884c\u662f\u5426\u4e0e\u63d0\u4f9b\u7684\u6b63\u5219\u8868\u8fbe\u5f0f\u503c\u5b8c\u5168\u5339\u914d
__AllowableValue.Matching_Strategy.Satisfies_Expression.displayName=\u4e50\u89c2\u5339\u914d
__AllowableValue.Matching_Strategy.Satisfies_Expression.description=\u6839\u636e\u662f\u5426\u6ee1\u8db3\u7ed9\u5b9a\u7684\u8868\u8fbe\u5f0f\u6765\u5339\u914d\u6587\u672c\u884c\uff08\u5982\u679c\u8868\u8fbe\u5f0f\u7684\u503c\u8fd4\u56de\u201ctrue\u201d\uff0c\u5219\u8868\u793a\u6587\u672c\u884c\u5339\u914d\uff09\u3002 \u8868\u8fbe\u5f0f\u4e5f\u80fd\u591f\u5f15\u7528\u6570\u636e\u6d41\u7684\u5c5e\u6027\u503c\uff0c\u6bd4\u5982\u53d8\u91cf'line'\uff08\u8981\u5339\u914d\u7684\u6587\u672c\u884c\uff09\u548c'lineNo'\uff08\u8fd9\u662f\u8981\u5339\u914d\u7684\u6587\u672c\u7684\u884c\u53f7\u3002\u5bf9\u4e8e\u7b2c\u4e00\u884c\uff0c\u8fd9\u5c06\u662f1\uff0c \u7b2c\u4e8c\u884c\u4e3a2\uff0c\u5982\u6b64\u5f80\u590d\uff09\u3002
__AllowableValue.Matching_Strategy.Starts_With.displayName=\u5f00\u5934\u5339\u914d
__AllowableValue.Matching_Strategy.Starts_With.description=\u5c5e\u6027\u503c\u5339\u914d\u6587\u672c\u884c\u7684\u5f00\u5934
Character_Set.displayName=\u5b57\u7b26\u7f16\u7801
Character_Set.description=\u4f20\u5165\u7684\u6587\u672c\u884c\u7684\u5b57\u7b26\u96c6\u7f16\u7801
Ignore_Leading_Trailing_Whitespace.displayName=\u5ffd\u7565\u5934\u5c3e\u7a7a\u767d
Ignore_Leading_Trailing_Whitespace.description=\u5728\u5339\u914d\u65f6\u662f\u5426\u5ffd\u7565\u6587\u672c\u884c\u5f00\u5934\u548c\u7ed3\u5c3e\u5904\u7684\u7a7a\u683c
Ignore_Case.displayName=\u5ffd\u7565\u5927\u5c0f\u5199
Ignore_Case.description=\u5982\u679c\u5ffd\u7565\uff0c\u5219\u5728\u6bd4\u8f83\u503c\u65f6\u4e0d\u4f1a\u8003\u8651\u5927\u5c0f\u5199\u3002 \u4f8b\u5982\uff0c\u4e0e'HELLO'\u6216'hello'\u5339\u914d\u5c06\u5177\u6709\u76f8\u540c\u7684\u7ed3\u679c\u3002 \u5982\u679c<\u5339\u914d\u7b56\u7565>\u8bbe\u7f6e\u4e3a\u201c\u4e50\u89c2\u5339\u914d\u201d\uff0c\u5219\u5ffd\u7565\u6b64\u5c5e\u6027\u3002
__AllowableValue.Ignore_Case.false.displayName=\u4e0d\u5ffd\u7565
__AllowableValue.Ignore_Case.true.displayName=\u5ffd\u7565
Grouping_Regular_Expression.displayName=\u5206\u7ec4\u6b63\u5219\u8868\u8fbe\u5f0f
Grouping_Regular_Expression.description=\u6307\u5b9a\u6b63\u5219\u8868\u8fbe\u5f0f\u4ee5\u9488\u5bf9\u6bcf\u4e00\u884c\u8fdb\u884c\u5339\u914d\uff0c\u4ee5\u786e\u5b9a\u5e94\u5c06\u8be5\u884c\u653e\u5165\u54ea\u4e2a\u6355\u83b7\u7ec4\u3002\u6b63\u5219\u8868\u8fbe\u5f0f\u5fc5\u987b\u81f3\u5c11\u6709\u4e00\u4e2a\u7528\u4e8e\u5339\u914d\u884c\u7684\u6355\u83b7\u7ec4\u3002 \u5982\u679c\u6b63\u5219\u8868\u8fbe\u5f0f\u4e2d\u5b58\u5728\u591a\u4e2a\u6355\u83b7\u7ec4\uff0c\u5219\u6240\u6709\u6355\u83b7\u7ec4\u7684\u503c\u5c06\u8fde\u63a5\u5728\u4e00\u8d77\u3002 \u9664\u975e\u4e24\u4e2a\u884c\u5177\u6709\u76f8\u540c\u7684\u7ec4\u503c\uff08\u6216\u8005\u4e24\u4e2a\u884c\u90fd\u4e0d\u5339\u914d\u6b63\u5219\u8868\u8fbe\u5f0f\uff09\uff0c\u5426\u5219\u4e0d\u4f1a\u5c06\u4e24\u884c\u653e\u5165\u540c\u4e00\u4e2a\u6570\u636e\u6d41\u4e2d\u3002 \u4f8b\u5982\uff0c\u8981\u5c06\u7b2c\u4e00\u5217\u4e2d\u7684CSV\u6587\u4ef6\u4e2d\u7684\u6240\u6709\u884c\u7ec4\u5408\u5728\u4e00\u8d77\uff0c\u6211\u4eec\u53ef\u4ee5\u5c06\u6b64\u503c\u8bbe\u7f6e\u4e3a\u201c(.*?),.*\u201d\u3002 \u5177\u6709\u76f8\u540c\u7ec4\u4f46\u5177\u6709\u4e0d\u540c\u8fde\u7ebf\u7684\u4e24\u884c\u6c38\u8fdc\u4e0d\u4f1a\u653e\u5728\u540c\u4e00\u4e2a\u6570\u636e\u6d41\u4e2d\u3002
Relationship_Name.description=\u4e0e\u7528\u6237\u81ea\u5b9a\u4e49\u6b63\u5219\u8868\u8fbe\u5f0f\u7684\u5c5e\u6027\u503c\u76f8\u5339\u914d\u7684\u5185\u5bb9\u8def\u7531\u5230\u6570\u636e\u6d41\u8f93\u51fa\uff0c\u8be5\u8f93\u51fa\u6570\u636e\u6d41\u7684\u540d\u5b57\u7531\u7528\u6237\u81ea\u5b9a\u4e49\u5c5e\u6027\u7684\u952e\u6240\u51b3\u5b9a\u3002
__Relationship.original.description=\u5f53\u6240\u6709\u8f93\u5165\u7684\u6587\u672c\u884c\u6d41\u5df2\u7ecf\u8def\u7531\u5230\u4e00\u4e2a\u6216\u591a\u4e2a\u8fde\u7ebf\u65f6\uff0c\u539f\u59cb\u8f93\u5165\u6570\u636e\u6d41\u5c06\u8def\u7531\u5230\u6b64\u8fde\u7ebf\u3002
__Relationship.unmatched.description=\u4e0d\u6ee1\u8db3\u7528\u6237\u81ea\u5b9a\u4e49\u89c4\u5219\u7684\u6570\u636e\u5c06\u8def\u7531\u5230\u6b64\u8fde\u7ebf
__Relationship.Name_from_Dynamic_Property.description=\u4e0e\u7528\u6237\u81ea\u5b9a\u4e49\u7684\u6b63\u5219\u8868\u8fbe\u5f0f\u5339\u914d\u7684\u6570\u636e\u6d41\u5c06\u8def\u7531\u5230\u6b64\u52a8\u6001\u8fde\u7ebf\u3002
__WritesAttribute.RouteText.Route.description=\u6570\u636e\u6d41\u8def\u7531\u5230\u7684\u8fde\u7ebf\u540d\u79f0\u3002
__WritesAttribute.RouteText.Group.description=\u201c\u5206\u7ec4\u6b63\u5219\u8868\u8fbe\u5f0f\u201d\u5c5e\u6027\u4e2d\u6240\u6709\u6355\u83b7\u7ec4\u6355\u83b7\u7684\u503c\u3002 \u5982\u679c\u672a\u8bbe\u7f6e\u6b64\u5c5e\u6027\u6216\u4e0d\u5305\u542b\u6355\u83b7\u7ec4\uff0c\u5219\u4e0d\u4f1a\u6dfb\u52a0\u6b64\u5c5e\u6027\u3002
