__CapabilityDescription=\u751f\u6210\u4ece\u8868\u4e2d\u83b7\u53d6\u201c\u9875\u201d\u7684SQL\u67e5\u8be2\u3002\u5206\u533a\u5927\u5c0f\u5c5e\u6027\u4ee5\u53ca\u8868\u7684\u884c\u6570\u786e\u5b9a\u9875\u9762\u7684\u5927\u5c0f\u548c\u6570\u91cf\u4ee5\u53ca\u751f\u6210\u7684FlowFiles\u3002\u6b64\u5916\uff0c\u53ef\u4ee5\u901a\u8fc7\u8bbe\u7f6e\u6700\u5927\u503c\u5217\u6765\u5b9e\u73b0\u589e\u91cf\u63d0\u53d6\uff0c\u8fd9\u4f1a\u4f7f\u7ec4\u4ef6\u8ddf\u8e2a\u5217\u7684\u6700\u5927\u503c\uff0c\u4ece\u800c\u4ec5\u83b7\u53d6\u5217\u7684\u503c\u8d85\u8fc7\u6700\u5927\u503c\u7684\u884c\u3002\u6b64\u7ec4\u4ef6\u4ec5\u7528\u4e8e\u5728\u4e3b\u8282\u70b9\u4e0a\u8fd0\u884c\u3002\n \n\u6b64\u7ec4\u4ef6\u53ef\u4ee5\u63a5\u53d7\u4f20\u5165\u8fde\u63a5;\u7ec4\u4ef6\u7684\u884c\u4e3a\u4f9d\u636e\u662f\u5426\u63d0\u4f9b\u4f20\u5165\u8fde\u63a5\u800c\u4e0d\u540c\\uff1a\n \u5982\u679c\u672a\u6307\u5b9a\u4f20\u5165\u8fde\u63a5\uff0c\u5219\u7ec4\u4ef6\u5c06\u6839\u636e\u6307\u5b9a\u7684\u7ec4\u5c06\u8ba1\u5212\u751f\u6210SQL\u67e5\u8be2\u3002\u8bb8\u591a\u5b57\u6bb5\u652f\u6301\u8868\u8fbe\u5f0f\u8bed\u8a00\uff0c\u4f46\u6ca1\u6709\u53ef\u7528\u7684\u6d41\u6587\u4ef6\u5c5e\u6027\u3002\u4f46\u662f\uff0c\u53ef\u4ee5\u4f7f\u7528\u53d8\u91cf\u6ce8\u518c\u8868\u5339\u914d\u5c5e\u6027\u3002\n \u5982\u679c\u6307\u5b9a\u4e86\u4f20\u5165\u8fde\u63a5\u4e14\u6ca1\u6709\u53ef\u7528\u4e8e\u7ec4\u4ef6\u4efb\u52a1\u7684\u6d41\u6587\u4ef6\uff0c\u5219\u4e0d\u4f1a\u6267\u884c\u4efb\u4f55\u5de5\u4f5c\u3002\n \u5982\u679c\u6307\u5b9a\u4e86\u4f20\u5165\u8fde\u63a5\u5e76\u4e14\u6d41\u6587\u4ef6\u53ef\u7528\u4e8e\u5904\u7ec4\u5c06\u4efb\u52a1\uff0c\u6d41\u6587\u4ef6\u7684\u5c5e\u6027\u53ef\u4ee5\u5728\u8868\u8fbe\u5f0f\u8bed\u8a00\u4e2d\u7528\u4e8e\u8bf8\u5982\u8868\u540d\u7b49\u5b57\u6bb5\u3002\u4f46\u662f\uff0cMax-Value Columns\u548cColumns to Return\u5b57\u6bb5\u5fc5\u987b\u4e3a\u7a7a\u6216\u5f15\u7528\u6bcf\u4e2a\u6307\u5b9a\u8868\u4e2d\u53ef\u7528\u7684\u5217\u3002
__Tags=sql, select, jdbc, query, database, fetch, generate
Database_Connection_Pooling_Service.displayName=\u6570\u636e\u5e93\u8fde\u63a5\u6c60
Database_Connection_Pooling_Service.description=\u7528\u4e8e\u83b7\u53d6\u4e0e\u6570\u636e\u5e93\u8fde\u63a5\u6c60\u7684\u670d\u52a1
db-fetch-db-type.displayName=\u6570\u636e\u5e93\u7c7b\u578b
db-fetch-db-type.description=\u6570\u636e\u5e93\u7684\u7c7b\u578b/\u98ce\u683c\uff0c\u7528\u4e8e\u751f\u6210\u7279\u5b9a\u6570\u636e\u5e93\u7684\u4ee3\u7801\u3002 \u5728\u8bb8\u591a\u60c5\u51b5\u4e0b\uff0c"\u901a\u7528"\u7c7b\u578b\u5e94\u8be5\u8db3\u591f\uff0c\u4f46\u662f\u67d0\u4e9b\u6570\u636e\u5e93\uff08\u4f8b\u5982Oracle\uff09\u9700\u8981\u81ea\u5b9a\u4e49SQL\u5b50\u53e5\u3002
__AllowableValue.db-fetch-db-type.Generic.displayName=\u901a\u7528
__AllowableValue.db-fetch-db-type.Generic.description=\u6807\u51c6ANSI SQL
__AllowableValue.db-fetch-db-type.MS_SQL_2008.displayName=MS SQL 2008
__AllowableValue.db-fetch-db-type.MS_SQL_2008.description=\u751f\u6210\u7b26\u5408MS SQL 2008\u6807\u51c6\u7684SQL
__AllowableValue.db-fetch-db-type.MS_SQL_2012+.displayName=MS SQL 2012+
__AllowableValue.db-fetch-db-type.MS_SQL_2012+.description=\u751f\u6210\u7b26\u5408OMS SQL 2012+\u6807\u51c6\u7684SQL
__AllowableValue.db-fetch-db-type.MySQL.displayName=MySQL
__AllowableValue.db-fetch-db-type.MySQL.description=\u751f\u6210\u7b26\u5408MySQL\u6807\u51c6\u7684SQL
__AllowableValue.db-fetch-db-type.Oracle.displayName=Oracle
__AllowableValue.db-fetch-db-type.Oracle.description=\u751f\u6210\u7b26\u5408Oracle\u6807\u51c6\u7684SQL
__AllowableValue.db-fetch-db-type.Oracle_12+.displayName=Oracle 12+
__AllowableValue.db-fetch-db-type.Oracle_12+.description=\u751f\u6210\u7b26\u5408Oracle 12+\u6216\u66f4\u9ad8\u7248\u672c\u6807\u51c6\u7684SQL
Table_Name.displayName=\u8868\u660e
Table_Name.description=\u8981\u67e5\u8be2\u7684\u6570\u636e\u5e93\u8868\u7684\u540d\u79f0\u3002
Columns_to_Return.displayName=\u8fd4\u56de\u5217\u540d
Columns_to_Return.description=\u67e5\u8be2\u4e2d\u4f7f\u7528\u7684\u4ee5\u9017\u53f7\u5206\u9694\u7684\u5217\u540d\u5217\u8868\u3002 \u5982\u679c\u60a8\u7684\u6570\u636e\u5e93\u9700\u8981\u5bf9\u540d\u79f0\u8fdb\u884c\u7279\u6b8a\u5904\u7406\uff08\u4f8b\u5982\u5f15\u7528\uff09\uff0c\u5219\u6bcf\u4e2a\u540d\u79f0\u90fd\u5e94\u5305\u542b\u6b64\u7c7b\u5904\u7406\u3002 \u5982\u679c\u672a\u63d0\u4f9b\u5217\u540d\uff0c\u5219\u5c06\u8fd4\u56de\u6307\u5b9a\u8868\u4e2d\u7684\u6240\u6709\u5217\u3002 \u6ce8\u610f\uff1a\u5bf9\u4e8e\u7ed9\u5b9a\u7684\u8868\u4f7f\u7528\u4e00\u81f4\u7684\u5217\u540d\u79f0\u4ee5\u4f7f\u589e\u91cf\u63d0\u53d6\u6b63\u5e38\u5de5\u4f5c\u975e\u5e38\u91cd\u8981\u3002
Maximum-value_Columns.displayName=\u6700\u5927\u503c\u5217
Maximum-value_Columns.description=\u4ee5\u9017\u53f7\u5206\u9694\u7684\u5217\u540d\u5217\u8868\u3002 \u7ec4\u4ef6\u5c06\u8ddf\u8e2a\u81ea\u7ec4\u4ef6\u5f00\u59cb\u8fd0\u884c\u4ee5\u6765\u8fd4\u56de\u7684\u6bcf\u5217\u7684\u6700\u5927\u503c\u3002 \u4f7f\u7528\u591a\u5217\u610f\u5473\u7740\u5217\u8868\u7684\u987a\u5e8f\uff0c\u5e76\u4e14\u9884\u671f\u6bcf\u5217\u7684\u503c\u6bd4\u524d\u4e00\u5217\u7684\u503c\u589e\u52a0\u5f97\u66f4\u6162\u3002 \u56e0\u6b64\uff0c\u4f7f\u7528\u591a\u5217\u610f\u5473\u7740\u5217\u7684\u5206\u5c42\u7ed3\u6784\uff0c\u901a\u5e38\u7528\u4e8e\u5206\u533a\u8868\u3002 \u6b64\u7ec4\u4ef6\u53ef\u7528\u4e8e\u4ec5\u68c0\u7d22\u81ea\u4e0a\u6b21\u68c0\u7d22\u4ee5\u6765\u5df2\u6dfb\u52a0/\u66f4\u65b0\u7684\u90a3\u4e9b\u884c\u3002 \u8bf7\u6ce8\u610f\uff0c\u67d0\u4e9bJDBC\u7c7b\u578b\uff08\u5982bit / boolean\uff09\u4e0d\u5229\u4e8e\u7ef4\u62a4\u6700\u5927\u503c\uff0c\u56e0\u6b64\u4e0d\u5e94\u5728\u6b64\u5c5e\u6027\u4e2d\u5217\u51fa\u8fd9\u4e9b\u7c7b\u578b\u7684\u5217\uff0c\u5e76\u4e14\u5728\u5904\u7406\u671f\u95f4\u5c06\u5bfc\u81f4\u9519\u8bef\u3002 \u5982\u679c\u672a\u63d0\u4f9b\u5217\uff0c\u5219\u5c06\u8003\u8651\u8868\u4e2d\u7684\u6240\u6709\u884c\uff0c\u8fd9\u53ef\u80fd\u4f1a\u5bf9\u6027\u80fd\u4ea7\u751f\u5f71\u54cd\u3002 \u6ce8\u610f\uff1a\u4e3a\u7ed9\u5b9a\u8868\u4f7f\u7528\u4e00\u81f4\u7684\u6700\u5927\u503c\u5217\u540d\u79f0\u4ee5\u4f7f\u589e\u91cf\u63d0\u53d6\u6b63\u5e38\u5de5\u4f5c\u3002
Max_Wait_Time.displayName=\u7b49\u5f85\u65f6\u957f
Max_Wait_Time.description=\u8fd0\u884cSQL SELECT\u67e5\u8be2\u5141\u8bb8\u7684\u6700\u957f\u65f6\u95f4\uff0c\u96f6\u8868\u793a\u6ca1\u6709\u9650\u5236\u3002 \u5c0f\u4e8e1\u79d2\u7684\u6700\u5927\u65f6\u95f4\u5c06\u7b49\u4e8e\u96f6\u3002
gen-table-fetch-partition-size.displayName=\u5206\u533a\u5927\u5c0f
gen-table-fetch-partition-size.description=\u6bcf\u4e2aSQL\u8bed\u53e5\u7ed3\u679c\u4e2d\u8981\u63d0\u53d6\u7684\u884c\u6570\u3002 \u8868\u4e2d\u7684\u603b\u884c\u6570\u9664\u4ee5\u5206\u533a\u5927\u5c0f\uff0c\u5f97\u51fa\u751f\u6210\u7684SQL\u8bed\u53e5\uff08\u5373\u6570\u636e\u6d41\uff09\u7684\u6570\u91cf\u3002 \u503c\u4e3a\u96f6\u8868\u793a\u5c06\u751f\u6210\u5355\u4e2a\u6570\u636e\u6d41\uff0c\u5176SQL\u8bed\u53e5\u5c06\u83b7\u53d6\u8868\u4e2d\u7684\u6240\u6709\u884c\u3002
gen-table-column-for-val-partitioning.displayName=Column for Value Partitioning
gen-table-column-for-val-partitioning.description=The name of a column whose values will be used for partitioning. The default behavior is to use row numbers on the result set for partitioning into 'pages' to be fetched from the database, using an offset/limit strategy. However for certain databases, it can be more efficient under the right circumstances to use the column values themselves to define the 'pages'. This property should only be used when the default queries are not performing well, when there is no maximum-value column or a single maximum-value column whose type can be coerced to a long integer (i.e. not date or timestamp), and the column values are evenly distributed and not sparse, for best performance.
db-fetch-where-clause.displayName=\u989d\u5916WHERE\u6761\u4ef6
db-fetch-where-clause.description=\u6dfb\u52a0\u989d\u5916\u7684where\u67e5\u8be2\u6761\u4ef6
initial.maxvalue.max_value_column.description=Specifies an initial max value for max value columns. Properties should be added in the format `initial.maxvalue.<max_value_column>`. This value is only used the first time the table is accessed (when a Maximum Value Column is specified). In the case of incoming connections, the value is only used the first time for each table specified in the flow files.
__Relationship.success.description=\u4eceSQL\u67e5\u8be2\u7ed3\u679c\u96c6\u6210\u529f\u521b\u5efa\u6570\u636e\u6d41\u540e\uff0c\u8f93\u51fa\u5230\u6b64\u8fde\u7ebf\u3002
__Relationship.failure.description=\u4ec5\u5f53SQL\u67e5\u8be2\u6267\u884c\uff08\u4f7f\u7528\u4f20\u5165\u7684\u6570\u636e\u6d41\uff09\u5931\u8d25\u65f6\u4f7f\u7528\u6b64\u8fde\u7ebf\u3002 \u4f20\u5165\u7684\u6570\u636e\u6d41\u5c06\u53d7\u5230\u5904\u7f5a\u5e76\u88ab\u8def\u7531\u5230\u6b64\u8fde\u7ebf\u3002 \u5982\u679c\u672a\u6307\u5b9a\u4f20\u5165\u8fde\u63a5\uff0c\u5219\u4e0d\u4f7f\u7528\u6b64\u8fde\u7ebf\u3002
__WritesAttribute.generatetablefetch.sql.error.description=\u5982\u679c\u7ec4\u4ef6\u5177\u6709\u4f20\u5165\u8fde\u63a5\uff0c\u5e76\u4e14\u5904\u7406\u4f20\u5165\u6d41\u6587\u4ef6\u5bfc\u81f4SQL\u5f02\u5e38\uff0c\u5219\u6d41\u6587\u4ef6\u5c06\u8def\u7531\u5230\u5931\u8d25\uff0c\u5e76\u4e14\u6b64\u5c5e\u6027\u5c06\u8bbe\u7f6e\u4e3a\u5f02\u5e38\u6d88\u606f\u3002
__WritesAttribute.generatetablefetch.tableName.description=\u8981\u67e5\u8be2\u7684\u6570\u636e\u5e93\u8868\u7684\u540d\u79f0\u3002
__WritesAttribute.generatetablefetch.columnNames.description=\u67e5\u8be2\u4e2d\u4f7f\u7528\u7684\u4ee5\u9017\u53f7\u5206\u9694\u7684\u5217\u540d\u5217\u8868\u3002
__WritesAttribute.generatetablefetch.whereClause.description=\u5728\u67e5\u8be2\u4e2d\u4f7f\u7528Where\u5b50\u53e5\u6765\u83b7\u53d6\u9884\u671f\u7ed3\u679c\u3002
__WritesAttribute.generatetablefetch.maxColumnNames.description=\u9017\u53f7\u5206\u9694\u7684\u5217\u540d\u5217\u8868\uff0c\u7528\u4e8e\u8ddf\u8e2a\u81ea\u7ec4\u4ef6\u5f00\u59cb\u8fd0\u884c\u4ee5\u6765\u5df2\u8fd4\u56de\u7684\u6570\u636e\u3002
__WritesAttribute.generatetablefetch.limit.description=SQL\u8bed\u53e5\u8981\u63d0\u53d6\u7684\u7ed3\u679c\u884c\u6570\u3002
__WritesAttribute.generatetablefetch.offset.description=\u7528\u4e8e\u68c0\u7d22\u76f8\u5e94\u5206\u533a\u7684\u504f\u79fb\u91cf
__Stateful.description=\u5728\u5bf9\u6307\u5b9a\u7684\u8868\u6267\u884c\u67e5\u8be2\u540e\uff0c\u5c06\u4fdd\u7559\u6307\u5b9a\u5217\u7684\u6700\u5927\u503c\uff0c\u4ee5\u4fbf\u5728\u5c06\u6765\u6267\u884c\u67e5\u8be2\u65f6\u4f7f\u7528\u3002 \u8fd9\u5141\u8bb8\u7ec4\u4ef6\u4ec5\u83b7\u53d6\u6700\u5927\u503c\u5927\u4e8e\u4fdd\u7559\u503c\u7684\u8bb0\u5f55\u3002 \u8fd9\u53ef\u4ee5\u7528\u4e8e\u589e\u91cf\u63d0\u53d6\uff0c\u63d0\u53d6\u65b0\u6dfb\u52a0\u7684\u884c\u7b49\u3002\u8981\u6e05\u9664\u6700\u5927\u503c\uff0c\u8bf7\u6839\u636e\u72b6\u6001\u7ba1\u7406\u6587\u6863\u6e05\u9664\u5904\u7406\u5668\u7684\u72b6\u6001
