__CapabilityDescription=\u4ece\u78c1\u76d8\u8bfb\u53d6\u6587\u4ef6\u5185\u5bb9\uff0c\u5e76\u5c06\u6587\u4ef6\u5185\u5bb9\u4f5c\u4e3a\u6570\u636e\u6d41\u8f93\u51fa\u3002\u5b8c\u6210\u6b64\u64cd\u4f5c\u540e\uff0c\u53ef\u4ee5\u9009\u62e9\u5c06\u6587\u4ef6\u79fb\u52a8\u5230\u5176\u4ed6\u4f4d\u7f6e\u6216\u5220\u9664\u8be5\u6587\u4ef6\u4ee5\u5e2e\u52a9\u4fdd\u6301\u6587\u4ef6\u7cfb\u7edf\u7684\u6709\u5e8f\u6027\u3002
__Tags=local, files, filesystem, ingest, ingress, get, source, input, fetch, \u6587\u4ef6, \u8bfb\u53d6
File_to_Fetch.displayName=\u8bfb\u53d6\u7684\u6587\u4ef6
File_to_Fetch.description=\u6307\u5b9a\u5c06\u6587\u4ef6\u7cfb\u7edf\u8bfb\u53d6\u6587\u4ef6\u5185\u5bb9\u7684\u6587\u4ef6\u8def\u5f84
Completion_Strategy.displayName=\u64cd\u4f5c\u7b56\u7565
Completion_Strategy.description=\u5f53\u539f\u59cb\u6587\u4ef6\u8bfb\u53d6\u5b8c\u6210\u4e4b\u540e\uff0c\u6307\u5b9a\u540e\u7eed\u76f8\u5173\u64cd\u4f5c\u7b56\u7565
__AllowableValue.Completion_Strategy.Delete_File.displayName=\u5220\u9664\u6587\u4ef6
__AllowableValue.Completion_Strategy.Delete_File.description=\u4ece\u6587\u4ef6\u7cfb\u7edf\u4e2d\u5220\u9664\u539f\u59cb\u6587\u4ef6
__AllowableValue.Completion_Strategy.Move_File.displayName=\u79fb\u52a8\u6587\u4ef6
__AllowableValue.Completion_Strategy.Move_File.description=\u5c06\u6587\u4ef6\u79fb\u52a8\u5230<\u79fb\u52a8\u76ee\u6807\u76ee\u5f55>\u5c5e\u6027\u6307\u5b9a\u7684\u76ee\u5f55
__AllowableValue.Completion_Strategy.None.displayName=\u65e0
__AllowableValue.Completion_Strategy.None.description=\u4fdd\u6301\u6587\u4ef6\u539f\u6837
Move_Destination_Directory.displayName=\u79fb\u52a8\u76ee\u6807\u76ee\u5f55
Move_Destination_Directory.description=\u4ece\u6587\u4ef6\u7cfb\u7edf\u83b7\u53d6\u539f\u59cb\u6587\u4ef6\u540e\u5c06\u76ee\u6807\u79fb\u52a8\u5230\u7684\u76ee\u5f55\u3002\u9664\u975e\u201c\u64cd\u4f5c\u7b56\u7565\u201d\u8bbe\u7f6e\u4e3a\u201c\u79fb\u52a8\u6587\u4ef6\u201d\uff0c\u5426\u5219\u5c06\u5ffd\u7565\u6b64\u5c5e\u6027\u3002\u5982\u679c\u8be5\u76ee\u5f55\u4e0d\u5b58\u5728\uff0c\u5219\u5c06\u521b\u5efa\u8be5\u76ee\u5f55\u3002
Move_Conflict_Strategy.displayName=\u79fb\u52a8\u51b2\u7a81\u7b56\u7565
Move_Conflict_Strategy.description=\u5982\u679c\u201c\u64cd\u4f5c\u7b56\u7565\u201d\u8bbe\u7f6e\u4e3a\u201c\u79fb\u52a8\u6587\u4ef6\u201d\u5e76\u4e14\u76ee\u6807\u76ee\u5f55\u4e2d\u5df2\u5b58\u5728\u540c\u540d\u6587\u4ef6\uff0c\u5219\u6b64\u5c5e\u6027\u6307\u5b9a\u5e94\u5982\u4f55\u5904\u7406\u547d\u540d\u51b2\u7a81
__AllowableValue.Move_Conflict_Strategy.Fail.displayName=\u5931\u8d25
__AllowableValue.Move_Conflict_Strategy.Fail.description=\u76ee\u6807\u76ee\u5f55\u4e2d\u7684\u73b0\u6709\u6587\u4ef6\u4fdd\u6301\u4e0d\u53d8\uff0c\u4f46\u662f\u76f4\u63a5\u5c06\u8f93\u5165\u6d41\u4f5c\u4e3a\u5931\u8d25\u6570\u636e\u6d41\u8f93\u51fa
__AllowableValue.Move_Conflict_Strategy.Keep_Existing.displayName=\u4fdd\u6301\u73b0\u6709
__AllowableValue.Move_Conflict_Strategy.Keep_Existing.description=\u76ee\u6807\u76ee\u5f55\u4e2d\u7684\u73b0\u6709\u6587\u4ef6\u4fdd\u6301\u4e0d\u53d8\uff0c\u4f46\u4f1a\u5220\u9664\u5f53\u524d\u6587\u4ef6
__AllowableValue.Move_Conflict_Strategy.Rename.displayName=\u91cd\u547d\u540d
__AllowableValue.Move_Conflict_Strategy.Rename.description=\u73b0\u6709\u5f53\u524d\u6587\u4ef6\u540d\u5b57\u4fdd\u6301\u4e0d\u53d8\uff0c\u4f46\u5c06\u51b2\u7a81\u6587\u4ef6\u91cd\u547d\u540d\u4e3a\u968f\u673a\u6587\u4ef6\u540d
__AllowableValue.Move_Conflict_Strategy.Replace_File.displayName=\u66ff\u6362\u6587\u4ef6
__AllowableValue.Move_Conflict_Strategy.Replace_File.description=\u5f53\u524d\u6587\u4ef6\u5c06\u66ff\u6362\u76ee\u6807\u76ee\u5f55\u4e2d\u7684\u73b0\u6709\u6587\u4ef6
Log_level_when_file_not_found.displayName=\u6587\u4ef6\u4e0d\u5b58\u5728\u65f6\u7684\u65e5\u5fd7\u7ea7\u522b
Log_level_when_file_not_found.description=\u6267\u884c\u8be5\u7ec4\u4ef6\u65f6\u6587\u4ef6\u4e0d\u5b58\u5728\u6240\u4f7f\u7528\u7684\u65e5\u5fd7\u7ea7\u522b
__AllowableValue.Log_level_when_file_not_found.DEBUG.displayName=\u8c03\u8bd5
__AllowableValue.Log_level_when_file_not_found.ERROR.displayName=\u9519\u8bef
__AllowableValue.Log_level_when_file_not_found.FATAL.displayName=\u5931\u8d25
__AllowableValue.Log_level_when_file_not_found.INFO.displayName=\u4fe1\u606f
__AllowableValue.Log_level_when_file_not_found.NONE.displayName=\u65e0
__AllowableValue.Log_level_when_file_not_found.TRACE.displayName=\u8ddf\u8e2a
__AllowableValue.Log_level_when_file_not_found.WARN.displayName=\u8b66\u544a
Log_level_when_permission_denied.displayName=\u6743\u9650\u53d7\u9650\u65f6\u7684\u65e5\u5fd7\u7ea7\u522b
Log_level_when_permission_denied.description=\u5f53\u524d\u5e73\u53f0\u7684\u542f\u52a8\u7528\u6237\u6ca1\u6709\u8db3\u591f\u6743\u9650\u8bfb\u53d6\u6587\u4ef6\u65f6\u4f7f\u7528\u7684\u65e5\u5fd7\u7ea7\u522b
__AllowableValue.Log_level_when_permission_denied.DEBUG.displayName=\u8c03\u8bd5
__AllowableValue.Log_level_when_permission_denied.ERROR.displayName=\u9519\u8bef
__AllowableValue.Log_level_when_permission_denied.FATAL.displayName=\u5931\u8d25
__AllowableValue.Log_level_when_permission_denied.INFO.displayName=\u4fe1\u606f
__AllowableValue.Log_level_when_permission_denied.NONE.displayName=\u65e0
__AllowableValue.Log_level_when_permission_denied.TRACE.displayName=\u8ddf\u8e2a
__AllowableValue.Log_level_when_permission_denied.WARN.displayName=\u8b66\u544a
__Relationship.success.description=\u6210\u529f\u8bfb\u53d6\u6587\u4ef6\u5185\u5bb9\u540e\uff0c\u5c06\u901a\u8fc7\u8be5\u6570\u636e\u6d41\u8f93\u51fa\u3002
__Relationship.not.found.description=\u7531\u4e8e\u627e\u4e0d\u5230\u6587\u4ef6\u800c\u65e0\u6cd5\u4ece\u6587\u4ef6\u7cfb\u7edf\u8bfb\u53d6\u6587\u4ef6\u5185\u5bb9\uff0c\u5219\u76f4\u63a5\u5c06\u8f93\u5165\u6d41\u901a\u8fc7\u8be5\u6570\u636e\u6d41\u8f93\u51fa\u3002
__Relationship.permission.denied.description=\u7531\u4e8e\u7528\u6237\u8fd0\u884c\u7684\u8be5\u5e73\u53f0\u6ca1\u6709\u8db3\u591f\u7684\u6743\u9650\u800c\u65e0\u6cd5\u4ece\u6587\u4ef6\u7cfb\u7edf\u8bfb\u53d6\u6587\u4ef6\u5185\u5bb9\uff0c\u5219\u76f4\u63a5\u5c06\u8f93\u5165\u6d41\u901a\u8fc7\u8be5\u6570\u636e\u6d41\u8f93\u51fa\u3002
__Relationship.failure.description=\u7531\u4e8e\u6743\u9650\u4e0d\u8db3\u6216\u6587\u4ef6\u4e0d\u5b58\u5728\u800c\u65e0\u6cd5\u4ece\u6587\u4ef6\u7cfb\u7edf\u8bfb\u53d6\u6587\u4ef6\u5185\u5bb9\uff0c\u5219\u76f4\u63a5\u5c06\u8f93\u5165\u6d41\u901a\u8fc7\u8be5\u6570\u636e\u6d41\u8f93\u51fa\u3002
__Restriction.read-filesystem.label=\u8bfb\u6587\u4ef6\u7cfb\u7edf
__Restriction.read-filesystem.explanation=\u57fa\u4e8e\u5f53\u524d\u5e73\u53f0\u53ef\u8bbf\u95ee\u7684\u6743\u9650\uff0c\u63d0\u4f9b\u76f8\u5e94\u7684\u8bfb\u53d6\u6587\u4ef6\u64cd\u4f5c\u6743\u9650\u3002
__Restriction.write-filesystem.label=\u5199\u6587\u4ef6\u7cfb\u7edf
__Restriction.write-filesystem.explanation=\u57fa\u4e8e\u5f53\u524d\u5e73\u53f0\u53ef\u8bbf\u95ee\u7684\u6743\u9650\uff0c\u63d0\u4f9b\u76f8\u5e94\u7684\u5199\u5165\u6587\u4ef6\u64cd\u4f5c\u6743\u9650\u3002
