__CapabilityDescription=\u63a5\u6536\u9762\u5411\u8bb0\u5f55\u7684\u6570\u636e(\u5373\u53ef\u7531\u914d\u7f6e\u7684\u8bb0\u5f55\u8bfb\u53d6\u5668\u8bfb\u53d6\u7684\u6570\u636e)\uff0c\u5e76\u6839\u636e\u4f20\u5165\u6570\u636e\u6d41\u4e2d\u7684\u6bcf\u4e2a\u8bb0\u5f55\u8bc4\u4f30\u4e00\u4e2a\u6216\u591a\u4e2a\u8bb0\u5f55\u8def\u5f84\u3002\u7136\u540e\uff0c\u5c06\u6bcf\u4e2a\u8bb0\u5f55\u4e0e\u5176\u4ed6\u201cLIKE\u8bb0\u5f55\u201d\u7ec4\u5408\u5728\u4e00\u8d77\uff0c\u5e76\u4e3a\u6bcf\u7ec4\u201cLIKE\u8bb0\u5f55\u201d\u521b\u5efa\u4e00\u4e2a\u6570\u636e\u6d41\u3002\u4e24\u6761\u8bb0\u5f55\u201c\u7c7b\u4f3c\u8bb0\u5f55\u201d\u7684\u542b\u4e49\u7531\u7528\u6237\u5b9a\u4e49\u7684\u5c5e\u6027\u51b3\u5b9a\u3002\u7528\u6237\u5fc5\u987b\u8f93\u5165\u81f3\u5c11\u4e00\u4e2a\u7528\u6237\u5b9a\u4e49\u7684\u5c5e\u6027\uff0c\u8be5\u5c5e\u6027\u7684\u503c\u4e3aRecordPath\u3002\u5982\u679c\u4e24\u4e2a\u8bb0\u5f55\u5bf9\u6240\u6709\u5df2\u914d\u7f6e\u7684RecordPath\u5177\u6709\u76f8\u540c\u7684\u503c\uff0c\u5219\u8fd9\u4e24\u4e2a\u8bb0\u5f55\u88ab\u89c6\u4e3a\u76f8\u540c\u3002\u56e0\u4e3a\u6211\u4eec\u77e5\u9053\u7ed9\u5b9aOutput \u6570\u636e\u6d41\u4e2d\u7684\u6240\u6709\u8bb0\u5f55\u5bf9\u4e8eRecordPath\u6307\u5b9a\u7684\u5b57\u6bb5\u90fd\u5177\u6709\u76f8\u540c\u7684\u503c\uff0c\u56e0\u6b64\u5c06\u4e3a\u6bcf\u4e2a\u5b57\u6bb5\u6dfb\u52a0\u4e00\u4e2a\u5c5e\u6027\u3002\u6709\u5173\u8be6\u7ec6\u4fe1\u606f\u548c\u793a\u4f8b\uff0c\u8bf7\u53c2\u9605\u201c\u4f7f\u7528\u201d\u9875\u4e0a\u7684\u5176\u4ed6\u8be6\u7ec6\u4fe1\u606f\u3002
__Tags=record, partition, recordpath, rpath, segment, split, group, bin, organize, \u8bb0\u5f55, \u9694\u79bb, \u8bb0\u5f55\u8def\u5f84, \u8def\u5f84, \u5212\u5206, \u5206\u79bb, \u5bb9\u5668, \u7ec4\u7ec7
record-reader.displayName=\u8bb0\u5f55\u8bfb\u53d6\u670d\u52a1
record-reader.description=\u6307\u5b9a\u7528\u4e8e\u8bfb\u53d6\u4f20\u5165\u6570\u636e\u7684\u63a7\u5236\u5668\u670d\u52a1\u3002
record-writer.displayName=\u8bb0\u5f55\u8f93\u51fa\u670d\u52a1
record-writer.description=\u6307\u5b9a\u7528\u4e8e\u5199\u51fa\u8bb0\u5f55\u7684\u63a7\u5236\u5668\u670d\u52a1\u3002
The_name_given_to_the_dynamic_property_is_the_name_of_the_attribute_that_will_be_used_to_denote_the_value_of_the_associted_RecordPath..description=\u6bcf\u4e2a\u52a8\u6001\u5c5e\u6027\u8868\u793a\u4e00\u4e2aRecordPath\uff0c\u8be5\u8def\u5f84\u5c06\u6839\u636e\u4f20\u5165\u6570\u636e\u6d41\u4e2d\u7684\u6bcf\u6761\u8bb0\u5f55\u8fdb\u884c\u8ba1\u7b97\u3002\u4e3a\u8bb0\u5f55\u786e\u5b9aRecordPath\u7684\u503c\u65f6\uff0c\u5c06\u5411\u4f20\u51fa\u6570\u636e\u6d41\u6dfb\u52a0\u4e00\u4e2a\u5c5e\u6027\u3002\u5c5e\u6027\u7684\u540d\u79f0\u4e0e\u6b64\u5c5e\u6027\u7684\u540d\u79f0\u76f8\u540c\u3002\u5c5e\u6027\u7684\u503c\u4e0eRecordPath\u6307\u5411\u7684\u8bb0\u5f55\u4e2d\u5b57\u6bb5\u7684\u503c\u76f8\u540c\u3002\u8bf7\u6ce8\u610f\uff0c\u5982\u679c\u4e3aRecordPath\u8fd4\u56de\u7684\u503c\u4e3aNULL\u6216\u4e0d\u662f\u6807\u91cf\u503c(\u5373\uff0c\u8be5\u503c\u662fArray\u3001Map\u6216Record)\uff0c\u5219\u4e0d\u4f1a\u6dfb\u52a0\u4efb\u4f55\u5c5e\u6027\u3002
__Relationship.success.description=\u5df2\u6210\u529f\u5206\u533a\u7684\u6570\u636e\u6d41\u5c06\u8def\u7531\u5230\u6b64\u8fde\u7ebf
__Relationship.failure.description=\u5982\u679c\u6570\u636e\u6d41\u65e0\u6cd5\u4ece\u914d\u7f6e\u7684\u8f93\u5165\u683c\u5f0f\u5206\u533a\u4e3a\u914d\u7f6e\u7684\u8f93\u51fa\u683c\u5f0f\uff0c\u5219\u672a\u66f4\u6539\u7684FlowFile\u5c06\u88ab\u8def\u7531\u5230\u6b64\u8fde\u7ebf
__Relationship.original.description=\u4e00\u65e6\u4f20\u5165\u6570\u636e\u6d41\u4e2d\u7684\u6240\u6709\u8bb0\u5f55\u90fd\u5df2\u5206\u533a\uff0c\u539f\u59cb\u6570\u636e\u6d41\u5c06\u8def\u7531\u5230\u6b64\u8fde\u7ebf\u3002
__WritesAttribute.record.count.description=\u4f20\u51fa\u6570\u636e\u6d41\u4e2d\u7684\u8bb0\u5f55\u6570
__WritesAttribute.mime.type.description=\u914d\u7f6e\u7684\u8bb0\u5f55\u7f16\u5199\u5668\u6307\u793a\u7684MIME\u7c7b\u578b\u662f\u7279\u6b8a\u7684
__WritesAttribute.dynamic_property_name.description=\u5bf9\u4e8e\u6dfb\u52a0\u7684\u6bcf\u4e2a\u52a8\u6001\u5c5e\u6027\uff0c\u53ef\u4ee5\u5c06\u4e00\u4e2a\u5c5e\u6027\u6dfb\u52a0\u5230\u6570\u636e\u6d41\u4e2d\u3002\u6709\u5173\u8be6\u7ec6\u4fe1\u606f\uff0c\u8bf7\u53c2\u89c1\u201c\u52a8\u6001\u5c5e\u6027\u201d\u7684\u8bf4\u660e\u3002
