__CapabilityDescription=\u6b64\u7ec4\u4ef6\u5141\u8bb8\u7528\u6237\u5c06\u4e00\u6761\u8bb0\u5f55\u5206\u53c9\u4e3a\u591a\u6761\u8bb0\u5f55\u3002\u7528\u6237\u5fc5\u987b\u6307\u5b9a\u81f3\u5c11\u4e00\u4e2a\u8bb0\u5f55\u8def\u5f84\u4f5c\u4e3a\u52a8\u6001\u5c5e\u6027\uff0c\u6307\u5411\u5305\u542b\u8bb0\u5f55\u5bf9\u8c61\u7684\u6570\u7ec4\u7c7b\u578b\u7684\u5b57\u6bb5\u3002\u7ec4\u4ef6\u63a5\u53d7\u4e24\u79cd\u6a21\u5f0f\\uff1a\u201c\u62c6\u5206\u201d\u548c\u201c\u63d0\u53d6\u201d\u3002\u5728\u8fd9\u4e24\u79cd\u6a21\u5f0f\u4e2d\uff0c\u6307\u5b9a\u6570\u7ec4\u4e2d\u5305\u542b\u7684\u6bcf\u4e2a\u5143\u7d20\u90fd\u751f\u6210\u4e00\u6761\u8bb0\u5f55\u3002\u5728\u201c\u62c6\u5206\u201d\u6a21\u5f0f\u4e0b\uff0c\u6bcf\u4e2a\u751f\u6210\u7684\u8bb0\u5f55\u5c06\u4fdd\u7559\u4e0e\u8f93\u5165\u4e2d\u7ed9\u5b9a\u7684\u76f8\u540c\u7684\u6a21\u677f\uff0c\u4f46\u6570\u7ec4\u5c06\u53ea\u5305\u542b\u4e00\u4e2a\u5143\u7d20\u3002\u5728\u201c\u63d0\u53d6\u201d\u6a21\u5f0f\u4e0b\uff0c\u6570\u7ec4\u7684\u5143\u7d20\u5fc5\u987b\u662f\u8bb0\u5f55\u7c7b\u578b\uff0c\u5e76\u4e14\u5c06\u662f\u751f\u6210\u7684\u8bb0\u5f55\u3002\u6b64\u5916\uff0c\u5728\u201c\u63d0\u53d6\u201d\u6a21\u5f0f\u4e0b\uff0c\u53ef\u4ee5\u6307\u5b9a\u6bcf\u4e2a\u751f\u6210\u7684\u8bb0\u5f55\u662f\u5426\u5e94\u8be5\u5305\u542b\u4ece\u6839\u7ea7\u522b\u5230\u63d0\u53d6\u8bb0\u5f55\u7684\u7236\u8bb0\u5f55\u7684\u6240\u6709\u5b57\u6bb5\u3002\u8fd9\u5047\u5b9a\u8981\u6dfb\u52a0\u5230\u8bb0\u5f55\u4e2d\u7684\u5b57\u6bb5\u662f\u5728\u8bb0\u5f55\u8bfb\u53d6\u5668\u63a7\u5236\u5668\u670d\u52a1\u7684\u6a21\u677f\u4e2d\u5b9a\u4e49\u7684\u3002\u8bf7\u53c2\u9605\u6b64\u7ec4\u4ef6\u7684\u5176\u4ed6\u8be6\u7ec6\u4fe1\u606f\u6587\u6863\u4e2d\u7684\u793a\u4f8b
__Tags=fork, record, content, array, stream, event, \u5206\u53c9, \u8bb0\u5f55, \u5185\u5bb9, \u6570\u7ec4, \u6d41, \u4e8b\u4ef6
record-reader.displayName=\u8bb0\u5f55\u8bfb\u53d6\u670d\u52a1
record-reader.description=\u6307\u5b9a\u7528\u4e8e\u8bfb\u53d6\u4f20\u5165\u6570\u636e\u7684\u63a7\u5236\u5668\u670d\u52a1\u3002
record-writer.displayName=\u8bb0\u5f55\u8f93\u51fa\u670d\u52a1
record-writer.description=\u6307\u5b9a\u7528\u4e8e\u5199\u51fa\u8bb0\u5f55\u7684\u63a7\u5236\u5668\u670d\u52a1\u3002
fork-mode.displayName=\u6a21\u5f0f
fork-mode.description=\u6307\u5b9a\u5904\u7406\u5668\u7684\u5206\u53c9\u6a21\u5f0f\u3002
__AllowableValue.fork-mode.extract.displayName=\u63d0\u53d6
__AllowableValue.fork-mode.extract.description=\u751f\u6210\u7684\u8bb0\u5f55\u5c06\u662f\u6570\u7ec4\u7684\u5143\u7d20\u3002
__AllowableValue.fork-mode.split.displayName=\u62c6\u5206
__AllowableValue.fork-mode.split.description=\u751f\u6210\u7684\u8bb0\u5f55\u5c06\u4fdd\u7559\u8f93\u5165\u6a21\u677f\u5e76\u5305\u542b\u4e00\u4e2a\u5355\u5143\u7d20\u6570\u7ec4\u3002
include-parent-fields.displayName=\u5305\u62ec\u7236\u5b57\u6bb5
include-parent-fields.description=\u6b64\u53c2\u6570\u4ec5\u5bf9\u201c\u63d0\u53d6\u201d\u6a21\u5f0f\u6709\u6548\u3002\u5982\u679c\u8bbe\u7f6e\u4e3atrue\uff0c\u5219\u4ece\u6839\u7ea7\u522b\u5230\u7ed9\u5b9a\u6570\u7ec4\u7684\u6240\u6709\u5b57\u6bb5\u90fd\u5c06\u6dfb\u52a0\u5230\u8981\u5206\u53c9\u7684\u6570\u7ec4\u7684\u6bcf\u4e2a\u5143\u7d20\u7684\u5b57\u6bb5
__AllowableValue.include-parent-fields.false.displayName=\u5173\u95ed\u4f7f\u7528\u7236\u7c7b\u578b\u5b57\u6bb5
__AllowableValue.include-parent-fields.true.displayName=\u5f00\u542f\u4f7f\u7528\u7236\u7c7b\u578b\u5b57\u6bb5
__Relationship.failure.description=\u5982\u679c\u6570\u636e\u6d41\u5728\u5206\u652f\u64cd\u4f5c\u671f\u95f4\u751f\u6210\u9519\u8bef\uff0c\u5b83\u5c06\u88ab\u8def\u7531\u5230\u6b64\u8fde\u7ebf
__Relationship.original.description=\u539f\u59cb\u6570\u636e\u6d41\u5c06\u8def\u7531\u5230\u6b64\u8fde\u7ebf
__Relationship.fork.description=\u5305\u542b\u5206\u53c9\u8bb0\u5f55\u7684\u6570\u636e\u6d41\u5c06\u88ab\u8def\u7531\u5230\u6b64\u8fde\u7ebf
__WritesAttribute.record.count.description=\u751f\u6210\u7684\u6570\u636e\u6d41\u5c06\u5177\u6709\u4e00\u4e2a\u201cdocum.count\u201d\u5c5e\u6027\uff0c\u8be5\u5c5e\u6027\u6307\u793a\u5199\u5165\u6570\u636e\u6d41\u7684\u8bb0\u5f55\u6570\u3002
__WritesAttribute.mime.type.description=\u8bb0\u5f55\u8f93\u51fa\u76f8\u5e94\u7684MIME\u7c7b\u578b
__WritesAttribute.Attributes_from_Record_Writer.description=\u914d\u7f6e\u7684\u8bb0\u5f55\u7f16\u5199\u5668\u8fd4\u56de\u7684\u4efb\u4f55\u5c5e\u6027\u90fd\u5c06\u6dfb\u52a0\u5230\u6570\u636e\u6d41\u4e2d\u3002
