__CapabilityDescription=\u6b64\u7ec4\u4ef6\u5c06\u591a\u4e2a\u9762\u5411\u8bb0\u5f55\u7684\u6570\u636e\u6d41\u5408\u5e76\u5230\u4e00\u4e2a\u6570\u636e\u6d41\u4e2d\uff0c\u8f93\u51fa\u6570\u636e\u6d41\u5c06\u5305\u542b\u6240\u6709\u8f93\u5165\u6570\u636e\u6d41\u7684\u6240\u6709\u8bb0\u5f55\u3002 \u6b64\u7ec4\u4ef6\u7684\u5de5\u4f5c\u539f\u7406\u662f\u521b\u5efa\u201cbins\u201d\uff0c\u7136\u540e\u5c06FlowFiles\u6dfb\u52a0\u5230\u8fd9\u4e9bbins\u4e2d\uff0c\u76f4\u5230\u5b83\u4eec\u6ee1\u4e86\u3002 \u4e00\u65e6bin\u5df2\u6ee1\uff0c\u6240\u6709\u6570\u636e\u6d41\u5c06\u5408\u5e76\u4e3a\u4e00\u4e2a\u6570\u636e\u6d41\u5e76\u8f93\u51fa\u5230'merged'\u8fde\u7ebf\u3002 bin\u5c06\u5305\u542b\u8bb8\u591a'like FlowFiles'\u3002 \u4e3a\u4e86\u4f7f\u4e24\u4e2aFlowFiles\u88ab\u89c6\u4e3a\u201clike FlowFiles\u201d\uff0c\u5b83\u4eec\u5fc5\u987b\u5177\u6709\u76f8\u540c\u7684Schema\uff08\u7531Record Reader\u6807\u8bc6\uff09\uff0c\u5982\u679c\u8bbe\u7f6e\u4e86<Correlation Attribute Name>\u5c5e\u6027\uff0c\u5219\u76f8\u540c\u503c\u89c6\u4e3a\u201clike FlowFiles\u201d\u3002 \u6709\u5173\u66f4\u591a\u4fe1\u606f\uff0c\u8bf7\u53c2\u9605\u7ec4\u4ef6\u4f7f\u7528
__Tags=merge, record, content, correlation, stream, event, \u5408\u5e76, \u8bb0\u5f55
record-reader.displayName=\u8bfb\u53d6\u670d\u52a1
record-reader.description=\u6307\u5b9a\u7528\u4e8e\u8bfb\u53d6\u4f20\u5165\u6570\u636e\u7684\u670d\u52a1
record-writer.displayName=\u5199\u5165\u670d\u52a1
record-writer.description=\u6307\u5b9a\u7528\u4e8e\u5199\u51fa\u8bb0\u5f55\u7684\u670d\u52a1
merge-strategy.displayName=\u5408\u5e76\u7b56\u7565
merge-strategy.description=\u6307\u5b9a\u7528\u4e8e\u5408\u5e76\u8bb0\u5f55\u7684\u7b97\u6cd5\u3002 \u201cDefragment\u201d\u7b97\u6cd5\u5c06\u5c5e\u6027\u5173\u8054\u7684\u7247\u6bb5\u7ec4\u5408\u56de\u4e00\u4e2a\u5185\u805a\u7684FlowFile\u3002 'Bin-Packing Algorithm'\u751f\u6210\u7531\u4efb\u610f\u9009\u62e9\u7684FlowFiles\u586b\u5145\u7684FlowFile
__AllowableValue.merge-strategy.Bin-Packing_Algorithm.displayName=Bin-Packing\u7b97\u6cd5
__AllowableValue.merge-strategy.Bin-Packing_Algorithm.description=\u5c3d\u53ef\u80fd\u7684\u5408\u5e76\u6bcf\u4e2a\u8f93\u5165\u6570\u636e\u6d41\u3002 \u6570\u636e\u6d41\u6839\u636e\u5176\u5927\u5c0f\u548c\u53ef\u9009\u7684\u5c5e\u6027\u6765\u5408\u5e76\uff08\u5982\u679c\u8bbe\u7f6e\u4e86<\u5173\u8054\u5c5e\u6027>\u5c5e\u6027\uff09
__AllowableValue.merge-strategy.Defragment.displayName=Defragment\u7b97\u6cd5
__AllowableValue.merge-strategy.Defragment.description=\u5c06\u5c5e\u6027\u5173\u8054\u7684\u7247\u6bb5\u5408\u5e76\u6210\u4e00\u4e2a\u6570\u636e\u6d41\u8f93\u51fa\u3002 \u5982\u679c\u4f7f\u7528\u6b64\u7b56\u7565\uff0c\u5219\u6240\u6709\u6570\u636e\u6d41\u5fc5\u987b\u5177\u6709<fragment.identifier>\u548c<fragment.count>\u5c5e\u6027\u3002 \u5177\u6709\u76f8\u540c<fragment.identifier>\u503c\u7684\u6240\u6709\u6570\u636e\u6d41\u5c06\u88ab\u7ec4\u5408\u5728\u4e00\u4e2a\u7ec4\u5185\u3002 \u5728\u7ec4\u5185\u7684\u6240\u6709\u6570\u636e\u6d41\u90fd\u5177\u6709\u76f8\u540c\u7684<fragment.count>\u5c5e\u6027\u503c\u3002 \u4f46\u65e0\u6cd5\u4fdd\u8bc1\u8f93\u51fa\u7684\u8bb0\u5f55\u987a\u5e8f\u3002
correlation-attribute-name.displayName=\u5173\u8054\u5c5e\u6027\u540d
correlation-attribute-name.description=\u5982\u679c\u6307\u5b9a\uff0c\u5219\u53ea\u6709\u4e24\u4e2a\u6570\u636e\u6d41\u5177\u6709\u5c5e\u6027\u76f8\u540c\u503c\u65f6\u624d\u4f1a\u5c06\u5b83\u4eec\u5408\u5e76\u5728\u4e00\u8d77\u3002 \u5982\u679c\u672a\u6307\u5b9a\uff0c\u6570\u636e\u6d41\u5c06\u6309\u4ece\u961f\u5217\u4e2d\u63d0\u53d6\u7684\u987a\u5e8f\u8fdb\u884c\u5408\u5e76\u3002
Attribute_Strategy.displayName=\u5c5e\u6027\u7b56\u7565
Attribute_Strategy.description=\u786e\u5b9a\u5e94\u5c06\u54ea\u4e9b\u6570\u636e\u6d41\u7684\u5c5e\u6027\u6dfb\u52a0\u5230\u6570\u636e\u6d41\u4e2d\u3002 \u5982\u679c\u9009\u62e9\u201c\u4fdd\u7559\u6240\u6709\u5c5e\u6027\u201d\uff0c\u5219\u5c06\u4fdd\u7559\u4efb\u4f55\u6570\u636e\u6d41\u4e0a\u7684\u4efb\u4f55\u5c5e\u6027\uff0c\u9664\u975e\u5176\u503c\u4e0e\u53e6\u4e00\u4e2a\u6570\u636e\u6d41\u7684\u503c\u51b2\u7a81\u3002 \u5982\u679c\u9009\u62e9\u201c\u4ec5\u4fdd\u7559\u901a\u7528\u5c5e\u6027\u201d\uff0c\u5219\u4ec5\u4fdd\u7559\u5305\u4e2d\u5177\u6709\u76f8\u540c\u503c\u7684\u6240\u6709\u6570\u636e\u6d41\u4e2d\u5b58\u5728\u7684\u5c5e\u6027\u3002
__AllowableValue.Attribute_Strategy.Keep_All_Unique_Attributes.displayName=\u4fdd\u7559\u6240\u6709\u5c5e\u6027
__AllowableValue.Attribute_Strategy.Keep_All_Unique_Attributes.description=\u5c06\u4fdd\u7559\u8bb0\u5f55\u4e2d\u7684\u6240\u6709\u6570\u636e\u6d41\u5177\u6709\u76f8\u540c\u503c\u6216\u8005\u6ca1\u6709\u503c\u7684\u4efb\u4f55\u5c5e\u6027\u3002 \u4f8b\u5982\uff0c\u5982\u679c\u5305\u542b3\u4e2a\u6570\u636e\u6d41\uff0c\u5176\u4e2d2\u4e2a\u4e3a'greeting'\u5c5e\u6027\u503c\u4e3a'hello'\uff0c\u800c\u7b2c3\u4e2a\u6570\u636e\u6d41\u6ca1\u6709'greeting'\u5c5e\u6027\uff0c\u5219\u8f93\u51fa\u7684\u6570\u636e\u5c06\u5177\u6709'greeting'\u5c5e\u6027\u4e14\u503c\u4e3a'hello'\u3002
__AllowableValue.Attribute_Strategy.Keep_Only_Common_Attributes.displayName=\u4ec5\u4fdd\u7559\u901a\u7528\u5c5e\u6027
__AllowableValue.Attribute_Strategy.Keep_Only_Common_Attributes.description=\u5c06\u5220\u9664\u8bb0\u5f55\u4e2d\u6240\u6709\u6570\u636e\u6d41\u4e0a\u4e0d\u540c\u7684\u4efb\u4f55\u5c5e\u6027\uff0c\u4f46\u4fdd\u7559\u6240\u6709\u76f8\u540c\u503c\u7684\u5c5e\u6027\u5728\u6570\u636e\u6d41\u4e0a\u3002
min-records.displayName=\u6700\u5c0f\u8bb0\u5f55\u6570
min-records.description=\u6700\u5c0f\u8bb0\u5f55\u6570
max-records.displayName=\u6700\u5927\u8bb0\u5f55\u6570
max-records.description=\u6700\u5927\u8bb0\u5f55\u6570\u3002 \u5982\u679c\u4e0d\u8bbe\u7f6e\uff0c\u5219\u6ca1\u6709\u9650\u5236\uff0c\u8fd9\u662f\u4e00\u4e2a\u201c\u8f6f\u9650\u5236\u201d\uff0c\u5982\u679c\u6570\u636e\u6d41\u88ab\u5408\u5e76\uff0c\u6570\u636e\u6d41\u4e2d\u7684\u8bb0\u5f55\u5c06\u5168\u90e8\u5408\u5e76\uff0c\u8fd9\u4e2a\u9650\u5236\u53ef\u80fd\u4f1a\u8d85\u8fc7\u6700\u540e\u4e00\u4e2a\u8f93\u5165\u6570\u636e\u6d41\u7684\u8bb0\u5f55\u6570\u3002
min-bin-size.displayName=\u6700\u5c0f\u7684\u8bb0\u5f55\u5927\u5c0f
min-bin-size.description=\u8bb0\u5f55\u7684\u6700\u5c0f\u503c
max-bin-size.displayName=\u6700\u5927\u7684\u8bb0\u5f55\u5927\u5c0f
max-bin-size.description=\u8bb0\u5f55\u7684\u6700\u5927\u503c\u3002 \u5982\u679c\u672a\u6307\u5b9a\uff0c\u5219\u6ca1\u6709\u6700\u5927\u503c\u3002 \u8fd9\u662f\u4e00\u4e2a\u201c\u8f6f\u9650\u5236\u201d\uff0c\u5982\u679c\u6570\u636e\u6d41\u88ab\u5408\u5e76\uff0c\u6570\u636e\u6d41\u4e2d\u7684\u8bb0\u5f55\u5c06\u5168\u90e8\u5408\u5e76\uff0c\u8fd9\u4e2a\u9650\u5236\u53ef\u80fd\u4f1a\u8d85\u8fc7\u6700\u540e\u4e00\u4e2a\u8f93\u5165\u6570\u636e\u6d41\u7684\u5b57\u8282\u6570\u3002
max-bin-age.displayName=\u8bb0\u5f55\u6700\u5927\u751f\u547d\u5468\u671f
max-bin-age.description=\u8bb0\u5f55\u6700\u5927\u751f\u547d\u5468\u671f\u3002 \u9884\u671f\u683c\u5f0f\u4e3a<\u65f6\u95f4\u6570> <\u65f6\u95f4\u5355\u4f4d>\uff0c\u5176\u4e2d<\u65f6\u95f4\u6570>\u4e3a\u6b63\u6574\u6570\uff0c\u65f6\u95f4\u5355\u4f4d\u4e3a\u79d2(s)\uff0c\u5206(m)\uff0c\u5c0f\u65f6(h)\u4e4b\u4e00
max.bin.count.displayName=\u8bb0\u5f55\u7684\u6700\u5927\u6570\u91cf
max.bin.count.description=\u6307\u5b9a\u4efb\u4f55\u65f6\u5019\u53ef\u4ee5\u5728\u5185\u5b58\u4e2d\u4fdd\u7559\u7684\u6700\u5927\u8bb0\u5f55\u6570\u3002 \u6b64\u6570\u5b57\u4e0d\u5e94\u5c0f\u4e8e\u6b64\u5904\u7ec4\u4ef6\u7684\u6700\u5927\u5e76\u53d1\u7ebf\u7a0b\u6570\uff0c\u5426\u5219\u5c06\u9891\u7e41\u4e3a\u6bcf\u4e2a\u6570\u636e\u6d41\u521b\u5efa\u8f93\u51fa\u3002
__Relationship.failure.description=\u5982\u679c\u65e0\u6cd5\u5408\u5e76\u8bb0\u5f55\uff0c\u90a3\u4e48\u7528\u4e8e\u521b\u5efa\u8bb0\u5f55\u7684\u6240\u6709\u6570\u636e\u6d41\u90fd\u5c06\u8f93\u51fa\u5230\u6b64\u8fde\u7ebf
__Relationship.original.description=\u7528\u4e8e\u521b\u5efa\u8bb0\u5f55\u7684\u539f\u59cb\u8f93\u5165\u6570\u636e\u6d41
__Relationship.merged.description=\u6210\u529f\u5408\u5e76\u8f93\u5165\u6570\u636e\u6d41\u540e\u7684\u8f93\u51fa\u8fde\u7ebf
__ReadsAttribute.fragment.identifier.description=\u4ec5\u5728<\u5408\u5e76>\u5c5e\u6027\u8bbe\u7f6e\u4e3aDefragment\u65f6\u9002\u7528\u3002 \u5177\u6709\u6b64\u5c5e\u6027\u76f8\u540c\u503c\u7684\u6240\u6709\u6570\u636e\u6d41\u5c06\u6346\u7ed1\u5728\u4e00\u8d77\u3002
__ReadsAttribute.fragment.count.description=\u4ec5\u5728<\u5408\u5e76\u7b56\u7565>\u5c5e\u6027\u8bbe\u7f6e\u4e3aDefragment\u65f6\u9002\u7528\u3002 \u6b64\u5c5e\u6027\u5fc5\u987b\u5b58\u5728\u4e8e\u6240\u6709\u6570\u636e\u6d41\u4e0a\uff0c\u5e76\u4e14\u5177\u6709\u4e0efragment.identifier\u5c5e\u6027\u76f8\u540c\u7684\u503c\u3002 \u540c\u4e00\u6346\u7ed1\u5305\u4e2d\u7684\u6240\u6709\u6570\u636e\u6d41\u5fc5\u987b\u5177\u6709\u6b64\u5c5e\u6027\u7684\u76f8\u540c\u503c\u3002 \u6b64\u5c5e\u6027\u7684\u503c\u6307\u793a\u7ed9\u5b9a\u5305\u4e2d\u5e94\u8be5\u9884\u671f\u7684\u6570\u636e\u6d41\u6570\u3002
__WritesAttribute.record.count.description=\u5408\u5e76\u7684\u6570\u636e\u6d41\u5c06\u5177\u6709'record.count'\u5c5e\u6027\uff0c\u6307\u793a\u5199\u5165\u6570\u636e\u6d41\u7684\u8bb0\u5f55\u6570\u3002
__WritesAttribute.mime.type.description=\u5199\u670d\u52a1\u6307\u5b9a\u7684MIME\u7c7b\u578b
__WritesAttribute.merge.count.description=\u5408\u5e76\u5230\u6b64\u8bb0\u5f55\u4e2d\u7684\u6570\u636e\u6d41\u6570
__WritesAttribute.merge.bin.age.description=\u5408\u5e76\u548c\u8f93\u51fa\u65f6\u8bb0\u5f55\u7684\u751f\u547d\u5468\u671f\uff08\u4ee5\u6beb\u79d2\u4e3a\u5355\u4f4d\uff09\u3002 \u5b9e\u9645\u4e0a\uff0c\u8fd9\u662f\u6b64\u8bb0\u5f55\u4e2d\u7684\u4efb\u4f55\u6570\u636e\u6d41\u5728\u8f93\u51fa\u4e4b\u524d\u5728\u6b64\u5904\u7406\u5668\u4e2d\u7b49\u5f85\u7684\u6700\u957f\u65f6\u95f4
__WritesAttribute.merge.uuid.description=\u5408\u5e76\u6570\u636e\u6d41\u7684UUID\u5c5e\u6027\u5c06\u88ab\u6dfb\u52a0\u5230\u539f\u59cb\u6570\u636e\u6d41
__WritesAttribute.Attributes_from_Record_Writer.description=\u914d\u7f6e\u7684\u5199\u670d\u52a1\u8fd4\u56de\u7684\u4efb\u4f55\u5c5e\u6027\u90fd\u5c06\u6dfb\u52a0\u5230\u6570\u636e\u6d41\u4e2d\u3002
