__CapabilityDescription=\u6839\u636e\u7ed9\u5b9a\u7684\u6a21\u677f\u9a8c\u8bc1\u4f20\u5165\u6570\u636e\u6d41\u7684\u8bb0\u5f55\u3002\u7b26\u5408\u6a21\u677f\u7684\u6240\u6709\u8bb0\u5f55\u90fd\u88ab\u8def\u7531\u5230\u201c\u6709\u6548\u201d\u8fde\u7ebf\uff0c\u800c\u4e0d\u7b26\u5408\u6a21\u677f\u7684\u8bb0\u5f55\u88ab\u8def\u7531\u5230\u201c\u65e0\u6548\u201d\u8fde\u7ebf\u3002\u56e0\u6b64\uff0c\u5982\u679c\u67d0\u4e9b\u8bb0\u5f55\u6839\u636e\u6a21\u677f\u6709\u6548\uff0c\u800c\u5176\u4ed6\u8bb0\u5f55\u65e0\u6548\uff0c\u5219\u53ef\u4ee5\u5c06\u5355\u4e2a\u4f20\u5165\u7684\u6570\u636e\u6d41\u62c6\u5206\u4e3a\u4e24\u4e2a\u5355\u72ec\u7684\u6570\u636e\u6d41\u3002\u8def\u7531\u5230\u201c\u65e0\u6548\u201d\u8fde\u7ebf\u7684\u4efb\u4f55\u6570\u636e\u6d41\u90fd\u5c06\u53d1\u51fa\u4e00\u4e2a\u8def\u7531\u6765\u6e90\u4e8b\u4ef6\uff0c\u5176\u4e2d\u586b\u5145\u4e86Details\u5b57\u6bb5\uff0c\u4ee5\u89e3\u91ca\u8bb0\u5f55\u65e0\u6548\u7684\u539f\u56e0\u3002\u6b64\u5916\uff0c\u4e3a\u4e86\u8fdb\u4e00\u6b65\u89e3\u91ca\u8bb0\u5f55\u65e0\u6548\u7684\u539f\u56e0\uff0c\u53ef\u4ee5\u4e3a\u201corg.apache.nifi.processors.standard.ValidateRecord\u201d\u8bb0\u5f55\u5668\u542f\u7528\u8c03\u8bd5\u7ea7\u65e5\u5fd7\u8bb0\u5f55\u3002
__Tags=record, schema, validate, \u8bb0\u5f55, \u6a21\u677f, \u9a8c\u8bc1
record-reader.displayName=\u8bb0\u5f55\u8bfb\u53d6\u670d\u52a1
record-reader.description=\u6307\u5b9a\u7528\u4e8e\u8bfb\u53d6\u4f20\u5165\u6570\u636e\u7684\u63a7\u5236\u5668\u670d\u52a1\u3002
record-writer.displayName=\u8bb0\u5f55\u8f93\u51fa\u670d\u52a1
record-writer.description=\u6307\u5b9a\u7528\u4e8e\u5199\u51fa\u8bb0\u5f55\u7684\u63a7\u5236\u5668\u670d\u52a1\u3002
invalid-record-writer.displayName=\u65e0\u6548\u8bb0\u5f55\u7684\u8bb0\u5f55\u7f16\u5199\u5668
invalid-record-writer.description=\u5982\u679c\u6307\u5b9a\uff0c\u6b64\u63a7\u5236\u5668\u670d\u52a1\u5c06\u7528\u4e8e\u5199\u51fa\u4efb\u4f55\u65e0\u6548\u7684\u8bb0\u5f55\u3002\u5982\u679c\u672a\u6307\u5b9a\uff0c\u5c06\u4f7f\u7528\u201c\u8bb0\u5f55\u8bfb\u53d6\u5668\u201d\u5c5e\u6027\u6307\u5b9a\u7684\u7f16\u5199\u5668\u3002\u4f8b\u5982\uff0c\u5f53\u914d\u7f6e\u7684\u8bb0\u5f55\u7f16\u5199\u5668\u65e0\u6cd5\u5199\u5165\u4e0d\u7b26\u5408\u5176\u67b6\u6784\u7684\u6570\u636e(\u5982Avro\u7684\u60c5\u51b5)\u65f6\uff0c\u6216\u8005\u5e0c\u671b\u5728\u5c06\u6709\u6548\u8bb0\u5f55\u8f6c\u6362\u4e3a\u5176\u4ed6\u683c\u5f0f\u7684\u540c\u65f6\u4fdd\u7559\u539f\u59cb\u683c\u5f0f\u7684\u65e0\u6548\u8bb0\u5f55\u65f6\uff0c\u8fd9\u662f\u5f88\u6709\u7528\u7684\u3002
schema-access-strategy.displayName=\u6a21\u5f0f\u8bbf\u95ee\u7b56\u7565
schema-access-strategy.description=\u5b9a\u4e49\u5982\u4f55\u83b7\u53d6\u5e94\u7528\u4e8e\u9a8c\u8bc1\u8bb0\u5f55\u7684\u6a21\u677f\u3002
__AllowableValue.schema-access-strategy.reader-schema.displayName=\u4f7f\u7528\u201c\u8bfb\u201d\u6a21\u677f
__AllowableValue.schema-access-strategy.reader-schema.description=\u8981\u9a8c\u8bc1\u6570\u636e\u7684\u6a21\u677f\u662f\u901a\u8fc7\u8f6e\u8be2\u914d\u7f6e\u7684\u8bb0\u5f55\u8bfb\u53d6\u5668\u7684\u6a21\u677f\u6765\u786e\u5b9a\u7684\u3002
__AllowableValue.schema-access-strategy.schema-name-property.displayName=\u4f7f\u7528\u6a21\u677f\u540d\u79f0\u5c5e\u6027
__AllowableValue.schema-access-strategy.schema-name-property.description=\u9a8c\u8bc1\u6570\u636e\u6240\u4f9d\u636e\u7684\u6a21\u677f\u662f\u901a\u8fc7\u67e5\u770b\u201c\u6a21\u677f\u540d\u79f0\u201d\u5c5e\u6027\u5e76\u5728\u914d\u7f6e\u7684\u6a21\u677f\u6ce8\u518c\u8868\u4e2d\u67e5\u627e\u6a21\u677f\u6765\u786e\u5b9a\u7684\u3002
__AllowableValue.schema-access-strategy.schema-text-property.displayName=\u4f7f\u7528\u6a21\u677f\u6587\u672c\u5c5e\u6027
__AllowableValue.schema-access-strategy.schema-text-property.description=\u9a8c\u8bc1\u6570\u636e\u6240\u4f9d\u636e\u7684\u6a21\u677f\u662f\u901a\u8fc7\u67e5\u770b\u201c\u6a21\u677f\u6587\u672c\u201d\u5c5e\u6027\u5e76\u5c06\u8be5\u6a21\u677f\u89e3\u6790\u4e3aAvro\u6a21\u5f0f\u6765\u786e\u5b9a\u7684\u3002
schema-registry.displayName=\u6a21\u677f\u6ce8\u518c\u8868
schema-registry.description=\u6307\u5b9a\u8981\u7528\u4e8e\u6a21\u677f\u6ce8\u518c\u8868\u7684\u63a7\u5236\u5668\u670d\u52a1\u3002\u53ea\u6709\u5f53\u6a21\u677f\u8bbf\u95ee\u7b56\u7565\u8bbe\u7f6e\u4e3a\u201c\u4f7f\u7528\u2018\u6a21\u677f\u540d\u79f0\u2019\u5c5e\u6027\u201d\u65f6\uff0c\u624d\u751f\u6548\u7684\u3002
schema-name.displayName=\u6a21\u677f\u540d\u79f0
schema-name.description=\u6307\u5b9a\u8981\u5728\u6a21\u677f\u6ce8\u518c\u8868\u5c5e\u6027\u4e2d\u67e5\u627e\u7684\u6a21\u677f\u7684\u540d\u79f0\u3002
schema-text.displayName=\u6a21\u677f\u6587\u672c
schema-text.description=Avro\u683c\u5f0f\u6a21\u677f\u7684\u6587\u672c
allow-extra-fields.displayName=\u5141\u8bb8\u989d\u5916\u5b57\u6bb5
allow-extra-fields.description=\u5982\u679c\u4f20\u5165\u6570\u636e\u5177\u6709\u6a21\u677f\u4e2d\u4e0d\u5b58\u5728\u7684\u5b57\u6bb5\uff0c\u5219\u6b64\u5c5e\u6027\u5c06\u786e\u5b9a\u8bb0\u5f55\u662f\u5426\u6709\u6548\u3002\u5982\u679c\u4e3atrue\uff0c\u5219\u8bb0\u5f55\u4ecd\u7136\u6709\u6548\u3002\u5982\u679c\u4e3afalse\uff0c\u5219\u7531\u4e8e\u989d\u5916\u7684\u5b57\u6bb5\uff0c\u8be5\u8bb0\u5f55\u5c06\u65e0\u6548\u3002
__AllowableValue.allow-extra-fields.false.displayName=\u4e0d\u5141\u8bb8
__AllowableValue.allow-extra-fields.true.displayName=\u5141\u8bb8
strict-type-checking.displayName=\u4e25\u683c\u7c7b\u578b\u68c0\u67e5
strict-type-checking.description=\u5982\u679c\u4f20\u5165\u6570\u636e\u5177\u6709\u5b57\u6bb5\u7c7b\u578b\u4e0d\u6b63\u786e\u7684\u8bb0\u5f55\uff0c\u5219\u6b64\u5c5e\u6027\u786e\u5b9a\u662f\u5426\u5904\u7406\u8be5\u8bb0\u5f55\u3002\u5982\u679c\u4e3atrue\uff0c\u5219\u8be5\u8bb0\u5f55\u4ecd\u5c06\u88ab\u89c6\u4e3a\u65e0\u6548\u3002\u5982\u679c\u4e3afalse\uff0c\u5219\u8be5\u8bb0\u5f55\u5c06\u88ab\u8ba4\u4e3a\u662f\u6709\u6548\u7684\uff0c\u5e76\u4e14\u8be5\u5b57\u6bb5\u5c06\u88ab\u5f3a\u5236\u4e3a\u6b63\u786e\u7684\u7c7b\u578b(\u5982\u679c\u53ef\u80fd\uff0c\u5219\u6839\u636e '\u8bb0\u5f55\u7f16\u5199\u5668' \u652f\u6301\u7684\u7c7b\u578b\u5f3a\u5236)\u3002
__AllowableValue.strict-type-checking.false.displayName=\u5426
__AllowableValue.strict-type-checking.true.displayName=\u662f
__Relationship.valid.description=\u6839\u636e\u6a21\u677f\u6709\u6548\u7684\u8bb0\u5f55\u5c06\u88ab\u8def\u7531\u5230\u6b64\u8fde\u7ebf
__Relationship.invalid.description=\u6839\u636e\u6a21\u677f\u65e0\u6548\u7684\u8bb0\u5f55\u5c06\u88ab\u8def\u7531\u5230\u6b64\u8fde\u7ebf
__Relationship.failure.description=\u5982\u679c\u7531\u4e8e\u4efb\u4f55\u539f\u56e0\u65e0\u6cd5\u8bfb\u53d6\u3001\u9a8c\u8bc1\u6216\u5199\u5165\u8bb0\u5f55\uff0c\u5219\u539f\u59cb\u6d41\u6587\u4ef6\u5c06\u88ab\u8def\u7531\u5230\u6b64\u8fde\u7ebf
__WritesAttribute.mime.type.description=\u5c06mime.type\u5c5e\u6027\u8bbe\u7f6e\u4e3a\u8bb0\u5f55\u7f16\u5199\u5668\u6307\u5b9a\u7684MIME\u7c7b\u578b
__WritesAttribute.record.count.description=\u6d41\u6587\u4ef6\u7684\u8def\u7531\u8bb0\u5f55\u7684\u6b21\u6570
