__CapabilityDescription=\u76d1\u89c6\u6d3b\u52a8\u7684\u6570\u636e\u6d41\uff0c\u5e76\u5728\u6570\u636e\u6d41\u5728\u6307\u5b9a\u7684\u65f6\u95f4\u6bb5\u5185\u6ca1\u6709\u4efb\u4f55\u6570\u636e\u65f6\u53d1\u9001\u6307\u6807\uff0c\u5f53\u6570\u636e\u6d41\u7684\u6d3b\u52a8\u6062\u590d\u65f6\u518d\u6b21\u53d1\u9001\u6307\u6807\u3002
__Tags=monitor, flow, active, inactive, activity, detection, \u76d1\u89c6, \u6d3b\u52a8, \u5bdf\u89c9, \u4fa6\u67e5
Threshold_Duration.displayName=\u95f4\u9694\u65f6\u957f
Threshold_Duration.description=\u6307\u5b9a\u591a\u957f\u65f6\u95f4\u540e\u88ab\u8ba4\u5b9a\u4e3a\u975e\u6d3b\u52a8\u6570\u636e\u6d41
Continually_Send_Messages.displayName=\u8fde\u7eed\u53d1\u9001\u6d88\u606f
Continually_Send_Messages.description=\u5982\u679c\u5141\u8bb8\uff0c\u5c06\u6bcf\u4e2a\u300a\u95f4\u9694\u65f6\u957f\u300b\u65f6\u95f4\u5c31\u8fde\u7eed\u53d1\u9001\u4e0d\u6d3b\u52a8\u6307\u6807\uff0c\u76f4\u5230\u6d3b\u52a8\u6062\u590d\uff1b\u5982\u679c\u7981\u6b62\uff0c\u5219\u4ec5\u5f53\u6d41\u9996\u6b21\u53d8\u4e3a\u4e0d\u6d3b\u52a8\u65f6\u624d\u53d1\u9001\u6307\u6807\u3002
__AllowableValue.Continually_Send_Messages.false.displayName=\u7981\u6b62
__AllowableValue.Continually_Send_Messages.true.displayName=\u5141\u8bb8
Inactivity_Message.displayName=\u4e0d\u6d3b\u52a8\u6d88\u606f
Inactivity_Message.description=\u5c06\u4f5c\u4e3a\u53d1\u9001\u5230\u201cinactive\u201d\u8fde\u7ebf\u7684\u6570\u636e\u6d41\u5185\u5bb9\u7684\u6d88\u606f
Activity_Restored_Message.displayName=\u6d3b\u52a8\u6062\u590d\u6d88\u606f
Activity_Restored_Message.description=\u5c06\u4f5c\u4e3a\u53d1\u9001\u5230\u201cactivity.restored\u201d\u8fde\u7ebf\u7684\u6570\u636e\u6d41\u5185\u5bb9\u7684\u6d88\u606f
Copy_Attributes.displayName=\u62f7\u8d1d\u5c5e\u6027
Copy_Attributes.description=\u5982\u679c\u62f7\u8d1d\uff0c\u5c06\u4ece\u6062\u590d\u6d3b\u52a8\u7684\u6570\u636e\u6d41\u7684\u6240\u6709\u5c5e\u6027\u62f7\u8d1d\u5230\u65b0\u521b\u5efa\u7684\u6570\u636e\u6d41\u5f53\u4e2d
__AllowableValue.Copy_Attributes.false.displayName=\u7981\u6b62
__AllowableValue.Copy_Attributes.true.displayName=\u652f\u6301
Monitoring_Scope.displayName=\u76d1\u63a7\u8303\u56f4
Monitoring_Scope.description=\u6307\u5b9a\u76d1\u63a7\u7684\u8303\u56f4\u3002\u201c\u8282\u70b9\u201d\u8868\u793a\u5728\u5355\u4e2a\u8282\u70b9\u4e0a\u5206\u522b\u68c0\u67e5\u6d3b\u52a8\u6027\u3002\u5982\u679cDFM\u5e0c\u671b\u6bcf\u4e2a\u8282\u70b9\u90fd\u4ee5\u5206\u5e03\u5f0f\u65b9\u5f0f\u63a5\u6536\u6570\u636e\u6d41\uff0c\u90a3\u4e48\u8fd9\u5c06\u975e\u5e38\u6709\u7528\u3002  \u5bf9\u4e8e\u96c6\u7fa4\uff0c\u5b83\u5b9a\u4e49\u5f53\u81f3\u5c11\u4e00\u4e2a\u8282\u70b9\u4e3b\u52a8\u63a5\u6536\u6570\u636e\u6d41\u65f6\u6d41\u662f\u6d3b\u52a8\u7684\u3002\u5982\u679c\u5e73\u53f0\u5355\u673a\u6a21\u5f0f\u8fd0\u884c\uff0c\u5219\u5e94\u8be5\u88ab\u8bbe\u7f6e\u4e3a\u8282\u70b9\uff0c\u5982\u679c\u9009\u96c6\u7fa4\uff0c\u5e73\u53f0\u5c06\u62a5\u8b66\u544a\u5e76\u6309\u8282\u70b9\u5904\u7406
__AllowableValue.Monitoring_Scope.cluster.displayName=\u96c6\u7fa4
__AllowableValue.Monitoring_Scope.node.displayName=\u8282\u70b9
Reporting_Node.displayName=\u62a5\u544a\u8282\u70b9
Reporting_Node.description=\u6307\u5b9a\u5e94\u5c06\u901a\u77e5\u6570\u636e\u6d41\u53d1\u9001\u5230\u201cinactive\u201d \u548c\u201cactivity.restored\u201d\u7684\u8fde\u7ebf\u3002\u5bf9\u4e8e\u6240\u6709\u8282\u70b9\uff0c\u96c6\u7fa4\u4e2d\u7684\u6bcf\u4e2a\u8282\u70b9\u90fd\u53d1\u9001\u6570\u636e\u6d41\u901a\u77e5\u3002\u800c\u4e3b\u8282\u70b9\u8868\u793a\u4ec5\u4e3b\u8282\u70b9\u53d1\u9001\u6570\u636e\u6d41\u3002\u5982\u679c\u5e73\u53f0\u5355\u673a\u6a21\u5f0f\u8fd0\u884c\uff0c\u5219\u5e94\u8be5\u88ab\u8bbe\u7f6e\u4e3a\u6240\u6709\uff0c\u5982\u679c\u9009\u4e3b\u8282\u70b9\uff0c\u5e73\u53f0\u4ecd\u65e7\u6309\u6240\u6709\u8282\u70b9\u5904\u7406
__AllowableValue.Reporting_Node.all.displayName=\u6240\u6709
__AllowableValue.Reporting_Node.primary.displayName=\u4e3b\u8282\u70b9
__Relationship.inactive.description=\u5f53\u5728\u65f6\u95f4\u95f4\u9694\u65f6\u95f4\u5185\u6ca1\u6709\u6570\u636e\u6d41\u8f93\u51fa\u5230\u6210\u529f\u8fde\u7ebf\uff0c\u5219\u5c06\u8def\u7531\u90fd\u6b64\u975e\u6d3b\u52a8\u6307\u6807\u8fde\u7ebf
__Relationship.success.description=\u6570\u636e\u6d41\u6210\u529f\u8f93\u51fa\u5230\u6b64\u8fde\u7ebf
__Relationship.activity.restored.description=\u5f53\u6570\u636e\u6d41\u8f93\u51fa\u5230\u6210\u529f\u8fde\u7ebf\u540e\u4e00\u6bb5\u65f6\u95f4\u975e\u6d3b\u52a8\u540e\uff0c\u5e76\u4e14\u6d3b\u52a8\u6062\u590d\u540e\u7684\u6570\u636e\u6d41\u8def\u7531\u5230\u8fde\u7ebf
__WritesAttribute.inactivityStartMillis.description=\u975e\u6d3b\u52a8\u5f00\u59cb\u7684\u65f6\u95f4\uff08\u6beb\u79d2\uff09
__WritesAttribute.inactivityDurationMillis.description=\u975e\u6d3b\u52a8\u6301\u7eed\u7684\u65f6\u95f4\uff08\u6beb\u79d2\uff09
__Stateful.description=\u7ec4\u4ef6\u5c06\u5b58\u50a8\u6bcf\u4e2a\u8282\u70b9\u4e0a\u7684\u6700\u540e\u4e00\u4e2a\u65f6\u95f4\u6233\u72b6\u6001\uff0c\u4ee5\u4fbf\u5b83\u53ef\u4ee5\u5728\u96c6\u7fa4\u8303\u56f4\u5185\u68c0\u67e5\u6d3b\u52a8\u3002\u5982\u679c\u652f\u6301\u300a\u62f7\u8d1d\u5c5e\u6027\u300b\uff0c\u5219\u5c5e\u6027\u4e5f\u5c06\u88ab\u6301\u4e45\u5316
