__CapabilityDescription=\u76d1\u542c\u63a5\u5165\u7684TCP\u8fde\u63a5\u5e76\u901a\u8fc7\u914d\u7f6e\u7684<\u8bfb\u53d6\u670d\u52a1>\u4e2d\u8bfb\u53d6\u6570\u636e\u5230\u6bcf\u4e2a\u8fde\u63a5\u4e2d\uff0c\u7136\u540e\u901a\u8fc7<\u5199\u5165\u670d\u52a1>\u6307\u5b9a\u7684\u65b9\u5f0f\u5199\u5165\u8bb0\u5f55\u5230\u8f93\u51fa\u6570\u636e\u6d41\u4e2d\u3002\u8bbe\u7f6e\u7684<\u8bfb\u53d6\u670d\u52a1>\u5c06\u51b3\u5b9a\u5ba2\u6237\u7aef\u53d1\u9001\u7684\u6570\u636e\u3002\u4f8b\u5982\uff0c\u5f53\u4f7f\u7528Grok\u670d\u52a1\u8bfb\u53d6\u65e5\u5fd7\u65f6\uff0c\u5ba2\u6237\u7aef\u53ef\u4ee5\u4fdd\u6301\u6253\u5f00\u7684\u8fde\u63a5\u5e76\u8fde\u7eed\u5730\u5904\u7406\u6570\u636e\uff0c\u4f46\u662f\u5f53\u4f7f\u7528JSON\u670d\u52a1\u8bfb\u53d6\u65f6, \u5ba2\u6237\u7aef\u4e0d\u80fd\u8bfb\u53d6\u4e00\u4e2aJSON\u6570\u7ec4\u6587\u6863\u5e76\u53d1\u9001\u6570\u7ec4\u6570\u636e\u5230\u76f8\u540c\u7684\u8fde\u63a5\uff0c \u57fa\u4e8e\u6b64\uff0c\u8fd9\u5c06\u662f\u4e00\u4e2a\u6bd4\u8f83\u7cdf\u7cd5\u7684\u72b6\u6001. \u57fa\u4e8e\u6570\u636e\u5757\u7684\u6a21\u5f0f\u4ece\u8fde\u63a5\u4e2d\u8bfb\u53d6\u6570\u636e\u8bb0\u5f55\uff0c\u5e76\u4e14\u6839\u636e<\u8bfb\u8d85\u65f6>\u8bbe\u7f6e\u51b3\u5b9a\u662f\u5426\u8d85\u65f6\u3002\u5982\u679c\u8bfb\u53d6\u8d85\u65f6\uff0c\u6216\u8005\u8bfb\u53d6\u662f\u6709\u4efb\u4f55\u9519\u8bef\uff0c\u5219\u5c06\u65ad\u6389\u8fde\u63a5\uff0c\u7136\u540e\u5df2\u7ecf\u8bfb\u53d6\u7684\u6570\u636e\u5c06\u6839\u636e<\u8bfb\u53d6\u9519\u8bef\u7b56\u7565>\u8fdb\u884c\u5904\u7406(\u4e22\u5f03\u8fd8\u662f\u4f20\u9001)\u3002\u5728\u5ba2\u6237\u7aef\u4fdd\u6301\u8fde\u63a5\u6253\u5f00\u7684\u60c5\u51b5\u4e0b, \u6839\u636e<\u6700\u5927TCP\u8fde\u63a5\u6570>\u8bbe\u7f6e\u652f\u6301\u591a\u7ebf\u7a0b\u4efb\u52a1\uff0c\u5e76\u6709\u4e00\u4e2a\u4efb\u52a1\u5904\u7406\u6bcf\u4e2a\u8fde\u63a5\u3002
__Tags=listen, tcp, record, tls, ssl, \u76d1\u542c, \u8bb0\u5f55
Local_Network_Interface.displayName=\u672c\u5730\u7f51\u7edc\u63a5\u53e3
Local_Network_Interface.description=\u5728\u7279\u5b9a\u5c40\u57df\u7f51\u5185\uff0c\u7528\u4e8e\u9650\u5236\u4fa6\u542c\u672c\u5730\u7f51\u7edc\u63a5\u53e3\u7684\u540d\u79f0
port.displayName=\u7aef\u53e3\u53f7
port.description=\u901a\u4fe1\u76d1\u542c\u7aef\u53e3\u3002
max-size-socket-buffer.displayName=Socket\u7f13\u5b58\u5927\u5c0f
max-size-socket-buffer.description=\u5e94\u4f7f\u7528\u7684\u5957\u63a5\u5b57\u7f13\u51b2\u533a\u7684\u6700\u5927\u503c\u3002 \u8fd9\u662f\u5bf9\u64cd\u4f5c\u7cfb\u7edf\u7684\u5efa\u8bae\uff0c\u4ee5\u6307\u793a\u5957\u63a5\u5b57\u7f13\u51b2\u533a\u5e94\u8be5\u6709\u591a\u5927\u3002 \u5982\u679c\u6b64\u503c\u8bbe\u7f6e\u5f97\u592a\u4f4e\uff0c\u7f13\u51b2\u533a\u53ef\u80fd\u4f1a\u5728\u8bfb\u53d6\u6570\u636e\u4e4b\u524d\u586b\u6ee1\uff0c\u5e76\u4e14\u4f20\u5165\u7684\u6570\u636e\u5c06\u88ab\u4e22\u5f03\u3002
max-number-tcp-connections.displayName=\u6700\u5927TCP\u8fde\u63a5\u6570
max-number-tcp-connections.description=\u63a5\u53d7TCP\u8fde\u63a5\u7684\u6700\u5927\u5e76\u53d1\u8fde\u63a5\u6570. \u5728\u5ba2\u6237\u7aef\u4fdd\u6301\u8fde\u63a5\u6253\u5f00\u7684\u60c5\u51b5\u4e0b, \u6839\u636e\u8be5\u8bbe\u7f6e\u652f\u6301\u591a\u7ebf\u7a0b\u4efb\u52a1\uff0c\u5e76\u6709\u4e00\u4e2a\u4efb\u52a1\u5904\u7406\u6bcf\u4e2a\u8fde\u63a5\u3002
read-timeout.displayName=\u8bfb\u8d85\u65f6
read-timeout.description=\u5f53\u4ece\u8fde\u63a5\u4e2d\u8bfb\u53d6\u6570\u636e\u65f6\u7684\u7b49\u5f85\u65f6\u95f4
record-reader.displayName=\u8bfb\u53d6\u670d\u52a1
record-reader.description=\u7528\u4e8e\u8bfb\u53d6\u8f93\u5165\u6570\u636e\u6d41\u6570\u636e\u7684\u670d\u52a1
record-writer.displayName=\u5199\u5165\u670d\u52a1
record-writer.description=\u4e3a\u4e86\u5728\u5199\u5165\u6570\u636e\u6d41\u6570\u636e\u4e4b\u524d\u5e8f\u5217\u5316\u6570\u636e\u7684\u670d\u52a1
reader-error-handling-strategy.displayName=\u8bfb\u53d6\u9519\u8bef\u7b56\u7565
reader-error-handling-strategy.description=\u5f53\u4e4b\u524d\u7684\u8bb0\u5f55\u5df2\u7ecf\u4ece\u8fde\u63a5\u4e2d\u8bfb\u53d6\uff0c\u51b3\u5b9a\u5982\u4f55\u5904\u7406\u4ece\u8fde\u63a5\u4e2d\u8bfb\u53d6\u4e0b\u4e00\u4e2a\u8bb0\u5f55\u65f6\u51fa\u9519\u540e\u7684\u5904\u7406\u7b56\u7565\u3002
__AllowableValue.reader-error-handling-strategy.Discard.displayName=\u4e22\u5f03
__AllowableValue.reader-error-handling-strategy.Discard.description=\u4e22\u5f03\u5df2\u7ecf\u63a5\u6536\u7684\u8bb0\u5f55\uff0c\u5e76\u65ad\u5f00\u8fde\u63a5
__AllowableValue.reader-error-handling-strategy.Transfer.displayName=\u4f20\u9001
__AllowableValue.reader-error-handling-strategy.Transfer.description=\u4f20\u9001\u5df2\u63a5\u6536\u7684\u6240\u6709\u6570\u636e\uff0c\u7136\u540e\u65ad\u5f00\u8fde\u63a5
record-batch-size.displayName=\u5206\u6279\u6570\u91cf
record-batch-size.description=\u5355\u4e2a\u6570\u636e\u6d41\u53ef\u5199\u5165\u8bb0\u5f55\u7684\u6700\u5927\u6570\u91cf
ssl-context-service.displayName=SSL\u670d\u52a1
ssl-context-service.description=\u7528\u4e8eSSL\u7684\u670d\u52a1\uff0c\u8bbe\u7f6e\u540e\uff0c\u6d88\u606f\u5c06\u901a\u8fc7\u52a0\u5bc6\u4fe1\u9053\u6765\u63a5\u6536
client-auth.displayName=\u5ba2\u6237\u7aef\u8ba4\u8bc1
client-auth.description=\u5f53\u4f7f\u7528SSL\u670d\u52a1\u65f6\u7684\u5ba2\u6237\u7aef\u8ba4\u8bc1\u7b56\u7565\u3002\u4ec5\u5f53\u63d0\u4f9bSSL\u670d\u52a1\u8bbe\u7f6e\u65f6\u6709\u6548
__AllowableValue.client-auth.NONE.displayName=\u4e0d\u9700\u8981
__AllowableValue.client-auth.REQUIRED.displayName=\u5fc5\u987b
__AllowableValue.client-auth.WANT.displayName=\u8bf7\u6c42
__Relationship.success.description=\u6210\u529f\u63a5\u6536\u6570\u636e\u540e\u7684\u6570\u636e\u6d41\u5c06\u8f93\u51fa\u5230\u6b64\u8fde\u63a5
__WritesAttribute.tcp.sender.description=\u53d1\u9001\u6570\u636e\u7684\u4e3b\u673a
__WritesAttribute.tcp.port.description=\u8be5\u7ec4\u4ef6\u63a5\u6536\u8fde\u63a5\u7684\u7aef\u53e3\u53f7
__WritesAttribute.record.count.description=\u5199\u5165\u6570\u636e\u6d41\u7684\u6570\u636e\u8bb0\u5f55\u6570
__WritesAttribute.mime.type.description=\u5199\u5165\u6570\u636e\u6d41\u7684\u8bb0\u5f55\u7684MIME\u7c7b\u578b
