__CapabilityDescription=\u4ece\u6ca1\u4e00\u4e2a\u8fdb\u6765\u7684\u6d41\u6587\u4ef6\u7684\u5c5e\u6027\u4e2d\u8ba1\u7b97\u51fa\u7f13\u5b58\u7684\u952e, \u7136\u540e\u4ece\u5206\u5e03\u5f0f\u7f13\u5b58\u4e2d\u53d6\u51fa\u4e0e\u4e4b\u76f8\u5bf9\u5e94\u7684\u503c\u3002\u5982\u679c\u4e0d\u8bbe\u7f6e\u8f93\u51fa\u7684\u5c5e\u6027, \u90a3\u4e48\u8f93\u5165\u7684\u6d41\u6587\u4ef6\u7684\u5185\u5bb9\u5c31\u4f1a\u88ab\u66ff\u6362\u6210\u4ece\u5206\u5e03\u5f0f\u7f13\u5b58\u4e2d\u53d6\u51fa\u7684\u4e8c\u8fdb\u5236\u7684\u503c. \u5982\u679c\u6ca1\u6709\u627e\u5230\u5bf9\u5e94\u7684\u952e\uff0c\u90a3\u4e48\u6d41\u6587\u4ef6\u5c31\u4f1a\u88ab\u8def\u7531\u5230'not-found'\u8fde\u7ebf. \u6ce8\u610f\uff0c\u7ec4\u4ef6\u603b\u662f\u5148\u628a\u6574\u4e2a\u7f13\u5b58\u7684\u503c\u5199\u5165\u5230\u5185\u5b58\uff0c\u7136\u540e\u518d\u5199\u5165\u5230\u76ee\u6807\u4f4d\u7f6e\uff0c\u5982\u679c\u503c\u5f88\u5927\u7684\u8bdd\uff0c\u53ef\u80fd\u5b58\u5728\u6f5c\u5728\u7684\u95ee\u9898\u3002
__Tags=map, cache, fetch, distributed
Cache_Entry_Identifier.displayName=\u7f13\u5b58\u6807\u8bc6\u7b26
Cache_Entry_Identifier.description=\u4e00\u4e2a\u9017\u53f7\u5206\u5272\u7684\u6d41\u6587\u4ef6\u5c5e\u6027\u96c6\u5408,\u6216\u8005\u8868\u8fbe\u5f0f\u7684\u96c6\u5408\uff0c\u7528\u6765\u6807\u8bc6\u4e0d\u540c\u7684\u6d41\u6587\u4ef6\u5bf9\u5e94\u4e0d\u540c\u7684\u503c; \u5b83\u662f\u8fd9\u4e9b\u7f13\u5b58\u7684\u503c. \u6ce8\u610f: \u9664\u975e\u5728\u5c5e\u6027\u4e2d\u6307\u5b9a\u4e86"\u628a\u7f13\u5b58\u7684\u503c\u653e\u5230\u5c5e\u6027\u4e2d"\uff0c\u5426\u5219\u53ea\u5141\u8bb8\u4e00\u4e2a\u7f13\u5b58\u6761\u76ee\u6807\u8bc6\u7b26. \u4ec5\u5f53\u76ee\u6807\u662f\u591a\u4e2a\u5c5e\u6027\u65f6\u624d\u652f\u6301\u591a\u4e2a\u7f13\u5b58\u67e5\u627e (\u8bf7\u67e5\u770b\u8fd9\u4e2a\u5c5e\u6027\u7684\u63cf\u8ff0 '\u628a\u7f13\u5b58\u7684\u503c\u653e\u5230\u5c5e\u6027\u4e2d' ).
Distributed_Cache_Service.displayName=\u5206\u5e03\u5f0f\u7f13\u5b58\u670d\u52a1
Distributed_Cache_Service.description=\u63a7\u5236\u5668\u670d\u52a1\u7528\u6765\u83b7\u53d6\u7f13\u5b58\u7684\u503c.
Put_Cache_Value_In_Attribute.displayName=\u628a\u7f13\u5b58\u7684\u503c\u653e\u5230\u5c5e\u6027\u4e2d
Put_Cache_Value_In_Attribute.description=\u5982\u679c\u8bbe\u7f6e\u4e86\uff0c\u7f13\u5b58\u7684\u503c\u5c06\u4f1a\u88ab\u653e\u5165\u6d41\u6587\u4ef6\u7684\u5c5e\u6027\u4e2d\uff0c\u800c\u4e0d\u4f1a\u653e\u5165\u6d41\u6587\u4ef6\u7684\u5185\u5bb9. \u5c5e\u6027\u7684\u952e\u51b3\u5b9a\u4e86\u5c5e\u6027\u7684\u503c. \u5982\u679c\u9009\u62e9\u4e86\u591a\u4e2a\u7f13\u5b58\u6807\u8bc6\u7b26\u5bf9\u5e94\u4e00\u4e2a\u5c5e\u6027\uff0c\u90a3\u4e48\u5c06\u4f7f\u7528\u6b64\u5c5e\u6027\u52a0\u70b9\u751f\u6210\u591a\u4e2a\u5c5e\u6027\u7684\u65b9\u6cd5\u6765\u533a\u5206\u51fa\u591a\u4e2a\u7f13\u5b58\u6807\u8bc6\u7b26\u5bf9\u5e94\u7684\u503c\u3002
Max_Length_To_Put_In_Attribute.displayName=\u5c5e\u6027\u503c\u7684\u6700\u5927\u957f\u5ea6
Max_Length_To_Put_In_Attribute.description=\u5982\u679c\u628a\u7f13\u5b58\u7684\u503c\u5199\u5165\u5230\u6d41\u6587\u4ef6\u7684\u5c5e\u6027\u4e2d(\u901a\u8fc7\u8bbe\u7f6e"\u628a\u7f13\u5b58\u7684\u503c\u5230\u5c5e\u6027\u4e2d" \u5c5e\u6027), \u4f1a\u88ab\u8bbe\u7f6e\u5230\u5c5e\u6027\u503c\u7684\u6700\u5927\u5b57\u7b26\u7684\u6570\u91cf. \u8fd9\u4e00\u70b9\u5f88\u91cd\u8981\uff0c\u56e0\u4e3a\u5c5e\u6027\u4fdd\u5b58\u5728\u5185\u5b58\u4e2d\uff0c\u800c\u8f83\u5927\u7684\u5c5e\u6027\u5c06\u5f88\u5feb\u5bfc\u81f4\u5185\u5b58\u4e0d\u8db3. \u5982\u679c\u8f93\u51fa\u6bd4\u8fd9\u4e2a\u503c\u957f\uff0c\u5219\u5c06\u622a\u65ad\u5b83. \u6240\u4ee5\u8003\u8651\u8bbe\u7f6e\u5c3d\u53ef\u80fd\u7684\u5c0f.
Character_Set.displayName=\u5b57\u7b26\u7f16\u7801
Character_Set.description=\u6307\u5b9a\u7f13\u5b58\u503c\u7684\u5b57\u7b26\u96c6\u7f16\u7801\u3002\u8fd9\u4ec5\u5728\u8def\u7531\u5230\u5c5e\u6027\u65f6\u4f7f\u7528
__Relationship.success.description=\u5982\u679c\u6210\u529f\u4e86\uff0c\u5c06\u4f1a\u88ab\u5206\u914d\u5230\u8fd9\u6761\u7ebf\u3002
__Relationship.failure.description=\u5982\u679c\u5c5e\u6027\u4e3a\u7a7a\uff0c\u6216\u8005\u65e0\u6cd5\u548c\u7f13\u5b58\u8fdb\u884c\u4ea4\u4e92\uff0c\u5219\u4f1a\u88ab\u5206\u914d\u5230\u8fd9\u6761\u8fde\u7ebf\u3002
__Relationship.not-found.description=\u5982\u679c\u5c5e\u6027\u6ca1\u6709\u5728\u7f13\u5b58\u4e2d\u88ab\u627e\u5230, \u5c06\u4f1a\u88ab\u5206\u914d\u5230\u8fd9\u6761\u8fde\u7ebf\u3002
__WritesAttribute.user-defined.description=\u53ea\u8981 '\u628a\u7f13\u5b58\u7684\u503c\u653e\u5230\u5c5e\u6027\u4e2d' \u8bbe\u7f6e\u4e86\uff0c\u65e0\u8bba\u5b83\u8bbe\u7f6e\u7684\u662f\u4ec0\u4e48 \uff0c\u90fd\u5c06\u4ece\u5206\u5e03\u5f0f\u7f13\u5b58\u670d\u52a1\u91cc\u67e5\u627e\u4e0e\u4e4b\u76f8\u5bf9\u5e94\u7684\u503c\u653e\u5165\u6d41\u6587\u4ef6\u4e2d.\u5982\u679c\u9009\u62e9\u4e86\u591a\u4e2a\u7f13\u5b58\u6807\u8bc6\u7b26\u5bf9\u5e94\u4e00\u4e2a\u5c5e\u6027\uff0c\u90a3\u4e48\u5c06\u4f7f\u7528\u6b64\u5c5e\u6027\u52a0\u70b9\u751f\u6210\u591a\u4e2a\u5c5e\u6027\u7684\u65b9\u6cd5\u6765\u533a\u5206\u51fa\u591a\u4e2a\u7f13\u5b58\u6807\u8bc6\u7b26\u5bf9\u5e94\u7684\u503c. \u4f8b\u5982\uff0c\u5982\u679c\u628a\u7f13\u5b58\u6807\u8bc6\u7b26\u8bbe\u7f6e\u4e3a 'id,name', \u800c\u628a\u7528\u6237\u5b9a\u4e49\u7684\u5c5e\u6027\u53eb 'fetched', \u90a3\u4e48\u5c06\u4f1a\u5199\u5165\u5230\u4e24\u4e2a\u5c5e\u6027\u4e2d\uff0c fetched.id \u548c fetched.name, \u5206\u522b\u5305\u62ec\u4ed6\u4eec\u671f\u671b\u7684\u503c.
