__CapabilityDescription=\u5728\u7ed9\u5b9a\u7aef\u53e3\u4e0a\u4fa6\u542c\u62a5\u6587\uff0c\u5e76\u4f7f\u7528\u914d\u7f6e\u7684Record Reader\u8bfb\u53d6\u6bcf\u4e2a\u6570\u636e\u62a5\u7684\u5185\u5bb9\u3002 \u7136\u540e\uff0c\u4f7f\u7528\u914d\u7f6e\u7684Record Writer\u5c06\u6bcf\u6761\u8bb0\u5f55\u5199\u5165\u6d41\u6587\u4ef6\u3002 \u901a\u8fc7\u6307\u5b9a\u53d1\u9001\u4e3b\u673a\u548c\u53d1\u9001\u4e3b\u673a\u7aef\u53e3\u5c5e\u6027\uff0c\u53ef\u4ee5\u9650\u5236\u6b64\u7ec4\u4ef6\u4fa6\u542c\u6765\u81ea\u7279\u5b9a\u8fdc\u7a0b\u4e3b\u673a\u548c\u7aef\u53e3\u7684\u6570\u636e\u62a5\uff0c\u5426\u5219\u5b83\u5c06\u4fa6\u542c\u6765\u81ea\u6240\u6709\u4e3b\u673a\u548c\u7aef\u53e3\u7684\u6570\u636e\u62a5\u3002
__Tags=ingest, udp, listen, source, record, \u76d1\u542c, \u8bb0\u5f55
Local_Network_Interface.displayName=\u672c\u5730\u7f51\u7edc\u63a5\u53e3
Local_Network_Interface.description=\u7528\u4e8e\u9650\u5236\u4fa6\u542c\u7279\u5b9aLAN\u7684\u672c\u5730\u7f51\u7edc\u63a5\u53e3\u7684\u540d\u79f0\u3002
Port.displayName=\u7aef\u53e3\u53f7
Port.description=\u901a\u4fe1\u76d1\u542c\u7aef\u53e3\u3002
Receive_Buffer_Size.displayName=\u63a5\u6536\u7f13\u5b58\u5927\u5c0f
Receive_Buffer_Size.description=\u7528\u4e8e\u63a5\u6536\u6d88\u606f\u7684\u6bcf\u4e2a\u7f13\u51b2\u533a\u7684\u5927\u5c0f\u3002 \u6839\u636e\u4f20\u5165\u6d88\u606f\u7684\u9884\u671f\u5927\u5c0f\u9002\u5f53\u8c03\u6574\u6b64\u503c\u3002
Max_Size_of_Message_Queue.displayName=\u6d88\u606f\u961f\u5217\u6700\u5927\u503c
Max_Size_of_Message_Queue.description=\u7528\u4e8e\u7f13\u51b2\u4ece\u5e95\u5c42\u901a\u9053\u4f20\u8f93\u5230\u7ec4\u4ef6\u7684\u6d88\u606f\u7684\u5185\u90e8\u961f\u5217\u7684\u6700\u5927\u503c\u3002 \u5c06\u6b64\u503c\u8bbe\u7f6e\u5f97\u66f4\u9ad8\u53ef\u4ee5\u5728\u4f20\u5165\u6d88\u606f\u7684\u6d6a\u6d8c\u671f\u95f4\u5c06\u66f4\u591a\u6d88\u606f\u7f13\u51b2\u5728\u5185\u5b58\u4e2d\uff0c\u4f46\u4f1a\u589e\u52a0\u7ec4\u4ef6\u4f7f\u7528\u7684\u603b\u5185\u5b58\u3002
Max_Size_of_Socket_Buffer.displayName=\u5957\u63a5\u5b57\u7f13\u51b2\u6700\u5927\u503c
Max_Size_of_Socket_Buffer.description=\u5e94\u4f7f\u7528\u7684\u5957\u63a5\u5b57\u7f13\u51b2\u533a\u7684\u6700\u5927\u503c\u3002 \u8fd9\u662f\u5bf9\u64cd\u4f5c\u7cfb\u7edf\u7684\u5efa\u8bae\uff0c\u4ee5\u6307\u793a\u5957\u63a5\u5b57\u7f13\u51b2\u533a\u5e94\u8be5\u6709\u591a\u5927\u3002 \u5982\u679c\u6b64\u503c\u8bbe\u7f6e\u5f97\u592a\u4f4e\uff0c\u7f13\u51b2\u533a\u53ef\u80fd\u4f1a\u5728\u8bfb\u53d6\u6570\u636e\u4e4b\u524d\u586b\u6ee1\uff0c\u5e76\u4e14\u4f20\u5165\u7684\u6570\u636e\u5c06\u88ab\u4e22\u5f03\u3002
Character_Set.displayName=\u5b57\u7b26\u7f16\u7801
Character_Set.description=\u6307\u5b9a\u63a5\u6536\u6570\u636e\u7684\u5b57\u7b26\u96c6\u7f16\u7801
poll-timeout.displayName=\u8f6e\u8be2\u8d85\u65f6
poll-timeout.description=\u8f6e\u8be2\u5185\u90e8\u961f\u5217\u4ee5\u83b7\u53d6\u66f4\u591a\u6570\u636e\u62a5\u65f6\u7b49\u5f85\u7684\u65f6\u95f4\u3002 \u5982\u679c\u5728\u7b49\u5f85\u914d\u7f6e\u7684\u8d85\u65f6\u540e\u6ca1\u6709\u627e\u5230\u6570\u636e\u62a5\uff0c\u5219\u7ec4\u4ef6\u5c06\u53d1\u51fa\u5230\u76ee\u524d\u4e3a\u6b62\u5df2\u83b7\u5f97\u7684\u4efb\u4f55\u8bb0\u5f55\u3002
batch-size.displayName=\u5206\u6279\u6570\u91cf
batch-size.description=\u8bb0\u5f55\u5199\u5165\u5355\u4e2a\u6570\u636e\u6d41\u7684\u6700\u5927\u6570\u636e\u62a5\u6570\u3002 \u4ec5\u5f53\u6570\u636e\u6bd4\u8f6e\u8be2\u8d85\u65f6\u66f4\u9891\u7e41\u5730\u8fdb\u5165\u65f6\u624d\u4f1a\u8fbe\u5230\u6279\u91cf\u5927\u5c0f\u3002
record-reader.displayName=\u8bb0\u5f55\u8bfb\u53d6
record-reader.description=\u7528\u4e8e\u8bfb\u53d6\u4f20\u5165\u6570\u636e\u62a5\u5185\u5bb9\u7684\u8bb0\u5f55\u3002
record-writer.displayName=\u8bb0\u5f55\u5199\u5165
record-writer.description=\u7528\u4e8e\u5728\u5199\u5165\u6d41\u6587\u4ef6\u4e4b\u524d\u5e8f\u5217\u5316\u6570\u636e\u7684\u8bb0\u5f55\u3002
sending-host.displayName=\u8fdc\u7a0b\u4e3b\u673a
sending-host.description=\u8fdc\u7a0b\u4e3b\u673a\u7684IP\u6216\u540d\u79f0\u3002 \u4ec5\u63a5\u53d7\u6765\u81ea\u6307\u5b9a\u53d1\u9001\u4e3b\u673a\u7aef\u53e3\u548c\u6b64\u4e3b\u673a\u7684\u6570\u636e\u62a5\u3002 \u63d0\u9ad8\u6027\u80fd\u3002 \u53ef\u4ee5\u662f\u7cfb\u7edf\u5c5e\u6027\u6216\u73af\u5883\u53d8\u91cf\u3002
sending-host-port.displayName=\u8fdc\u7a0b\u7aef\u53e3\u53f7
sending-host-port.description=\u8fdc\u7a0b\u4e3b\u673a\u7528\u4e8e\u53d1\u9001\u6570\u636e\u62a5\u7684\u7aef\u53e3\u3002 \u4ec5\u63a5\u53d7\u6765\u81ea\u6307\u5b9a\u53d1\u9001\u4e3b\u673a\u548c\u6b64\u7aef\u53e3\u7684\u6570\u636e\u62a5\u3002 \u63d0\u9ad8\u6027\u80fd\u3002 \u53ef\u4ee5\u662f\u7cfb\u7edf\u5c5e\u6027\u6216\u73af\u5883\u53d8\u91cf\u3002
__Relationship.success.description=\u6210\u529f\u63a5\u53d7\u7684\u6d88\u606f\u5c06\u53d1\u9001\u5230\u8be5\u8fde\u7ebf\u3002
__Relationship.parse.failure.description=\u5982\u679c\u65e0\u6cd5\u4f7f\u7528\u914d\u7f6e\u7684\u8bb0\u5f55\u89e3\u6790\u6570\u636e\u62a5\uff0c\u5219\u6d88\u606f\u7684\u5185\u5bb9\u5c06\u4f5c\u4e3a\u5176\u5404\u81ea\u7684\u6570\u636e\u6d41\u8f93\u51fa\u5230\u6b64\u8fde\u7ebf\u3002
__WritesAttribute.udp.sender.description=\u53d1\u9001\u6d88\u606f\u7684\u4e3b\u673a
__WritesAttribute.udp.port.description=\u6536\u5230\u6d88\u606f\u7684\u53d1\u9001\u7aef\u53e3\u3002
__WritesAttribute.record.count.description=\u5199\u5165\u6d41\u6587\u4ef6\u7684\u8bb0\u5f55\u6570\u3002
__WritesAttribute.mime.type.description=\u7528\u4e8e\u5c06\u8bb0\u5f55\u5199\u5165\u6570\u636e\u6d41\u7684MIME\u7c7b\u578b\u3002
