__CapabilityDescription=\u4ece\u8bb0\u5f55\u4e2d\u63d0\u53d6\u4e00\u4e2a\u6216\u591a\u4e2a\u5b57\u6bb5\uff0c\u5e76\u5728\u68c0\u7d22\u670d\u52a1\u4e2d\u67e5\u627e\u8fd9\u4e9b\u5b57\u6bb5\u7684\u503c\u3002\u5982\u679c\u68c0\u7d22\u670d\u52a1\u8fd4\u56de\u7ed3\u679c\uff0c\u5219\u53ef\u4ee5\u9009\u62e9\u5c06\u8be5\u7ed3\u679c\u6dfb\u52a0\u5230\u8bb0\u5f55\u4e2d\u3002\u5728\u8fd9\u79cd\u60c5\u51b5\u4e0b\uff0c\u8be5\u7ec4\u4ef6\u7528\u4f5c\u6d53\u7f29\u7ec4\u4ef6\u3002\u65e0\u8bba\u5982\u4f55\uff0c\u8bb0\u5f55\u90fd\u4f1a\u88ab\u8f93\u51fa\u5230\u201cmatched\u201d\u8fde\u7ebf\u6216\u201cunmatched\u201d\u8fde\u7ebf\uff08\u5982\u679c\u201c\u8f93\u51fa\u7b56\u7565\u201d\u5c5e\u6027\u88ab\u914d\u7f6e\uff09\uff0c\u786e\u4fdd\u68c0\u7d22\u670d\u52a1\u662f\u5426\u8fd4\u56de\u7ed3\u679c\uff0c\u5141\u8bb8\u7ec4\u4ef6\u88ab\u7528\u4f5c\u8def\u7531\u7ec4\u4ef6\u3002\u7528\u4e8e\u5728\u68c0\u7d22\u670d\u52a1\u4e2d\u67e5\u627e\u7684\u6807\u8bc6\u662f\u901a\u8fc7\u6dfb\u52a0\u7528\u6237\u81ea\u5b9a\u4e49\u7684\u5c5e\u6027\u6765\u5b9a\u4e49\u7684\u3002\u6dfb\u52a0\u7684\u6bcf\u4e2a\u5c5e\u6027\u90fd\u6709\u4e00\u4e2a\u6dfb\u52a0\u5230Map\u7684\u6761\u76ee\uff0c\u5176\u4e2d\u5c5e\u6027\u7684\u540d\u79f0\u53d8\u4e3aMap\u952e\uff0cRecordPath\u8fd4\u56de\u7684\u503c\u5c06\u6210\u4e3a\u8be5\u952e\u7684\u503c\u3002\u5982\u679cRecordPath\u8fd4\u56de\u591a\u4e2a\u503c\uff0c\u5219Record\u5c06\u88ab\u8f93\u51fa\u5230\u201cunmatched\u201d\u8fde\u7ebf\uff08\u6216\u201csuccess\u201d\u8fde\u7ebf\uff0c\u5177\u4f53\u53d6\u51b3\u4e8e\u201c\u8f93\u51fa\u7b56\u7565\u201d\u5c5e\u6027\u7684\u914d\u7f6e\uff09\u3002\u5982\u679c\u4e00\u4e2a\u6216\u591a\u4e2a\u5b57\u6bb5\u4e0eRecordPath\u5339\u914d\u7684\u7ed3\u679c\uff0c\u5c06\u66f4\u65b0\u5339\u914d\u7684\u6240\u6709\u5b57\u6bb5\u3002\u5982\u679c\u914d\u7f6e\u7684\u68c0\u7d22\u670d\u52a1\u4e2d\u6ca1\u6709\u5339\u914d\u9879\uff0c\u5219\u4e0d\u4f1a\u66f4\u65b0\u4efb\u4f55\u5b57\u6bb5\u3002\u6bd4\u5982\uff0c\u4e0d\u4f1a\u4f7f\u7528\u7a7a\u503c\u8986\u76d6\u8bb0\u5f55\u4e2d\u7684\u73b0\u6709\u503c\u3002\u4f46\u662f\uff0c\u8bf7\u6ce8\u610f\uff0c\u5982\u679c\u5728\u6a21\u5f0f\uff08schema\uff09\u4e2d\u6ca1\u6709\u8003\u8651\u68c0\u7d22\u670d\u52a1\u8fd4\u56de\u7684\u7ed3\u679c\uff08\u7279\u522b\u662f\u4e3a\u5199\u5165\u670d\u52a1\u914d\u7f6e\u7684\u6a21\u5f0f\uff09\uff0c\u90a3\u4e48\u8fd9\u4e9b\u5b57\u6bb5\u5c06\u4e0d\u4f1a\u5199\u5165\u6570\u636e\u6d41\u3002
__Tags=lookup, enrichment, route, record, csv, json, avro, logs, convert, filter, \u8bb0\u5f55, \u67e5\u627e, \u8def\u7531, \u8f6c\u6362, \u8fc7\u6ee4
record-reader.displayName=\u8bb0\u5f55\u8bfb\u53d6\u670d\u52a1
record-reader.description=\u6307\u5b9a\u7528\u4e8e\u8bfb\u53d6\u4f20\u5165\u6570\u636e\u7684\u670d\u52a1
record-writer.displayName=\u8bb0\u5f55\u5199\u5165\u670d\u52a1
record-writer.description=\u6307\u5b9a\u7528\u4e8e\u5199\u51fa\u4f20\u5165\u6570\u636e\u7684\u670d\u52a1
lookup-service.displayName=\u68c0\u7d22\u670d\u52a1
lookup-service.description=\u6307\u5b9a\u7528\u4e8e\u8bb0\u5f55\u68c0\u7d22\u7684\u670d\u52a1
result-record-path.displayName=RecordPath\u7ed3\u679c
result-record-path.description=RecordPath\u6307\u5b9a\u4ece\u68c0\u7d22\u670d\u52a1\u8fd4\u56de\u7684\u503c\u5e94\u8be5\u4f7f\u7528\u54ea\u4e2a\u503c\u66f4\u65b0\u3002 \u5982\u679c\u672a\u6307\u5b9a\uff0c\u5219\u5c06\u5ffd\u7565\u4ece\u68c0\u7d22\u670d\u52a1\u8fd4\u56de\u7684\u503c\uff0c\u9664\u975e\u6570\u636e\u6d41\u8f93\u51fa\u5230\u201cmatched\u201d\u6216\u201cunmatched\u201d\u8fde\u7ebf
routing-strategy.displayName=\u8f93\u51fa\u7b56\u7565
routing-strategy.description=\u6307\u5b9a\u67e5\u627e\u7ed3\u675f\u540e\u5982\u4f55\u8f93\u51fa\u76f8\u5e94\u7684\u8bb0\u5f55
__AllowableValue.routing-strategy.route-to-matched-unmatched.displayName=\u8f93\u51fa\u5230'matched'\u6216\u8005'unmatched'\u8fde\u7ebf
__AllowableValue.routing-strategy.route-to-matched-unmatched.description=\u6839\u636e\u914d\u7f6e\u7684\u68c0\u7d22\u670d\u52a1\u7684\u5339\u914d\u5173\u7cfb\uff0c\u8bb0\u5f55\u5c06\u8f93\u51fa\u5230\u5bf9\u5e94\u7684\u201cmatched\u201d\u6216\u8005\u201cunmatched\u201d\u7684\u8fde\u7ebf\u3002 \u5355\u4e2a\u8f93\u5165\u6570\u636e\u6d41\u53ef\u80fd\u4f1a\u4ea7\u751f\u4e24\u4e2a\u4e0d\u540c\u7684\u8f93\u51fa\u6570\u636e\u6d41\u3002
__AllowableValue.routing-strategy.route-to-success.displayName=\u8f93\u51fa\u5230'success'\u8fde\u7ebf
__AllowableValue.routing-strategy.route-to-success.description=\u65e0\u8bba\u914d\u7f6e\u7684\u68c0\u7d22\u670d\u52a1\u4e2d\u662f\u5426\u5b58\u5728\u5339\u914d\uff0c\u8bb0\u5f55\u90fd\u5c06\u8f93\u51fa\u5230\u201csuccess\u201d\u8fde\u7ebf
result-contents.displayName=\u8bb0\u5f55\u7ed3\u679c\u5185\u5bb9
result-contents.description=\u5f53\u68c0\u7d22\u7684\u7ed3\u679c\u662f\u8bb0\u5f55\u65f6\uff0c\u8be5\u5c5e\u6027\u786e\u5b9a\u662f\u5426\u5728\u914d\u7f6e\u7684\u8bb0\u5f55\u4e2d\u63d2\u5165\u6574\u4e2a\u68c0\u7d22\u8bb0\u5f55\u672c\u8eab\uff0c\u6216\u8005\u662f\u5426\u5c06\u5728\u914d\u7f6e\u7684\u8bb0\u5f55\u4e2d\u63d2\u5165\u68c0\u7d22\u8bb0\u5f55\u7684\u6240\u6709\u5b57\u6bb5\u3002
__AllowableValue.result-contents.insert-entire-record.displayName=\u63d2\u5165\u6574\u6761\u8bb0\u5f55
__AllowableValue.result-contents.insert-entire-record.description=\u68c0\u7d22\u670d\u52a1\u68c0\u7d22\u5230\u7684\u6574\u4e2a\u8bb0\u5f55\u5c06\u76f4\u63a5\u63d2\u5165\u5230\u76ee\u6807\u8bb0\u5f55\u4e2d\u3002
__AllowableValue.result-contents.record-fields.displayName=\u63d2\u5165\u8bb0\u5f55\u5c5e\u6027
__AllowableValue.result-contents.record-fields.description=\u68c0\u7d22\u670d\u52a1\u68c0\u7d22\u5230\u7684\u8bb0\u5f55\u7684\u6240\u6709\u5b57\u6bb5\u5c06\u63d2\u5165\u5230\u76ee\u6807\u8bb0\u5f55\u4e2d\u3002
Value_To_Lookup.description=RecordPath\u6307\u5411\u68c0\u7d22\u670d\u52a1\u5c06\u8981\u67e5\u627e\u7684\u8303\u56f4
__Relationship.success.description=\u9664\u975e\u53d1\u751f\u9519\u8bef\uff0c\u5426\u5219\u6240\u6709\u8bb0\u5f55\u5c06\u88ab\u8f93\u51fa\u5230\u6b64\u8fde\u7ebf
__Relationship.failure.description=\u5982\u679c\u65e0\u6cd5\u5c06\u6570\u636e\u6d41\u4ece\u914d\u7f6e\u7684\u8f93\u5165\u683c\u5f0f\u8f6c\u6362\u4e3a\u76f8\u5e94\u7684\u8f93\u51fa\u683c\u5f0f\uff0c\u5219\u539f\u59cb\u8f93\u5165\u6570\u636e\u6d41\u5c06\u88ab\u8f93\u51fa\u5230\u6b64\u8fde\u7ebf
__WritesAttribute.mime.type.description=\u5c06mime.type\u5c5e\u6027\u8bbe\u7f6e\u4e3a\u5199\u5165\u670d\u52a1\u6307\u5b9a\u7684MIME\u7c7b\u578b
__WritesAttribute.record.count.description=\u8f93\u51fa\u6570\u636e\u6d41\u7684\u8bb0\u5f55\u6570
