__CapabilityDescription=\u6267\u884cUPDATE\u6216INSERT\u7684SQL\u8bed\u53e5\u3002\u8f93\u5165\u6570\u636e\u6d41\u7684\u5185\u5bb9\u5c06\u88ab\u4f5c\u4e3aSQL\u8bed\u53e5\u6267\u884c\u3002SQL\u8bed\u53e5\u53ef\u80fd\u5e26\u6709\u95ee\u53f7\u5b57\u7b26'?'\u6765\u6a21\u7cca\u6307\u5b9a\u53c2\u6570\uff0c\u6b64\u65f6\uff0c\u8f93\u5165\u6570\u636e\u6d41\u4e0a\u5fc5\u987b\u63d0\u4f9b\u76f8\u5173\u53c2\u6570\u662f\u5c5e\u6027\uff0c\u4e14\u540d\u5b57\u4e3a'sql.args.N.type'\u548c'sql.args.N.value'\uff0c\u5176\u4e2dN\u8868\u793a\u53c2\u6570\u4f4d\u7f6e\u7d22\u5f15\u5e8f\u5217\u3002 'sql.args.N.type'\u662fJDBC\u6570\u636e\u5e93\u7c7b\u578b\u7684\u6570\u5b57\u503c\u3002\u8f93\u5165\u6570\u636e\u6d41\u7684\u5185\u5bb9\u8981\u6c42\u662fUTF-8\u7f16\u7801\u683c\u5f0f\u3002
__Tags=sql, put, rdbms, database, update, insert, relational, \u6570\u636e\u5e93, \u66f4\u65b0, \u63d2\u5165
JDBC_Connection_Pool.displayName=JDBC\u6570\u636e\u5e93\u8fde\u63a5\u6c60
JDBC_Connection_Pool.description=\u7528\u4e8e\u521b\u5efa\u6570\u636e\u5e93\u8fde\u63a5\u6c60\u7684\u670d\u52a1
putsql-sql-statement.displayName=SQL\u8bed\u53e5
putsql-sql-statement.description=\u7528\u4e8e\u6267\u884c\u7684SQL\u8bed\u53e5\uff0c\u8be5\u53c2\u6570\u53ef\u4e3a\u7a7a\uff0c\u666e\u901a\u5b57\u7b26\u4e32\u6216\u5e26\u53d8\u91cf\u8868\u8fbe\u5f0f\u7684\u5b57\u7b26\u4e32\u3002\u5982\u679c\u6307\u5b9a\u4e86\u6b64\u5c5e\u6027\uff0c\u5219\u65e0\u8bba\u8f93\u5165\u6570\u636e\u6d41\u7684\u5185\u5bb9\u5982\u4f55\uff0c\u90fd\u5c06\u4f7f\u7528\u5b83\u3002 \u5982\u679c\u6b64\u5c5e\u6027\u4e3a\u7a7a\uff0c\u5219\u8f93\u5165\u6570\u636e\u6d41\u7684\u5185\u5bb9\u5fc5\u987b\u662f\u6709\u6548\u7684SQL\u8bed\u53e5\uff0c\u5e76\u5c06\u88ab\u6570\u636e\u5e93\u6267\u884c\u3002
Support_Fragmented_Transactions.displayName=\u652f\u6301\u5206\u6bb5\u4e8b\u52a1
Support_Fragmented_Transactions.description=\u5f53\u8f93\u5165\u6570\u636e\u6d41\u88ab\u5904\u7406\u65f6\uff0c\u5c06\u68c0\u67e5\u6570\u636e\u6d41\u4e0a\u7684\u5c5e\u6027'fragment.identifier'\u548c'fragment.count'\u503c\u3002\u5982\u679c'fragment.count'\u503c\u5927\u4e8e1\uff0c\u7ec4\u4ef6\u5c06\u4e0d\u5904\u7406\u4efb\u4f55\u8f93\u5165\u6570\u636e\u6d41\u76f4\u5230'fragment.identifier'\u6240\u6307\u5b9a\u7684\u6240\u6709\u6570\u636e\u6d41\u90fd\u53ef\u7528\u3002\u4e5f\u5c31\u662f\u8bf4\uff0c\u6240\u6709\u76f8\u540cid\u7684\u6570\u636e\u6d41\u5c06\u4f5c\u4e3a\u6570\u636e\u5e93\u7684\u5355\u4e00\u4e8b\u52a1\u4e00\u5e76\u6309'fragment.index'\u5e8f\u53f7\u6309\u5e8f\u5904\u7406\u3002\u8fd9\u5c31\u662f\u652f\u6301\u6570\u636e\u5e93\u7684SQL\u539f\u5b50\u6027\u64cd\u4f5c\u3002\u5982\u679c\u4e0d\u652f\u6301\uff0c\u5c06\u5ffd\u7565\u8fd9\u4e9b\u5c5e\u6027\u8bbe\u7f6e\u4e14\u66f4\u65b0\u5c06\u5206\u522b\u72ec\u7acb\u7684\u6267\u884c
__AllowableValue.Support_Fragmented_Transactions.false.displayName=\u4e0d\u652f\u6301
__AllowableValue.Support_Fragmented_Transactions.true.displayName=\u652f\u6301
Transaction_Timeout.displayName=\u4e8b\u52a1\u8d85\u65f6
Transaction_Timeout.description=\u5982\u679c\u652f\u6301\u5206\u6bb5\u4e8b\u52a1\uff0c\u6307\u5b9a\u9700\u7b49\u5f85\u591a\u957f\u65f6\u95f4\u6765\u5904\u7406\u6240\u6709\u8f93\u5165\u6570\u636e\u6d41\uff0c\u5426\u5219\u5c06\u901a\u8fc7'failure'\u8fde\u7ebf\u8f93\u51fa
Batch_Size.displayName=\u5206\u6279\u6570\u91cf
Batch_Size.description=\u5728\u4e00\u4e2a\u4e8b\u52a1\u4e2d\u653e\u5165\u6570\u636e\u5e93\u7684\u8f93\u5165\u6570\u636e\u6d41\u7684\u6700\u4f18\u6570\u91cf
Obtain_Generated_Keys.displayName=\u83b7\u5f97\u751f\u6210\u952e
Obtain_Generated_Keys.description=\u662f\u5426\u8fd4\u56de\u6570\u636e\u5e93\u81ea\u52a8\u751f\u6210\u7684\u952e\uff0c\u5e76\u5199\u5165\u6570\u636e\u6d41\u7684\u5c5e\u6027sql.generate.key. \u8fd9\u53ef\u80fd\u5bfc\u81f4\u6027\u80fd\u7a0d\u5fae\u4f4e\u4e0b\u4e14\u5e76\u4e0d\u662f\u6240\u6709\u6570\u636e\u5e93\u90fd\u652f\u6301\u3002
__AllowableValue.Obtain_Generated_Keys.false.displayName=\u5426
__AllowableValue.Obtain_Generated_Keys.true.displayName=\u662f
rollback-on-failure.displayName=\u5931\u8d25\u56de\u6eda
rollback-on-failure.description=\u6307\u5b9a\u5982\u4f55\u5904\u7406\u6267\u884c\u9519\u8bef\u60c5\u51b5\uff0c\u9ed8\u8ba4\u60c5\u51b5\u4e0b\uff08'\u5426'\uff09\uff0c\u5982\u679c\u5728\u5904\u7406\u6570\u636e\u91cf\u65f6\u6709\u9519\u8bef\u53d1\u751f\uff0c\u90a3\u4e48\u6570\u636e\u6d41\u5c06\u6839\u636e\u9519\u8bef\u7c7b\u578b\u6765\u51b3\u5b9a\u901a\u8fc7'failure'\u6216\u8005'retry'\u8fde\u7ebf\u8f93\u51fa\uff0c\u5e76\u4f7f\u5f97\u7ec4\u4ef6\u53ef\u4ee5\u7ee7\u7eed\u4e0b\u4e00\u4e2a\u6570\u636e\u6d41\u5904\u7406\u3002\u53cd\u4e4b\uff0c\u5982\u679c\u60f3\u8981\u56de\u6eda\u5f53\u524d\u5904\u7406\u7684\u6570\u636e\u6d41\u5e76\u7acb\u5373\u505c\u6b62\u5176\u4ed6\u5904\u7406\uff0c\u5219\u53ef\u5c06\u8be5\u9009\u9879\u8bbe\u7f6e\u4e3a'\u662f'\u3002\u5e76\u4e14\u5931\u8d25\u7684\u6570\u636e\u6d41\u5c06\u4fdd\u7559\u5728\u8f93\u5165\u8fde\u7ebf\u4e0a\u800c\u4e0d\u4f1a\u542f\u7528\u60e9\u7f5a\u6a21\u5f0f\uff0c\u76f4\u5230\u53ef\u7ee7\u7eed\u5904\u7406\u6210\u529f\u6216\u9009\u62e9\u5176\u4ed6\u65b9\u5f0f\u5904\u7406\u3002\u540c\u65f6\u9700\u8981\u6ce8\u610f\u975e\u5e38\u91cd\u8981\u7684\u4e00\u70b9\u5c31\u662f\u9002\u5f53\u52a0\u5927'\u7b49\u5f85\u65f6\u957f'\u8bbe\u7f6e\uff0c\u4ee5\u5e94\u5bf9\u91cd\u8bd5\u8fc7\u4e8e\u9891\u7e41\u7684\u60c5\u51b5\u3002
__AllowableValue.rollback-on-failure.false.displayName=\u4e0d\u56de\u6eda
__AllowableValue.rollback-on-failure.true.displayName=\u56de\u6eda
__Relationship.retry.description=\u5982\u679c\u6570\u636e\u5e93\u4e0d\u80fd\u66f4\u65b0\u4f46\u53ef\u901a\u8fc7\u518d\u6b21\u5c1d\u8bd5\u64cd\u4f5c\u53ef\u80fd\u6210\u529f\u65f6\uff0c\u6570\u636e\u6d41\u5c06\u901a\u8fc7\u6b64\u8fde\u7ebf\u8f93\u51fa
__Relationship.success.description=\u6210\u529f\u6267\u884cSQL\u8bed\u53e5\u540e\uff0c\u6570\u636e\u6d41\u901a\u8fc7\u6b64\u8fde\u7ebf\u8f93\u51fa
__Relationship.failure.description=\u5982\u679c\u6570\u636e\u5e93\u4e0d\u80fd\u66f4\u65b0\u5e76\u901a\u8fc7\u518d\u6b21\u5c1d\u8bd5\u64cd\u4f5c\u8fd8\u662f\u5931\u8d25\uff0c\u4f8b\u5982\u65e0\u6548\u67e5\u8be2\u6216\u8fdd\u53cdSQL\u7ea6\u675f\u89c4\u8303\uff0c\u6570\u636e\u6d41\u5c06\u901a\u8fc7\u6b64\u8fde\u7ebf\u8f93\u51fa
__ReadsAttribute.fragment.identifier.description=\u5982\u679c\u652f\u6301\u5206\u6bb5\u4e8b\u52a1\uff0c\u8be5\u5c5e\u6027\u7528\u4e8e\u51b3\u5b9a\u662f\u5426\u5c06\u4e24\u4e2a\u6570\u636e\u6d41\u5f52\u5230\u76f8\u540c\u7684\u4e8b\u52a1\u4e2d
__ReadsAttribute.fragment.count.description=\u5982\u679c\u652f\u6301\u5206\u6bb5\u4e8b\u52a1\uff0c\u8be5\u5c5e\u6027\u7528\u4e8e\u51b3\u5b9a\u591a\u5c11\u4e2a\u8f93\u5165\u6570\u636e\u6d41\u4f5c\u4e3a\u4e00\u4e2a\u4e8b\u52a1\u5904\u7406
__ReadsAttribute.fragment.index.description=\u5982\u679c\u652f\u6301\u5206\u6bb5\u4e8b\u52a1\uff0c\u8be5\u5c5e\u6027\u7528\u4e8e\u51b3\u5b9a\u4e8b\u52a1\u5904\u7406\u7684\u5148\u540e\u987a\u5e8f
__ReadsAttribute.sql.args.N.type.description=\u7528\u4e8e\u8f93\u5165\u6570\u636e\u6d41\u7684\u53c2\u6570\u5316\u7684SQL\u8bed\u53e5\u3002\u6bcf\u4e2a\u53c2\u6570\u7c7b\u578b\u662f\u5bf9\u5e94\u4e00\u4e2aJDBC\u6570\u636e\u5e93\u7c7b\u578b\u7684\u6574\u6570\u503c
__ReadsAttribute.sql.args.N.value.description=\u7528\u4e8e\u8f93\u5165\u6570\u636e\u6d41\u7684\u53c2\u6570\u5316\u7684SQL\u8bed\u53e5\u3002\u53c2\u6570\u503c\u901a\u8fc7\u8bbe\u7f6e\u8bf8\u5982 sql.args.1.value, sql.args.2.value, sql.args.3.value,\u7b49\u7b49\u3002 sql.args.1.value\u53c2\u6570\u503c\u6240\u5bf9\u5e94\u7684\u7c7b\u662f\u901a\u8fc7sql.args.1.type\u5c5e\u6027\u6307\u5b9a
__ReadsAttribute.sql.args.N.format.description=\u7528\u4e8e\u8f93\u5165\u6570\u636e\u6d41\u7684\u53c2\u6570\u5316\u7684SQL\u8bed\u53e5\u7684\u53ef\u9009\u5c5e\u6027\uff0c\u4f46\u662f\u9ed8\u8ba4\u503c\u53ef\u80fd\u4e0d\u80fd\u9002\u5e94\u6570\u636e\u6d41\u6570\u636e\u3002\u5728\u4e00\u4e9b\u60c5\u51b5\u4e0b\uff0c\u9700\u8981\u7279\u6b8a\u6307\u5b9a\u6570\u636e\u683c\u5f0f\uff0c\u5f53\u524d\u53ef\u7528\u7c7b\u578b\u4e3a\u4e8c\u8fdb\u5236\u6570\u636e\u7c7b\u578b, \u65e5\u671f, \u65f6\u95f4\u548c\u65f6\u95f4\u6233. \u5176\u4e2d\u4e8c\u8fdb\u5236\u7c7b\u578b (\u9ed8\u8ba4\u4e3a'ascii'). \u8be5\u683c\u5f0f\u53ef\u4f7f\u7528Avro\u683c\u5f0f\u3002 base64\u5b57\u7b26\u4e32\u53ef\u7528\u4e8e\u89e3\u7801\u4e3a\u5b57\u8282\u6570\uff0c hex 16\u8fdb\u5236\u5b57\u7b26\u4e32\u662f\u6240\u6709\u5b57\u7b26\u4e32\u5927\u5199\uff0c\u4e14\u6ca1\u6709'0x'\u5f00\u5934\u3002 Dates/Times/Timestamps \u7684 Date, Time \u4ee5\u53ca Timestamp \u683c\u5f0f\u652f\u6301\u81ea\u5b9a\u4e49\u7684 ('yyyy-MM-dd','ISO_OFFSET_DATE_TIME')\uff0c\u5e76\u4e8ejava.time.format.DateTimeFormatter \u5bf9\u5e94\u3002\u5982\u679c\u4e0d\u6307\u5b9a\uff0c\u5219\u4e3a\u957f\u6574\u578b\u503c\u7684\u6beb\u79d2\u6570\uff0c\u6216\u8005\u4e3a\u5b57\u7b26\u4e32'yyyy-MM-dd'\u683c\u5f0f\u7684Date, 'HH\:mm\:ss.SSS'\u683c\u5f0f\u7684Time (\u4e00\u4e9b\u6570\u636e\u5e93\u4e0d\u652f\u6301\u6beb\u79d2\u6570\u7684\u65e5\u671f\uff0c\u6bd4\u5982 Derby \u6216 MySQL), 'yyyy-MM-dd HH\:mm\:ss.SSS' \u683c\u5f0f\u7684Timestamp
__WritesAttribute.sql.generated.key.description=\u5982\u679c\u6570\u636e\u5e93INSERT\u64cd\u4f5c\u751f\u6210\u4e86\u952e\uff0c\u5e76\u4e14\u5141\u8bb8<\u83b7\u5f97\u751f\u6210\u952e>\uff0c\u8be5\u5c5e\u6027\u5c06\u88ab\u6dfb\u52a0\u5230\u8f93\u51fa\u6d41\u3002\u8be5\u529f\u80fd\u53ef\u80fd\u4e0d\u88ab\u6240\u6709\u6570\u636e\u5e93\u652f\u6301\u3002
