__CapabilityDescription=\u76f4\u5230Notify\u7ec4\u4ef6\u63d0\u4f9b\u5339\u914d\u7684\u67d0\u4e2a\u76f8\u5e94\u91ca\u653e\u4fe1\u53f7\uff0c\u5c06\u539f\u8f93\u5165\u7684\u6570\u636e\u6d41\u8f93\u51fa\u5230"wait"\u8fde\u7ebf\u4e0a\u3002\u5f53\u8bc6\u522b\u51fa\u4e00\u4e2a\u5339\u914d\u7684\u91ca\u653e\u4fe1\u53f7\u65f6\uff0c\u7b49\u5f85\u7684\u6570\u636e\u6d41\u5c06\u88ab\u8f93\u51fa\u5230\u201csuccess\u201d\u8fde\u7ebf\uff0c\u5e76\u4e14\u4f1a\u590d\u5236Notify\u7ec4\u4ef6\u751f\u6210\u91ca\u653e\u4fe1\u53f7\u7684\u6570\u636e\u6d41\u4e2d\u7684\u5c5e\u6027\uff0c\u7136\u540e\u4ece\u7f13\u5b58\u4e2d\u5220\u9664\u91ca\u653e\u4fe1\u53f7\u3002\u5982\u679c\u7b49\u5f85\u7684\u6d41\u6587\u4ef6\u8d85\u8fc7\u4e86\u8fc7\u671f\u65f6\u95f4\uff0c\u6570\u636e\u6d41\u5219\u8f93\u51fa\u5230\u201cexpired\u201d\u8fde\u7ebf\u3002\u5982\u679c\u9700\u8981\u7b49\u5f85\u591a\u4e2a\u4fe1\u53f7\uff0c\u8bf7\u901a\u8fc7\u201c\u76ee\u6807\u4fe1\u53f7\u8ba1\u6570\u201d\u5c5e\u6027\u6307\u5b9a\u6240\u9700\u7684\u4fe1\u53f7\u6570\u91cf\u3002\u5bf9\u4e8e\u5c06\u6e90\u6d41\u6587\u4ef6\u5206\u5272\u4e3a\u591a\u4e2a\u7247\u6bb5(\u5982SplitText)\u7684\u7ec4\u4ef6\u6765\u8bf4\uff0c\u8fd9\u7279\u522b\u6709\u7528\u3002\u4e3a\u4e86\u7b49\u5f85\u6240\u6709\u7247\u6bb5\u90fd\u88ab\u5904\u7406\uff0c\u53ef\u4ee5\u5c06\u201coriginal\u201d\u8fde\u7ebf\u8fde\u63a5\u5230Wait\u7ec4\u4ef6\uff0c\u5c06\u201csplit\u201d\u8fde\u7ebf\u8fde\u63a5\u5230\u76f8\u5e94\u7684Notify\u7ec4\u4ef6\u3002\u914d\u7f6eNotify\u548cWait\u7ec4\u4ef6\u7684"\u91ca\u653e\u4fe1\u53f7\u6807\u8bc6\u7b26(Release Signal Identifier)"\u7684\u503c\u4e3a'${fragment.identifier}'\uff0c\u6307\u5b9aWait\u7ec4\u4ef6"\u76ee\u6807\u4fe1\u53f7\u503c"\u5c5e\u6027\u7684\u503c\u4e3a${fragment.count}'\u3002\u5f53\u4f7f\u7528\u201cwait\u201d\u8fde\u7ebf\u5faa\u73af\u65f6\uff0c\u5efa\u8bae\u4f7f\u7528\u4f18\u5148\u6392\u5e8f(\u4f8b\u5982\uff0c\u5148\u5165\u5148\u51fa)\u3002
__Tags=map, cache, wait, hold, distributed, signal, release, \u4fe1\u53f7, \u7b49\u5f85
release-signal-id.displayName=\u4fe1\u53f7\u91ca\u653e\u6807\u8bc6\u7b26
release-signal-id.description=\u4e00\u4e2a\u503c\u6216\u8005\u6839\u636e\u5c5e\u6027\u8868\u8fbe\u5f0f\u8ba1\u7b97\u6570\u636e\u6d41\u7684\u7ed3\u679c\u503c\uff0c\u8be5\u503c\u7528\u6765\u786e\u5b9a\u91ca\u653e\u4fe1\u53f7\u7f13\u5b58\u952e\u503c
target-signal-count.displayName=\u76ee\u6807\u4fe1\u53f7\u8ba1\u6570
target-signal-count.description=\u4e00\u4e2a\u503c\u6216\u8005\u6839\u636e\u5c5e\u6027\u8868\u8fbe\u5f0f\u8ba1\u7b97\u6570\u636e\u6d41\u7684\u7ed3\u679c\u503c\uff0c\u8be5\u503c\u7528\u6765\u786e\u5b9a\u76ee\u6807\u4fe1\u53f7\u503c\u7684\u5927\u5c0f\u3002\u8be5\u7ec4\u4ef6\u68c0\u67e5\u4fe1\u53f7\u8ba1\u6570\u662f\u5426\u8fbe\u5230\u8fd9\u4e2a\u6570\u5b57\u3002\u5982\u679c\u6307\u5b9a\u4e86\u4fe1\u53f7\u8ba1\u6570\u5668\u540d\u79f0\uff0c\u8be5\u7ec4\u4ef6\u5c06\u68c0\u67e5\u7279\u5b9a\u7684\u8ba1\u6570\u5668\uff0c\u5426\u5219\u5c06\u68c0\u67e5\u4fe1\u53f7\u7684\u603b\u6570\u3002
signal-counter-name.displayName=\u4fe1\u53f7\u8ba1\u6570\u5668\u540d\u79f0
signal-counter-name.description=\u4e00\u4e2a\u503c\u6216\u8005\u6839\u636e\u5c5e\u6027\u8868\u8fbe\u5f0f\u8ba1\u7b97\u6570\u636e\u6d41\u7684\u7ed3\u679c\u503c\uff0c\u8be5\u503c\u7528\u6765\u786e\u5b9a\u4fe1\u53f7\u8ba1\u6570\u5668\u540d\u79f0\u3002\u5982\u679c\u6ca1\u6709\u6307\u5b9a\uff0c\u8be5\u7ec4\u4ef6\u5c06\u68c0\u67e5\u4fe1\u53f7\u7684\u603b\u6570\u3002
wait-buffer-count.displayName=\u7b49\u5f85\u7f13\u5b58\u8ba1\u6570
wait-buffer-count.description=\u6307\u5b9a\u68c0\u67e5\u8f93\u5165\u6d41\u6587\u4ef6\u662f\u5426\u53ef\u4ee5\u5411\u524d\u6d41\u52a8\u65f6\uff0c\u53ef\u4ee5\u7f13\u5b58\u7684\u6d41\u6587\u4ef6\u7684\u6700\u5927\u6570\u91cf\u3002\u66f4\u591a\u7684\u7f13\u5b58\u91cf\u53ef\u4ee5\u63d0\u4f9b\u66f4\u597d\u7684\u6027\u80fd\uff0c\u56e0\u4e3a\u5b83\u4f1a\u6309\u4fe1\u53f7\u6807\u8bc6\u7b26\u5206\u7ec4\u4fe1\u53f7\uff0c\u4ee5\u51cf\u5c11\u8ddf\u7f13\u5b58\u670d\u52a1\u7684\u4ea4\u4e92\u6b21\u6570\u3002\u5728\u7ec4\u4ef6\u6267\u884c\u65f6\u53ea\u80fd\u5904\u7406\u4e00\u4e2a\u4fe1\u53f7\u6807\u8bc6\u7b26\u3002
releasable-flowfile-count.displayName=\u53ef\u91ca\u653e\u7684\u6570\u636e\u6d41\u8ba1\u6570
releasable-flowfile-count.description=\u4e00\u4e2a\u503c\u6216\u8005\u6839\u636e\u5c5e\u6027\u8868\u8fbe\u5f0f\u8ba1\u7b97\u6570\u636e\u6d41\u7684\u7ed3\u679c\u503c\uff0c\u8be5\u503c\u7528\u6765\u786e\u5b9a\u53ef\u91ca\u653e\u7684\u6d41\u6587\u4ef6\u4e2a\u6570\u3002\u8fd9\u6307\u5b9a\u5f53\u76ee\u6807\u8ba1\u6570\u503c\u8fbe\u5230\u4e86\u76ee\u6807\u4fe1\u53f7\u8ba1\u6570\u65f6\uff0c\u53ef\u4ee5\u91ca\u653e\u591a\u5c11\u4e2a\u6d41\u6587\u4ef6\u30020\u6709\u4e00\u4e2a\u7279\u6b8a\u7684\u542b\u4e49\uff0c\u5f53\u4fe1\u53f7\u6570\u4e0e\u76ee\u6807\u5339\u914d\uff0c\u4f1a\u91ca\u653e\u6240\u6709\u7684\u6d41\u6587\u4ef6\u3002
expiration-duration.displayName=\u8fc7\u671f\u65f6\u95f4
expiration-duration.description=\u6307\u5b9a\u591a\u957f\u65f6\u95f4\u540e\uff0c\u7b49\u5f85\u4e2d\u7684\u6570\u636e\u6d41\u4f1a\u8f93\u51fa\u5230\u201cexpired\u201d\u8fde\u7ebf\u3002
distributed-cache-service.displayName=\u7f13\u5b58\u670d\u52a1
distributed-cache-service.description=\u7528\u6765\u68c0\u67e5\u534f\u540c\u7ec4\u4ef6Notify\u91ca\u653e\u4fe1\u53f7\u7684\u63a7\u5236\u5668\u670d\u52a1
attribute-copy-mode.displayName=\u62f7\u8d1d\u5c5e\u6027\u6a21\u5f0f
attribute-copy-mode.description=\u6307\u5b9a\u5982\u4f55\u5904\u7406\u4ece\u8f93\u5165Notify\u7ec4\u4ef6\u7684\u6570\u636e\u6d41\u4e2d\u590d\u5236\u7684\u5c5e\u6027
__AllowableValue.attribute-copy-mode.keeporiginal.displayName=\u4fdd\u6301\u539f\u59cb
__AllowableValue.attribute-copy-mode.keeporiginal.description=\u91ca\u653e\u7684\u6570\u636e\u6d41\u4e0a\u7684\u5c5e\u6027\u4e0d\u4f1a\u88ab\u590d\u5236\u7684\u7f13\u5b58\u5c5e\u6027\u8986\u76d6\u3002
__AllowableValue.attribute-copy-mode.replace.displayName=\u66ff\u6362\u5df2\u5b58\u5728
__AllowableValue.attribute-copy-mode.replace.description=\u5f53\u7f13\u5b58\u7684\u5c5e\u6027\u88ab\u590d\u5236\u5230\u91ca\u653e\u7684\u6570\u636e\u6d41\u4e0a\u65f6\uff0c\u5b83\u4eec\u4f1a\u66ff\u6362\u4efb\u4f55\u76f8\u540c\u7684\u5c5e\u6027\u3002
wait-mode.displayName=\u7b49\u5f85\u6a21\u5f0f
wait-mode.description=\u6307\u5b9a\u5f53\u6d41\u6587\u4ef6\u7b49\u5f85\u901a\u77e5\u4fe1\u53f7\u65f6\u8be5\u5982\u4f55\u5904\u7406
__AllowableValue.wait-mode.keep.displayName=\u4fdd\u7559\u8f93\u5165\u8fde\u7ebf
__AllowableValue.wait-mode.keep.description=\u5f53\u91ca\u653e\u4fe1\u53f7\u8fd8\u6ca1\u6709\u901a\u77e5\u65f6\uff0c\u5c06\u6570\u636e\u6d41\u4f20\u9001\u5230\u5176\u6765\u6e90\u7684\u4e0a\u6e38\u8fde\u63a5\u4e2d\u3002\u8fd9\u79cd\u6a21\u5f0f\u80fd\u4fdd\u6301\u4e0a\u6e38\u8fde\u63a5\u662f\u6ee1\u7684\uff0c\u8fd9\u6837\u4e0a\u6e38\u6e90\u7ec4\u4ef6\u5c31\u4f1a\u7531\u4e8e\u80cc\u538b\u673a\u5236\u7684\u5b58\u5728\u800c\u4e0d\u4f1a\u88ab\u8c03\u5ea6\u8fd0\u884c\uff0c\u5e76\u9650\u5236\u8f93\u5165\u7684\u6d41\u6587\u4ef6\u6570\u76ee\u3002
__AllowableValue.wait-mode.wait.displayName=\u8f93\u51fa\u5230wait\u8fde\u7ebf
__AllowableValue.wait-mode.wait.description=\u5f53\u91ca\u653e\u4fe1\u53f7\u8fd8\u6ca1\u6709\u901a\u77e5\u65f6\uff0c\u5c06\u6570\u636e\u6d41\u8f93\u51fa\u5230\u201cwait\u201d\u8fde\u7ebf\u3002\u5c06\u6570\u636e\u6d41\u8f93\u51fa\u5230wait\u8fde\u7ebf\uff0c\u8fd9\u79cd\u6a21\u5f0f\u5141\u8bb8\u628a\u8f93\u5165\u6d41\u6587\u4ef6\u52a0\u5165\u961f\u5217\u7f13\u5b58\u8d77\u6765\uff0c\u5efa\u8bae\u5728\u201cwait\u201d\u8fde\u7ebf\u4e0a\u8bbe\u7f6e\u4e00\u4e2a\u4f18\u5148\u6392\u5e8f\u5668(\u4f8b\u5982\uff0c\u5148\u5165\u5148\u51fa)\u3002
__Relationship.expired.description=\u7b49\u5f85\u8fc7\u671f\u8d85\u8fc7\u540e\uff0c\u6570\u636e\u6d41\u5c06\u8f93\u51fa\u5230\u6b64\u8fde\u7ebf
__Relationship.success.description=\u4e0e\u7f13\u5b58\u4e2d\u91ca\u653e\u4fe1\u53f7\u76f8\u5339\u914d\u540e\uff0c\u6570\u636e\u6d41\u8f93\u51fa\u5230\u6b64\u8fde\u7ebf
__Relationship.wait.description=\u6ca1\u6709\u4e0e\u7f13\u5b58\u4e2d\u91ca\u653e\u4fe1\u53f7\u76f8\u5339\u914d\uff0c\u6570\u636e\u6d41\u8f93\u51fa\u5230\u6b64\u8fde\u7ebf
__Relationship.failure.description=\u5f53\u7f13\u5b58\u4e0d\u53ef\u7528\uff0c\u6216\u91ca\u653e\u4fe1\u53f7\u6807\u8bc6\u7b26\u7684\u503c\u4e3anull\u6216\u7a7a\u65f6\uff0c\u6570\u636e\u6d41\u8f93\u51fa\u5230\u6b64\u8fde\u7ebf\u3002
__WritesAttribute.wait.start.timestamp.description=\u6240\u6709\u7684\u6570\u636e\u6d41\u90fd\u6709\u4e00\u4e2a'wait.start.timestamp'\u5c5e\u6027\uff0c\u5b83\u8bbe\u7f6e\u4e86\u6d41\u6587\u4ef6\u7b2c\u4e00\u6b21\u8fdb\u5165\u6b64\u7ec4\u4ef6\u65f6\u7684\u521d\u59cb\u65f6\u95f4\u6233\u3002\u8fd9\u7528\u4e8e\u786e\u5b9aF\u6570\u636e\u6d41\u7684\u8fc7\u671f\u65f6\u95f4\u3002
__WritesAttribute.wait.counter.counterName.description=\u5982\u679c\u7ec4\u4ef6\u8fd0\u884c\u65f6\u5b58\u5728\u4e00\u4e2a\u4fe1\u53f7\uff0c\u5219\u590d\u5236\u4fe1\u53f7\u4e2d\u7684\u6bcf\u4e2a\u8ba1\u6570\u503c\u3002
