__CapabilityDescription=\u5f3a\u5236\u5c06\u76f8\u540c\u6570\u636e\u7ec4\u7684\u6570\u636e\u6d41\u6309\u7167\u4e00\u5b9a\u7684\u671f\u671b\u987a\u5e8f\u3002\u5c3d\u7ba1PriorityAttributePrioritizer\u53ef\u4ee5\u88ab\u7528\u6765\u786e\u4fdd\u6570\u636e\u6d41\u8fde\u7ebf\u7684\u5904\u7406\u7ea7\u522b\u987a\u5e8f\u3002\u800c\u4f9d\u8d56\u4e8e\u9519\u8bef\u5904\u7406\u3001\u5206\u652f\u4ee5\u53ca\u6d41\u7a0b\u8bbe\u8ba1\uff0c\u4e5f\u53ef\u80fd\u5bfc\u81f4\u6570\u636e\u6d41\u987a\u5e8f\u95ee\u9898\u3002\u8be5\u7ec4\u4ef6\u53ef\u7528\u4e8e\u5f3a\u5236\u539f\u59cb\u6570\u636e\u6d41\u7684\u987a\u5e8f\u3002 [\u91cd\u8981] \u4e3a\u4e86\u8ba9\u8be5\u7ec4\u4ef6\u751f\u6548\uff0c FirstInFirstOutPrioritizer \u5e94\u8be5\u5728\u6bcf\u4e2a\u4e0b\u6e38\u8fde\u7ebf\u4e2d\u4f7f\u7528\uff0c\u76f4\u5230\u6570\u636e\u6d41\u7684\u7269\u7406\u987a\u5e8f\u901a\u8fc7\u8bf8\u5982MergeContent\u7684\u7ec4\u4ef6\u6765\u5f97\u4ee5\u56fa\u5b9a
__Tags=sort, order, \u6392\u5e8f, \u987a\u5e8f
group-id.displayName=\u7ec4\u6807\u8bc6
group-id.description=\u53ef\u4ee5\u6709\u591a\u4e2a\u6392\u5e8f\u7ec4\u3002 \u8be5\u53c2\u6570\u7528\u4e8e\u51b3\u5b9a\u6570\u636e\u6d41\u5c5e\u4e8e\u54ea\u4e2a\u7ec4\u3002\u8be5\u53c2\u6570\u5c06\u88ab\u6bcf\u4e2a\u8f93\u5165\u6570\u636e\u6d41\u8ba1\u7b97\u3002 \u5982\u679c\u8ba1\u7b97\u7ed3\u679c\u4e3a\u7a7a\uff0c\u5219\u4f1a\u8def\u7531\u5230\u5931\u8d25\u8fde\u7ebf
order-attribute.displayName=\u6b21\u5e8f\u5c5e\u6027
order-attribute.description=\u6307\u5b9a\u7528\u4e8e\u5f3a\u5236\u6570\u636e\u6d41\u5206\u7ec4\u6392\u5e8f\u7684\u5c5e\u6027\u540d\u3002\u5982\u679c\u8f93\u5165\u6570\u636e\u6d41\u6ca1\u6709\u6b64\u5c5e\u6027\uff0c\u6216\u503c\u4e0d\u662f\u6574\u6570\uff0c\u5219\u8def\u7531\u5230\u5931\u8d25\u8fde\u7ebf
initial-order.displayName=\u521d\u59cb\u6b21\u5e8f
initial-order.description=\u5f53\u7ec4\u7684\u7b2c\u4e00\u4e2a\u6570\u636e\u6d41\u5230\u8fbe\u65f6\uff0c\u5c06\u8ba1\u7b97\u521d\u59cb\u76ee\u6807\u6b21\u5e8f\u5e76\u5b58\u50a8\u5176\u72b6\u6001\u3002\u4e4b\u540e\uff0c\u7ec4\u4ef6\u5c06\u5f00\u59cb\u8ddf\u8e2a\u76ee\u6807\u6b21\u5e8f\uff0c\u5e76\u5b58\u50a8\u5176\u72b6\u6001\u3002\u5982\u679c\u8be5\u53c2\u6570\u4e3a\u8868\u8fbe\u5f0f\uff0c\u5f53\u8ba1\u7b97\u7ed3\u679c\u4e0d\u4e3a\u6574\u6570\uff0c\u5219\u4f1a\u8def\u7531\u5230\u5931\u8d25\u8fde\u7ebf\uff0c\u5e76\u4e14\u521d\u59cb\u6b21\u5e8f\u5c06\u4fdd\u6301\u672a\u77e5\uff0c\u76f4\u5230\u6709\u5176\u4ed6\u6570\u636e\u6d41\u63d0\u4f9b\u6709\u6548\u7684\u521d\u59cb\u6b21\u5e8f\u3002
maximum-order.displayName=\u6700\u5927\u6b21\u5e8f
maximum-order.description=\u5982\u679c\u6307\u5b9a\uff0c\u4efb\u4f55\u5927\u4e8e\u8be5\u6b21\u5e8f\u7684\u6570\u636e\u6d41\u5c06\u8f93\u51fa\u5230\u5931\u8d25\u8fde\u7ebf\u3002\u5bf9\u4e8e\u7ed9\u5b9a\u7684\u7ec4\uff0c\u6b64\u5c5e\u6027\u53ea\u8ba1\u7b97\u4e00\u6b21\u3002\u5728\u8ba1\u7b97\u6700\u5927\u6b21\u5e8f\u4e4b\u540e\uff0c\u5b83\u5c06\u88ab\u6301\u4e45\u5316\u5728\u72b6\u6001\u7ba1\u7406\u4e2d\uff0c\u5e76\u7528\u4e8e\u5c5e\u4e8e\u540c\u4e00\u7ec4\u7684\u5176\u4ed6\u6570\u636e\u6d41\u3002 \u5982\u679c\u8be5\u53c2\u6570\u4e3a\u8868\u8fbe\u5f0f\uff0c\u5f53\u8ba1\u7b97\u7ed3\u679c\u4e0d\u4e3a\u6574\u6570\uff0c\u5219\u4f1a\u8def\u7531\u5230\u5931\u8d25\u8fde\u7ebf\uff0c\u5e76\u4e14\u6700\u5927\u6b21\u5e8f\u5c06\u4fdd\u6301\u672a\u77e5\uff0c\u76f4\u5230\u6709\u5176\u4ed6\u6570\u636e\u6d41\u63d0\u4f9b\u6709\u6548\u7684\u6700\u5927\u6b21\u5e8f\u3002
batch-count.displayName=\u6279\u91cf\u6570
batch-count.description=\u7ec4\u4ef6\u6267\u884c\u65f6\u53ef\u5904\u7406\u7684\u6700\u5927\u6570\u636e\u6d41\u6570\u3002
wait-timeout.displayName=\u7b49\u5f85\u8d85\u65f6
wait-timeout.description=\u6307\u5b9a\u7b49\u5f85\u6570\u636e\u6d41\u5c06\u88ab\u8def\u7531\u5230\u201covertook\u201d\u8fde\u7ebf\u7684\u65f6\u957f
inactive-timeout.displayName=\u4e0d\u6d3b\u52a8\u8d85\u65f6
inactive-timeout.description=\u6307\u5b9a\u975e\u6d3b\u52a8\u7ec4\u7684\u72b6\u6001\u4ece\u5b58\u50a8\u7684\u72b6\u6001\u4e2d\u6e05\u9664\u7684\u65f6\u957f\u3002\u5982\u679c\u5728\u6307\u5b9a\u7684\u65f6\u95f4\u5185\u6ca1\u6709\u770b\u5230\u4efb\u4f55\u65b0\u4f20\u5165\u6570\u636e\u6d41\uff0c\u5219\u7ec4\u88ab\u786e\u5b9a\u4e3a\u4e0d\u6d3b\u52a8\u3002\u8be5\u53c2\u6570\u5fc5\u987b\u5927\u4e8e\u300a\u7b49\u5f85\u8d85\u65f6\u300b \u3002\u5982\u679c\u6570\u636e\u6d41\u5728\u5176\u7ec4\u88ab\u6e05\u9664\u540e\u4ecd\u65e7\u5ef6\u8fdf\u5230\u8fbe\uff0c\u5b83\u5c06\u88ab\u89c6\u4e3a\u4e00\u4e2a\u5168\u65b0\u7684\u7ec4\uff0c\u4f46\u6c38\u8fdc\u4e0d\u4f1a\u4e0e\u539f\u6b21\u5e8f\u5339\u914d\uff0c\u56e0\u4e3a\u9884\u671f\u7684\u524d\u4e00\u4e2a\u6570\u636e\u6d41\u5df2\u7ecf\u4e0d\u5b58\u5728\u3002\u6570\u636e\u6d41\u6700\u7ec8\u5c06\u8d85\u65f6\u7b49\u5f85\u5e76\u8def\u7531\u5230\u201covertook\u201d\u8fde\u7ebf\u3002\u4e3a\u4e86\u907f\u514d\u8fd9\u79cd\u60c5\u51b5\uff0c\u7ec4\u72b6\u6001\u5e94\u8be5\u4fdd\u6301\u8db3\u591f\u957f\u7684\u65f6\u95f4\uff0c\u4f46\u662f\uff0c\u8f83\u77ed\u7684\u65f6\u957f\u5c06\u6709\u52a9\u4e8e\u518d\u6b21\u91cd\u7528\u76f8\u540c\u7684\u7ec4\u6807\u8bc6
__Relationship.overtook.description=\u7b49\u5f85\u524d\u9762\u7684\u6570\u636e\u6d41\u8d85\u8fc7\u300a\u7b49\u5f85\u8d85\u65f6\u300b\u5e76\u8d85\u8fc7\u8fd9\u4e9b\u6570\u636e\u6d41\uff0c\u5c06\u88ab\u8def\u7531\u5230\u6b64\u8fde\u7ebf
__Relationship.skipped.description=\u6570\u636e\u6d41\u7684\u6b21\u5e8f\u5c0f\u4e8e\u5f53\u524d\uff08\u610f\u5473\u7740\u592a\u665a\u5230\u8fbe\uff09\u5e76\u88ab\u5ffd\u7565\u7684\u6570\u636e\u6d41\u8def\u7531\u5230\u6b64\u8fde\u7ebf
__Relationship.success.description=\u5177\u6709\u5339\u914d\u6b21\u5e8f\u6570\u91cf\u7684\u6570\u636e\u6d41\u5c06\u8f93\u51fa\u5230\u6b64\u6210\u529f\u8fde\u7ebf
__Relationship.wait.description=\u6ca1\u6709\u5339\u914d\u6b21\u5e8f\u7684\u6570\u636e\u6d41\u5c06\u8f93\u51fa\u5230\u6b64\u8fde\u7ebf
__Relationship.failure.description=\u6570\u636e\u6d41\u6ca1\u6709\u76f8\u5e94\u5c5e\u6027\u6216\u8ba1\u7b97\u5931\u8d25\u5c06\u8f93\u51fa\u5230\u6b64\u5931\u8d25\u8fde\u7ebf
__WritesAttribute.EnforceOrder.startedAt.description=\u901a\u8fc7\u6b64\u7ec4\u4ef6\u7684\u6240\u6709\u6570\u636e\u6d41\u90fd\u5c06\u5177\u6709\u6b64\u5c5e\u6027\u3002\u8be5\u503c\u7528\u4e8e\u786e\u5b9a\u7b49\u5f85\u8d85\u65f6
__WritesAttribute.EnforceOrder.result.description=\u901a\u8fc7\u6b64\u7ec4\u4ef6\u7684\u6240\u6709\u6d41\u6587\u4ef6\u90fd\u5c06\u5177\u6709\u6b64\u5c5e\u6027\uff0c\u6307\u793a\u5c06\u5176\u8def\u7531\u5230\u54ea\u4e2a\u8fde\u7ebf
__WritesAttribute.EnforceOrder.detail.description=\u5f53\u6570\u636e\u8def\u7531\u5230'failure' \u6216 'skipped' \u8fde\u7ebf\u65f6\uff0c\u8be5\u5c5e\u6027\u6307\u793a\u5931\u8d25\u7ec6\u8282\u4fe1\u606f
__WritesAttribute.EnforceOrder.expectedOrder.description=\u5f53\u6570\u636e\u8def\u7531\u5230'wait' \u6216 'skipped' \u8fde\u7ebf\u65f6\uff0c\u6307\u793a\u5904\u7406\u6570\u636e\u6d41\u65f6\u7684\u9884\u671f\u6b21\u5e8f\u7684\u5c5e\u6027\u3002
__Stateful.description=\u7ec4\u4ef6\u4e3a\u6bcf\u4e2a\u6b21\u5e8f\u7ec4\u4f7f\u7528\u5982\u4e0b\u72b6\u6001\uff1a '<groupId>.target'\u8868\u793a\u7b49\u5f85\u4e0b\u4e00\u4e2a\u5230\u8fbe\u7684\u6b21\u5e8f\u3002\u5f53\u5339\u914d\u6b21\u5e8f\u7684\u6570\u636e\u6d41\u5230\u8fbe\u65f6\uff0c\u6216\u8005\u56e0\u4e3a\u300a\u7b49\u5f85\u8d85\u65f6\u300b\uff0c\u8d85\u8fc7\u4e86\u7b49\u5f85\u7684\u6570\u636e\u6d41\u65f6\uff0c\u76ee\u6807\u6b21\u5e8f\u5c06\u66f4\u65b0(FlowFile.order + 1). '<groupId>.max'\u4e3a\u7ec4\u7684\u6700\u5927\u6b21\u5e8f\u3002 '<groupId>.updatedAt'\u4e3a\u4e0a\u6b21\u66f4\u65b0\u7ec4\u6b21\u5e8f\u65f6\u7684\u65f6\u95f4\u6233\u3002\u4e00\u65e6\u4e00\u4e2a\u7ec4\u88ab\u786e\u5b9a\u4e3a\u4e0d\u6d3b\u52a8\uff0c\u8fd9\u4e9b\u7ba1\u7406\u72b6\u6001\u5c06\u88ab\u81ea\u52a8\u5220\u9664\uff0c \u67e5\u770b\u53c2\u6570 \u300a\u4e0d\u6d3b\u52a8\u8d85\u65f6\u300b\u4e86\u89e3\u66f4\u591a\u3002
