__CapabilityDescription=\u901a\u8fc7\u8bc4\u4f30\u6570\u636e\u6d41\u7684\u6b63\u5219\u8868\u8fbe\u5f0f\u5e76\u4f7f\u7528\u67d0\u4e2a\u66ff\u6362\u503c\u66ff\u6362\u4e0e\u6b63\u5219\u8868\u8fbe\u5f0f\u5339\u914d\u7684\u5185\u5bb9\u90e8\u5206\u6765\u66f4\u65b0\u6570\u636e\u6d41\u7684\u5185\u5bb9\u3002
__Tags=Text, Regular Expression, Update, Change, Replace, Modify, Regex
Regular_Expression.displayName=\u5339\u914d\u503c
Regular_Expression.description=\u8981\u5728\u6570\u636e\u6d41\u5185\u5bb9\u4e2d\u641c\u7d22\u7684\u5339\u914d\u503c\u3002\u4ec5\u7528\u4e8e\u201c\u6587\u5b57\u66ff\u6362\u201d\u548c\u201c\u6b63\u5219\u8868\u8fbe\u5f0f\u66ff\u6362\u201d\u5339\u914d\u7b56\u7565
Replacement_Value.displayName=\u66ff\u6362\u503c
Replacement_Value.description=\u4f7f\u7528\u201c\u66ff\u6362\u7b56\u7565\u201d\u66ff\u6362\u7684\u503c\u3002\u652f\u6301\u4f7f\u7528\u201c\u6b63\u5219\u8868\u8fbe\u5f0f\u66ff\u6362\u201d\u5bf9\u6b63\u5219\u8868\u8fbe\u5f0f\u5339\u914d\u7ec4\u7684\u53cd\u5411\u5f15\u7528\uff0c\u4f46\u5f15\u7528\u6b63\u5219\u8868\u8fbe\u5f0f\u4e2d\u4e0d\u5b58\u5728\u7684\u5339\u914d\u7ec4\u7684\u53cd\u5411\u5f15\u7528\u5c06\u88ab\u89c6\u4e3a\u6587\u5b57\u503c\u3002\u8fd4\u56de\u5f15\u7528\u4e5f\u53ef\u4ee5\u4f7f\u7528\u8868\u8fbe\u5f0f\u8bed\u8a00\u5f15\u7528\uff0c\u5982'$1'\uff0c'$2'\u7b49\u3002\u5fc5\u987b\u5305\u542b\u5355\u523b\u5ea6\u6807\u8bb0\uff0c\u56e0\u4e3a\u8fd9\u4e9b\u53d8\u91cf\u4e0d\u662f\u201c\u6807\u51c6\u201d\u5c5e\u6027\u540d\u79f0\uff08\u5fc5\u987b\u7528\u53cc\u5f15\u53f7\u5f15\u7528\u5c5e\u6027\u540d\u79f0\uff0c\u9664\u975e\u5b83\u4eec\u662f\u6570\u5b57\uff0c\u5b57\u6bcd\u548c_\uff09\u3002
Character_Set.displayName=\u5b57\u7b26\u7f16\u7801
Character_Set.description=\u6587\u4ef6\u7684\u5b57\u7b26\u96c6\u7f16\u7801
Maximum_Buffer_Size.displayName=\u6700\u5927\u7f13\u51b2\u533a\u5927\u5c0f
Maximum_Buffer_Size.description=\u6307\u5b9a\u8981\u7f13\u51b2\u7684\u6700\u5927\u6570\u636e\u91cf\uff08\u6bcf\u4e2a\u6587\u4ef6\u6216\u6bcf\u884c\uff0c\u5177\u4f53\u53d6\u51b3\u4e8e\u8bc4\u4f30\u6a21\u5f0f\uff09\u4ee5\u5e94\u7528\u66ff\u6362\u3002\u5982\u679c\u9009\u62e9\u201c\u5168\u6587\u201d\uff08\u5728\u8bc4\u4f30\u6a21\u5f0f\u4e0b\uff09\u5e76\u4e14\u6570\u636e\u6d41\u5927\u4e8e\u6b64\u503c\uff0c\u5219\u6570\u636e\u6d41\u5c06\u8def\u7531\u5230\u201cfailure\u201d\u3002\u5728\u201c\u9010\u884c\u201d\u6a21\u5f0f\u4e0b\uff0c\u5982\u679c\u5355\u884c\u5927\u4e8e\u6b64\u503c\uff0c\u5219\u6570\u636e\u6d41\u5c06\u8def\u7531\u5230\u201cfailure\u201d\u3002\u63d0\u4f9b\u7684\u9ed8\u8ba4\u503c\u4e3a1 MB\uff0c\u4e3b\u8981\u7528\u4e8e\u201c\u5168\u6587\u201d\u6a21\u5f0f\u3002\u5728\u201c\u9010\u884c\u201d\u6a21\u5f0f\u4e2d\uff0c\u5efa\u8bae\u4f7f\u7528\u8bf8\u59828KB\u621616KB\u7684\u503c\u3002\u5982\u679c<\u66ff\u6362\u7b56\u7565>\u5c5e\u6027\u8bbe\u7f6e\u4e3a\u4e0b\u5217\u4e4b\u4e00\uff0c\u5219\u5ffd\u7565\u6b64\u503c\uff1a\u524d\u7f6e\uff0c\u540e\u7f6e\uff0c\u59cb\u7ec8\u66ff\u6362
Replacement_Strategy.displayName=\u66ff\u6362\u7b56\u7565
Replacement_Strategy.description=\u6570\u636e\u6d41\u6587\u672c\u5185\u5bb9\u4e2d\u5982\u4f55\u66ff\u6362\u4ee5\u53ca\u66ff\u6362\u5185\u5bb9\u7684\u7b56\u7565\u3002
__AllowableValue.Replacement_Strategy.Always_Replace.displayName=\u59cb\u7ec8\u66ff\u6362
__AllowableValue.Replacement_Strategy.Always_Replace.description=\u59cb\u7ec8\u66ff\u6362\u6574\u4e2a\u884c\u6216\u6570\u636e\u6d41\u7684\u5168\u90e8\u5185\u5bb9\uff08\u53d6\u51b3\u4e8e<\u8bc4\u4f30\u6a21\u5f0f>\u5c5e\u6027\u7684\u503c\uff09\uff0c\u5e76\u4e14\u4e0d\u4f1a\u641c\u7d22\u4efb\u4f55\u503c\u3002\u9009\u62e9\u6b64\u7b56\u7565\u540e\uff0c\u5c06\u5ffd\u7565<\u5339\u914d\u503c>\u5c5e\u6027\u3002
__AllowableValue.Replacement_Strategy.Append.displayName=\u540e\u7f6e
__AllowableValue.Replacement_Strategy.Append.description=\u5728\u6570\u636e\u6d41\u7684\u672b\u5c3e\u6216\u6bcf\u884c\u7684\u672b\u5c3e\u63d2\u5165\u66ff\u6362\u503c\uff08\u53d6\u51b3\u4e8e\u8bc4\u4f30\u6a21\u5f0f\uff09\u3002\u5bf9\u4e8e\u201c\u9010\u884c\u201d\u8bc4\u4f30\u6a21\u5f0f\uff0c\u8be5\u503c\u5c06\u9644\u52a0\u5230\u6bcf\u4e00\u884c\u672b\u5c3e\u3002\u5bf9\u4e8e\u201c\u6574\u4e2a\u6587\u672c\u201d\u8bc4\u4f30\u6a21\u5f0f\uff0c\u8be5\u503c\u5c06\u9644\u52a0\u5230\u6574\u4e2a\u6587\u672c\u672b\u5c3e\u3002
__AllowableValue.Replacement_Strategy.Literal_Replace.displayName=\u6587\u5b57\u66ff\u6362
__AllowableValue.Replacement_Strategy.Literal_Replace.description=\u641c\u7d22\u5339\u914d\u503c\u7684\u6240\u6709\u5b9e\u4f8b\uff0c\u5e76\u5c06\u5339\u914d\u503c\u66ff\u6362\u4e3a\u66ff\u6362\u503c\u3002
__AllowableValue.Replacement_Strategy.Prepend.displayName=\u524d\u7f6e
__AllowableValue.Replacement_Strategy.Prepend.description=\u5728\u6570\u636e\u6d41\u7684\u5f00\u5934\u6216\u6bcf\u884c\u7684\u5f00\u5934\u63d2\u5165\u66ff\u6362\u503c\uff08\u53d6\u51b3\u4e8e\u8bc4\u4f30\u6a21\u5f0f\uff09\u3002\u5bf9\u4e8e\u201c\u9010\u884c\u201d\u8bc4\u4f30\u6a21\u5f0f\uff0c\u8be5\u503c\u5c06\u6dfb\u52a0\u5230\u6bcf\u4e00\u884c\u5f00\u5934\u3002\u5bf9\u4e8e\u201c\u5168\u6587\u201d\u8bc4\u4f30\u6a21\u5f0f\uff0c\u8be5\u503c\u5c06\u6dfb\u52a0\u5230\u6574\u4e2a\u6587\u672c\u5f00\u5934\u3002
__AllowableValue.Replacement_Strategy.Regex_Replace.displayName=\u6b63\u5219\u8868\u8fbe\u5f0f\u66ff\u6362
__AllowableValue.Replacement_Strategy.Regex_Replace.description=\u5c06\u641c\u7d22\u503c\u89e3\u6790\u4e3a\u6b63\u5219\u8868\u8fbe\u5f0f\uff0c\u5e76\u5c06\u6240\u6709\u5339\u914d\u66ff\u6362\u4e3a\u66ff\u6362\u503c\u3002\u66ff\u6362\u503c\u53ef\u4ee5\u901a\u8fc7\u4f7f\u7528$\u7b26\u53f7\u540e\u8ddf\u5339\u914d\u7ec4\u7f16\u53f7\uff08\u4f8b\u5982$1\u6216$2\uff09\u6765\u5f15\u7528\u641c\u7d22\u503c\u4e2d\u4f7f\u7528\u7684\u5339\u914d\u7ec4\u3002\u5982\u679c\u641c\u7d22\u503c\u8bbe\u7f6e\u4e3a.*\u5219\u6240\u6709\u5185\u5bb9\u90fd\u4f1a\u88ab\u66ff\u6362\uff0c\u751a\u81f3\u4e0d\u4f1a\u8bc4\u4f30\u6b63\u5219\u8868\u8fbe\u5f0f\u3002
Evaluation_Mode.displayName=\u8bc4\u4f30\u6a21\u5f0f
Evaluation_Mode.description=\u5206\u522b\u9488\u5bf9\u6bcf\u4e00\u884c\u8fd0\u884c\u201c\u66ff\u6362\u7b56\u7565\u201d\uff08\u9010\u884c\uff09\u6216\u5c06\u6574\u4e2a\u6587\u4ef6\u7f13\u51b2\u5230\u5185\u5b58\uff08\u6574\u4e2a\u6587\u672c\uff09\u5e76\u8fd0\u884c\u3002
__AllowableValue.Evaluation_Mode.Entire_text.displayName=\u6574\u4e2a\u6587\u672c
__AllowableValue.Evaluation_Mode.Line-by-Line.displayName=\u9010\u884c
__Relationship.success.description=\u5df2\u6210\u529f\u5904\u7406\u7684\u6570\u636e\u6d41\u88ab\u8def\u7531\u5230\u6b64\u8fde\u7ebf\u3002\u8fd9\u5305\u62ec\u5df2\u66ff\u6362\u6587\u672c\u7684\u6570\u636e\u6d41\u548c\u672a\u66ff\u6362\u6587\u672c\u7684\u6570\u636e\u6d41\u3002
__Relationship.failure.description=\u65e0\u6cd5\u66f4\u65b0\u7684\u6570\u636e\u6d41\u88ab\u8def\u7531\u5230\u6b64\u8fde\u7ebf
__SystemResource.MEMORY.description=\u6b64\u7ec4\u4ef6\u8fd0\u884c\u53ef\u80fd\u5bfc\u81f4\u7cfb\u7edf\u8d44\u6e90\u7684\u9ad8\u4f7f\u7528\u7387\u3002\u591a\u4e2a\u8fd0\u884c\u5b9e\u4f8b\u6216\u9ad8\u5e76\u53d1\u8bbe\u7f6e\u53ef\u80fd\u4f1a\u5bfc\u81f4\u7cfb\u7edf\u6027\u80fd\u4e0b\u964d\u3002
