__CapabilityDescription=\u201c\u8ddf\u8e2a\u201d\u6587\u4ef6\uff0c\u6216\u6587\u4ef6\u5217\u8868\uff0c\u5728\u5199\u5165\u6587\u4ef6\u65f6\u4ece\u6587\u4ef6\u4e2d\u63d0\u53d6\u6570\u636e\u3002\u6587\u4ef6\u5e94\u8be5\u662f\u6587\u672c\u7684\u3002\u53ea\u6709\u5728\u9047\u5230\u65b0\u884c(\u56de\u8f66\u3001\u65b0\u884c\u5b57\u7b26\u6216\u7ec4\u5408)\u65f6\u624d\u4f1a\u63a5\u6536\u6570\u636e\u3002\u5982\u679c\u8ddf\u8e2a\u6587\u4ef6\u5b9a\u671f\u201c\u7ffb\u6eda\u201d,\u5c31\u50cf\u4e00\u822c\u7684\u65e5\u5fd7\u6587\u4ef6,\u4e00\u4e2a\u53ef\u9009\u7684\u6eda\u52a8\u6587\u4ef6\u540d\u6a21\u5f0f\u53ef\u7528\u4e8e\u68c0\u7d22\u6570\u636e\u4ece\u6587\u4ef6\u7ffb\u6eda,\u5373\u4f7f\u53d1\u751f\u7ffb\u8f6cNiFi\u4e0d\u662f\u8fd0\u884c\u65f6(\u63d0\u4f9b\u6570\u636e\u4ecd\u7136\u5b58\u5728\u5728\u91cd\u542fNiFi)\u3002\u901a\u5e38\u5efa\u8bae\u5c06\u8fd0\u884c\u8c03\u5ea6\u8bbe\u7f6e\u4e3a\u51e0\u79d2\u949f\uff0c\u800c\u4e0d\u662f\u4f7f\u7528\u9ed8\u8ba4\u503c0\u79d2\u8fd0\u884c\uff0c\u56e0\u4e3a\u5982\u679c\u8c03\u5ea6\u5f97\u975e\u5e38\u9891\u7e41\uff0c\u8fd9\u4e2a\u5904\u7406\u5668\u5c06\u6d88\u8017\u5927\u91cf\u8d44\u6e90\u3002\u6b64\u65f6\uff0c\u6b64\u5904\u7406\u5668\u4e0d\u652f\u6301\u5728\u201c\u6eda\u52a8\u201d\u65f6\u538b\u7f29\u7684\u6587\u4ef6\u3002
__Tags=tail, file, log, text, source, \u8ddf\u8e2a, \u6587\u4ef6, \u65e5\u5fd7, \u6587\u672c
tail-mode.displayName=\u8ddf\u8e2a\u6a21\u5f0f
tail-mode.description=\u4f7f\u7528\:\u5355\u4e2a\u6587\u4ef6\u5c06\u53ea\u8ddf\u8e2a\u4e00\u4e2a\u6587\u4ef6\uff0c\u591a\u4e2a\u6587\u4ef6\u5c06\u67e5\u627e\u6587\u4ef6\u5217\u8868\u3002\u5728\u591a\u79cd\u6a21\u5f0f\u4e0b\uff0c\u9700\u8981\u57fa\u672c\u8def\u5f84\u3002
__AllowableValue.tail-mode.Multiple_files.displayName=\u591a\u6587\u4ef6
__AllowableValue.tail-mode.Multiple_files.description=\u5728\u8fd9\u79cd\u6a21\u5f0f\u4e0b\uff0c\u201cFiles to tail\u201d\u5c5e\u6027\u63a5\u53d7\u6b63\u5219\u8868\u8fbe\u5f0f\uff0c\u7ec4\u4ef6\u5c06\u5728\u201c\u57fa\u672c\u8def\u5f84\u201d\u4e2d\u67e5\u627e\u6587\u4ef6\uff0c\u5217\u51fa\u7ec4\u4ef6\u8981\u8ddf\u8e2a\u7684\u6587\u4ef6\u3002
__AllowableValue.tail-mode.Single_file.displayName=\u5355\u6587\u4ef6
__AllowableValue.tail-mode.Single_file.description=\u5728\u8fd9\u79cd\u6a21\u5f0f\u4e0b\uff0c\u7ec4\u4ef6\u53ea\u4f1a\u76d1\u89c6\u201c\u6587\u4ef6\u5230\u5c3e\u201d\u5c5e\u6027\u4e2d\u6307\u793a\u7684\u4e00\u4e2a\u6587\u4ef6\u3002\u5728\u6b64\u6a21\u5f0f\u4e0b\uff0c\u542f\u52a8\u7ec4\u4ef6\u65f6\u6587\u4ef6\u53ef\u80fd\u4e0d\u5b58\u5728\u3002
File_to_Tail.displayName=\u8ddf\u8e2a\u7684\u6587\u4ef6
File_to_Tail.description=\u5728\u5355\u6587\u4ef6\u6a21\u5f0f\u4e0b\uff0c\u8ddf\u8e2a\u6587\u4ef6\u7684\u8def\u5f84\u3002\u5982\u679c\u662f\u591a\u6587\u4ef6\u6a21\u5f0f, \u5728\u57fa\u672c\u8def\u5f84\u4e2d\u7528\u6b63\u5219\u8868\u8fbe\u5f0f\u67e5\u627e\u8981\u8ddf\u8e2a\u7684\u6587\u4ef6. \u5982\u679c\u9012\u5f52\u8bbe\u4e3atrue, \u6b63\u5219\u8868\u8fbe\u5f0f\u5c06\u7528\u4e8e\u5339\u914d\u4ece\u57fa\u672c\u8def\u5f84\u5f00\u59cb\u7684\u8def\u5f84(\u6709\u5173\u793a\u4f8b\uff0c\u8bf7\u53c2\u9605\u5176\u4ed6\u8be6\u7ec6\u4fe1\u606f).
Rolling_Filename_Pattern.displayName=\u6eda\u52a8\u6587\u4ef6\u540d\u6a21\u5f0f
Rolling_Filename_Pattern.description=\u5982\u679c\u6587\u4ef6\u8ddf\u65e5\u5fd7\u6587\u4ef6\u4e00\u6837\u4ee5\u201crolls over\u201d\u7ed3\u5c3e\uff0c\u5219\u6b64\u6587\u4ef6\u540d\u6a21\u5f0f\u5c06\u7528\u4e8e\u6807\u8bc6\u5df2\u7ffb\u8fc7\u7684\u6587\u4ef6\uff0c\u4ee5\u4fbf\u5728\u91cd\u65b0\u542f\u52a8NiFi\u65f6\uff0c\u5982\u679c\u6587\u4ef6\u5df2\u7ffb\u8fc7\uff0c\u5b83\u5c06\u80fd\u591f\u4ece\u505c\u6b62\u7684\u5730\u65b9\u7ee7\u7eed. \u8be5\u6a21\u5f0f\u652f\u6301\u901a\u914d\u7b26*\u548c?\uff0c\u8fd8\u652f\u6301\u7b26\u53f7${filename}\uff0c\u7528\u4e8e\u6839\u636e\u6587\u4ef6\u7684\u540d\u79f0(\u6ca1\u6709\u6269\u5c55\u540d)\u6307\u5b9a\u6a21\u5f0f\uff0c\u5e76\u5047\u8bbe\u5df2\u6eda\u52a8\u7684\u6587\u4ef6\u4e0e\u8ddf\u8e2a\u7684\u6587\u4ef6\u4f4d\u4e8e\u540c\u4e00\u4e2a\u8def\u5f84\u4e2d\u3002\u6240\u6709\u6587\u4ef6\u90fd\u5c06\u4f7f\u7528\u76f8\u540c\u7684glob\u6a21\u5f0f\u3002
tail-base-directory.displayName=\u57fa\u7840\u8def\u5f84
tail-base-directory.description=\u57fa\u672c\u8def\u5f84\u7528\u4e8e\u67e5\u627e\u8981\u8ddf\u8e2a\u7684\u6587\u4ef6\u3002\u4f7f\u7528\u591a\u6587\u4ef6\u6a21\u5f0f\u65f6\u9700\u8981\u6b64\u5c5e\u6027\u3002
Initial_Start_Position.displayName=\u521d\u59cb\u5316\u5f00\u59cb\u7684\u4f4d\u7f6e
Initial_Start_Position.description=\u5f53\u5904\u7406\u5668\u7b2c\u4e00\u6b21\u5f00\u59cb\u8ddf\u8e2a\u6570\u636e\u65f6\uff0c\u6b64\u5c5e\u6027\u6307\u5b9a\u7ec4\u4ef6\u5e94\u8be5\u4ece\u4f55\u5904\u5f00\u59cb\u8bfb\u53d6\u6570\u636e\u3002\u4e00\u65e6\u4ece\u6587\u4ef6\u4e2d\u63a5\u6536\u5230\u6570\u636e\uff0c\u7ec4\u4ef6\u5c06\u4ece\u63a5\u6536\u5230\u6570\u636e\u7684\u6700\u540e\u4e00\u70b9\u7ee7\u7eed\u3002
__AllowableValue.Initial_Start_Position.Beginning_of_File.displayName=\u6587\u4ef6\u7684\u5f00\u59cb
__AllowableValue.Initial_Start_Position.Beginning_of_File.description=\u4ece\u6587\u4ef6\u7684\u8d77\u59cb\u4f4d\u7f6e\u5f00\u59cb\u8ddf\u8e2a. \u4e0d\u4f1a\u83b7\u53d6\u4efb\u4f55\u5df2\u7ecf\u7ffb\u8fc7\u7684\u6570\u636e
__AllowableValue.Initial_Start_Position.Beginning_of_Time.displayName=\u5f00\u59cb\u65f6\u95f4
__AllowableValue.Initial_Start_Position.Beginning_of_Time.description=\u4ece\u5339\u914d\u6eda\u52a8\u6587\u4ef6\u540d\u6a21\u5f0f\u7684\u6700\u8001\u6570\u636e\u5f00\u59cb\uff0c\u7136\u540e\u4ece\u6587\u4ef6\u4e2d\u8bfb\u53d6\u4ee5\u8fdb\u884c\u8ddf\u8e2a
__AllowableValue.Initial_Start_Position.Current_Time.displayName=\u5f53\u524d\u65f6\u95f4          
__AllowableValue.Initial_Start_Position.Current_Time.description=\u4ece\u6587\u4ef6\u7684\u7ed3\u5c3e\u7684\u6570\u636e\u5f00\u59cb\u8ddf\u8e2a. \u4e0d\u4f1a\u83b7\u53d6\u4efb\u4f55\u5df2\u7ecf\u7ffb\u8fc7\u7684\u6570\u636e \u6216\u8005\u8981\u8ddf\u8e2a\u7684\u6587\u4ef6\u4e2d\u7684\u4efb\u4f55\u6570\u636e\u90fd\u5df2\u7ecf\u88ab\u5199\u5165.
File_Location.displayName=\u72b6\u6001\u4f4d
File_Location.description=\u6307\u5b9a\u72b6\u6001\u4f4d\u4e8e\u672c\u5730\u6216\u96c6\u7fa4\u4ee5\u4fbf\u80fd\u591f\u9002\u5f53\u5730\u5b58\u50a8\u72b6\u6001\uff0c\u4ee5\u786e\u4fdd\u5728\u91cd\u65b0\u542f\u52a8NiFi\u65f6\u4f7f\u7528\u6240\u6709\u6570\u636e\uff0c\u800c\u4e0d\u9700\u8981\u590d\u5236\u6570\u636e
__AllowableValue.File_Location.Local.displayName=\u672c\u5730
__AllowableValue.File_Location.Local.description=\u72b6\u6001\u5b58\u50a8\u5728\u672c\u5730. \u96c6\u7fa4\u4e2d\u7684\u6bcf\u4e2a\u8282\u70b9\u5c06\u8ddf\u8e2a\u4e00\u4e2a\u4e0d\u540c\u7684\u6587\u4ef6.
__AllowableValue.File_Location.Remote.displayName=\u8fdc\u7a0b
__AllowableValue.File_Location.Remote.description=\u72b6\u6001\u4f4d\u4e8e\u8fdc\u7a0b\u8d44\u6e90\u4e0a. \u8fd9\u4e2a\u7ec4\u4ef6\u5c06\u5728\u96c6\u7fa4\u4e2d\u5b58\u50a8\u72b6\u6001\uff0c\u8fd9\u6837\u5b83\u5c31\u53ea\u80fd\u5728\u4e3b\u8282\u70b9\u4e0a\u8fd0\u884c\uff0c\u4e00\u4e2a\u65b0\u7684\u4e3b\u8282\u70b9\u53ef\u4ee5\u5728\u6700\u540e\u4e00\u4e2a\u4e3b\u8282\u70b9\u505c\u6b62\u7684\u5730\u65b9\u7ee7\u7eed\u8fd0\u884c\u3002
tailfile-recursive-lookup.displayName=\u9012\u5f52\u67e5\u627e
tailfile-recursive-lookup.description=\u5f53\u4f7f\u7528\u591a\u6587\u4ef6\u6a21\u5f0f, \u6b64\u5c5e\u6027\u5b9a\u4e49\u662f\u5426\u5fc5\u987b\u9012\u5f52\u5730\u5217\u51fa\u57fa\u672c\u8def\u5f84\u4e2d\u7684\u6587\u4ef6.
__AllowableValue.tailfile-recursive-lookup.false.displayName=\u5426
__AllowableValue.tailfile-recursive-lookup.true.displayName=\u662f
tailfile-lookup-frequency.displayName=\u67e5\u627e\u9891\u7387
tailfile-lookup-frequency.description=\u4ec5\u7528\u4e8e\u591a\u6587\u4ef6\u6a21\u5f0f\u548c\u66f4\u6539\u540d\u79f0\u6eda\u52a8\u7b56\u7565. \u5b83\u6307\u5b9a\u5904\u7406\u5668\u5728\u518d\u6b21\u5217\u51fa\u8981\u8ddf\u8e2a\u7684\u6587\u4ef6\u4e4b\u524d\u7b49\u5f85\u7684\u6700\u77ed\u65f6\u95f4.
tailfile-maximum-age.displayName=\u6700\u5927\u5e74\u9f84
tailfile-maximum-age.description=\u4ec5\u7528\u4e8e\u591a\u6587\u4ef6\u6a21\u5f0f\u548c\u66f4\u6539\u540d\u79f0\u6eda\u52a8\u7b56\u7565. \u5b83\u6307\u5b9a\u4e86\u5fc5\u8981\u7684\u6700\u5c0f\u6301\u7eed\u65f6\u95f4\uff0c\u4e0d\u4f1a\u8003\u8651\u5728\u6587\u4ef6\u4e2d\u6dfb\u52a0\u5173\u4e8e\u6587\u4ef6\u6700\u540e\u4fee\u6539\u65e5\u671f\u7684\u65b0\u6d88\u606f
__Relationship.success.description=\u6240\u6709\u7684\u6d41\u6587\u4ef6\u90fd\u88ab\u8def\u7531\u5230\u8fd9\u6761\u7ebf.
__WritesAttribute.tailfile.original.path.description=\u6d41\u6587\u4ef6\u6765\u81ea\u539f\u59cb\u6587\u4ef6\u7684\u8def\u5f84.
__Stateful.description=\u5c06\u72b6\u6001\u5b58\u50a8\u5728\u5c3e\u6587\u4ef6\u4e2d\u5b83\u505c\u6b62\u7684\u4f4d\u7f6e\uff0c\u4ee5\u4fbf\u5728\u91cd\u65b0\u542f\u52a8\u65f6\u4e0d\u5fc5\u590d\u5236\u6570\u636e. \u72b6\u6001\u5b58\u50a8\u5728\u672c\u5730\u6216\u96c6\u7fa4\u4e2d\uff0c\u53d6\u51b3\u4e8e<\u72b6\u6001\u4f4d>\u5c5e\u6027.
__Restriction.read-filesystem.label=\u8bfb\u6587\u4ef6\u7cfb\u7edf
__Restriction.read-filesystem.explanation=\u57fa\u4e8e\u5f53\u524d\u5e73\u53f0\u53ef\u8bbf\u95ee\u7684\u6743\u9650\uff0c\u63d0\u4f9b\u76f8\u5e94\u7684\u8bfb\u53d6\u6587\u4ef6\u64cd\u4f5c\u6743\u9650\u3002
