__CapabilityDescription=\u63d0\u4f9b\u7f13\u5b58\u4e2d\u7f13\u5b58\u91ca\u653e\u4fe1\u53f7\u7684\u6807\u8bc6\u7b26\uff0c\u53ef\u4ee5\u9009\u62e9\u5c06\u5176\u4e0e\u6570\u636e\u6d41\u7684\u5c5e\u6027\u4e00\u8d77\u7f13\u5b58\u3002\u4e00\u65e6\u5728\u7f13\u5b58\u4e2d\u53d1\u73b0\u8fd9\u4e2a\u4fe1\u53f7\uff0c\u5728\u76f8\u5e94\u7684wait\u7ec4\u4ef6\u6301\u6709\u7684\u6240\u6709\u6d41\u6587\u4ef6\u90fd\u5c06\u88ab\u91ca\u653e\u3002
__Tags=map, cache, notify, distributed, signal, release, \u4fe1\u53f7, \u91ca\u653e, \u901a\u77e5
release-signal-id.displayName=\u4fe1\u53f7\u91ca\u653e\u6807\u8bc6\u7b26
release-signal-id.description=\u4e00\u4e2a\u503c\u6216\u8005\u6839\u636e\u5c5e\u6027\u8868\u8fbe\u5f0f\u8ba1\u7b97\u6570\u636e\u6d41\u7684\u7ed3\u679c\u503c\uff0c\u8be5\u503c\u7528\u6765\u786e\u5b9a\u91ca\u653e\u4fe1\u53f7\u7f13\u5b58\u952e\u503c
signal-counter-name.displayName=\u4fe1\u53f7\u8ba1\u6570\u5668\u540d\u79f0
signal-counter-name.description=\u4e00\u4e2a\u503c\uff0c\u6216\u8005\u6839\u636e\u5c5e\u6027\u8868\u8fbe\u5f0f\u8ba1\u7b97\u6570\u636e\u6d41\u7684\u7ed3\u679c\u503c\uff0c\u8be5\u503c\u7528\u6765\u786e\u5b9a\u4fe1\u53f7\u8ba1\u6570\u5668\u540d\u79f0\u3002\u5f53\u76f8\u5e94\u7684Wait\u7ec4\u4ef6\u9700\u8981\u77e5\u9053\u4e0d\u540c\u7c7b\u578b\u4e8b\u4ef6(\u5982\u6210\u529f\u3001\u5931\u8d25\u6216\u76ee\u6807\u6570\u636e\u6e90\u540d\u79f0\u7b49)\u53d1\u751f\u7684\u6b21\u6570\u65f6\uff0c\u4fe1\u53f7\u8ba1\u6570\u5668\u540d\u79f0\u975e\u5e38\u6709\u7528\u3002
signal-counter-delta.displayName=\u4fe1\u53f7\u8ba1\u6570\u5668\u589e\u91cf
signal-counter-delta.description=\u4e00\u4e2a\u503c\uff0c\u6216\u8005\u6839\u636e\u5c5e\u6027\u8868\u8fbe\u5f0f\u5bf9FlowFile\u8ba1\u7b97\u7684\u7ed3\u679c\u503c\uff0c\u8be5\u503c\u7528\u6765\u786e\u5b9a\u4fe1\u53f7\u8ba1\u6570\u5668\u589e\u91cf\uff0c\u6307\u5b9a\u8ba1\u6570\u5668\u5e94\u8be5\u589e\u52a0\u591a\u5c11\u3002\u4f8b\u5982\uff0c\u5982\u679c\u5728\u4e0a\u6e38\u6d41\u4e2d\u4ee5\u6279\u5904\u7406\u7684\u65b9\u5f0f\u5904\u7406\u591a\u4e2a\u4fe1\u53f7\u4e8b\u4ef6\uff0c\u5219\u53ef\u4ee5\u7acb\u523b\u7528\u8be5\u5c5e\u6027\u901a\u77e5\u5904\u7406\u7684\u4e8b\u4ef6\u6570\u91cf\u30020\u6709\u4e00\u4e2a\u7279\u6b8a\u7684\u542b\u4e49\uff0c\u5b83\u5c06\u76ee\u6807\u8ba1\u6570\u6e05\u9664\u56de0\uff0c\u8fd9\u5728\u4e0eWait\u7ec4\u4ef6\u7684'\u53ef\u91ca\u653e\u7684\u6570\u636e\u6d41\u8ba1\u6570'=0\u6a21\u5f0f\u4e00\u8d77\u4f7f\u7528\u65f6\u7279\u522b\u6709\u7528\uff0c\u4ee5\u63d0\u4f9b\u201c\u5f00\u95ed\u95e8\u201d\u7c7b\u578b\u7684\u6d41\u63a7\u5236\u30021\u53ef\u4ee5\u6253\u5f00\u76f8\u5e94\u7684Wait\u7ec4\u4ef6\uff0c\u800c0\u5219\u5173\u95ed\u5b83\u3002
signal-buffer-count.displayName=\u7b49\u5f85\u7f13\u5b58\u8ba1\u6570
signal-buffer-count.description=\u6307\u5b9a\u76f4\u5230\u6709\u4fe1\u53f7\u901a\u77e5\u7f13\u5b58\u670d\u52a1\u65f6\uff0c\u53ef\u4ee5\u7f13\u5b58\u8f93\u5165\u6570\u636e\u6d41\u7684\u6700\u5927\u6570\u91cf\u3002\u66f4\u591a\u7684\u7f13\u5b58\u91cf\u53ef\u4ee5\u63d0\u4f9b\u66f4\u597d\u7684\u6027\u80fd\uff0c\u56e0\u4e3a\u5f53\u591a\u4e2a\u8f93\u5165\u6d41\u6587\u4ef6\u5171\u4eab\u76f8\u540c\u7684\u4fe1\u53f7\u6807\u8bc6\u7b26\u65f6\uff0c\u4f1a\u6309\u4fe1\u53f7\u6807\u8bc6\u7b26\u5206\u7ec4\u4fe1\u53f7\uff0c\u4ee5\u51cf\u5c11\u8ddf\u7f13\u5b58\u670d\u52a1\u7684\u4ea4\u4e92\u6b21\u6570\u3002
distributed-cache-service.displayName=\u7f13\u5b58\u670d\u52a1
distributed-cache-service.description=\u7528\u4e8e\u7f13\u5b58\u91ca\u653e\u4fe1\u53f7\u7684\u63a7\u5236\u5668\u670d\u52a1\uff0c\u8fd9\u4e9b\u4fe1\u53f7\u7528\u6765\u91ca\u653e\u5728\u76f8\u5e94Wait\u7ec4\u4ef6\u4e0a\u6392\u961f\u7b49\u5f85\u7684\u6d41\u6587\u4ef6\u3002
attribute-cache-regex.displayName=\u5c5e\u6027\u5339\u914d\u6b63\u5219\u8868\u8fbe\u5f0f
attribute-cache-regex.description=\u540d\u79f0\u4e0e\u6b64\u6b63\u5219\u8868\u8fbe\u5f0f\u5339\u914d\u7684\u4efb\u4f55\u5c5e\u6027\u90fd\u5c06\u5b58\u50a8\u5728\u7f13\u5b58\u4e2d\uff0c\u4ee5\u4fbf\u590d\u5236\u5230Wait\u7ec4\u4ef6\u8f93\u51fa\u7684\u4efb\u4f55\u6570\u636e\u6d41\u4e0a\u3002\u6ce8\u610fuuid\u5c5e\u6027\u662f\u4e0d\u4f1a\u88ab\u7f13\u5b58\u7684\uff1b\u5982\u679c\u8be5\u503c\u4e3a\u7a7a\uff0c\u5219\u4e0d\u4f1a\u7f13\u5b58\u4efb\u4f55\u5c5e\u6027\u3002
__Relationship.success.description=\u91ca\u653e\u4fe1\u53f7\u6210\u529f\u8fdb\u5165\u5230\u7f13\u5b58\u4e2d\u540e\uff0c\u6240\u6709\u7684\u6570\u636e\u6d41\u90fd\u4f1a\u8f93\u51fa\u5230\u8be5\u8fde\u7ebf\u3002
__Relationship.failure.description=\u5f53\u7f13\u5b58\u4e0d\u53ef\u7528\uff0c\u6216\u91ca\u653e\u4fe1\u53f7\u6807\u8bc6\u7b26\u7684\u503c\u4e3anull\u6216\u7a7a\u65f6\uff0c\u6570\u636e\u6d41\u5c06\u8f93\u51fa\u5230\u6b64\u8fde\u7ebf\u3002
__WritesAttribute.notified.description=\u6240\u6709\u7684\u6570\u636e\u6d41\u90fd\u6709\u4e00\u4e2a\u5c5e\u6027'notified'\u3002\u6b64\u5c5e\u6027\u7684\u503c\u82e5\u4e3atrue\uff0c\u8bf4\u660e\u901a\u77e5\u4e86\u8be5\u6570\u636e\u6d41\uff0c\u5426\u5219\u4e3afalse\u3002
