__CapabilityDescription=\u6839\u636e\u8f93\u5165\u6570\u636e\u6d41\u7684\u5185\u5bb9\u5339\u914d\u4e00\u4e2a\u6216\u591a\u4e2aSQL\u67e5\u8be2\u3002SQL\u67e5\u8be2\u7684\u7ed3\u679c\u5c06\u4f5c\u4e3a\u8f93\u51fa\u6570\u636e\u6d41\u7684\u5185\u5bb9\u3002\u8fd9\u53ef\u7528\u4e8e\u8bf8\u5982\u7279\u5b9a\u5b57\u6bb5\u7684\u8fc7\u6ee4\uff0c\u8f6c\u6362\u548c\u884c\u7ea7\u8fc7\u6ee4\u3002\u53ef\u4ee5\u91cd\u547d\u540d\u5217\uff0c\u6267\u884c\u7b80\u5355\u7684\u8ba1\u7b97\u548c\u805a\u5408\u7b49\u3002\u7ec4\u4ef6\u914d\u7f6e\u6709\u8bfb\u53d6\u670d\u52a1\u548c\u5199\u5165\u670d\u52a1\uff0c\u4ee5\u4fbf\u5141\u8bb8\u66f4\u52a0\u7075\u6d3b\u7684\u63a7\u5236\u8f93\u5165\u8f93\u51fa\u7684\u6570\u636e\u683c\u5f0f\u3002\u5fc5\u987b\u4e3a\u7ec4\u4ef6\u914d\u7f6e\u81f3\u5c11\u4e00\u4e2a\u7528\u6237\u81ea\u5b9a\u4e49\u7684\u5c5e\u6027\u3002 \u81ea\u5b9a\u4e49\u5c5e\u6027\u540d\u5c06\u4f5c\u4e3a\u8f93\u51fa\u6570\u636e\u6d41\u7684\u8fde\u7ebf\u540d\uff0c\u800c\u81ea\u5b9a\u4e49\u5c5e\u6027\u7684\u503c\u662f\u4e00\u4e2aSQL SELECT\u8bed\u53e5\uff0c\u7528\u4e8e\u6307\u5b9a\u5982\u4f55\u8f6c\u6362/\u8fc7\u6ee4\u8f93\u5165\u6570\u636e\u3002 SQL\u8bed\u53e5\u5fc5\u987b\u662f\u6709\u6548\u7684ANSI SQL\u89c4\u8303\uff08Apache Calcite\uff09\u3002\u5982\u679c\u8f6c\u6362\u5931\u8d25\uff0c\u5219\u539f\u59cb\u6570\u636e\u6d41\u5c06\u8def\u7531\u5230\u201cfailure\u201d\u8fde\u7ebf\u3002\u5426\u5219\uff0c\u6240\u6709\u6570\u636e\u5c06\u88ab\u8def\u7531\u5230\u5173\u8054\u7684\u8fde\u7ebf\u3002\u5982\u679c\u5199\u5165\u670d\u52a1\u9009\u62e9\u4f7f\u7528\u7ee7\u627f\u6a21\u5f0f(Schema)\uff0c\u8bf7\u52a1\u5fc5\u6ce8\u610f\uff0c\u7ee7\u627f\u7684\u6a21\u5f0f\u5c06\u6765\u81eaResultSet\uff0c\u800c\u4e0d\u662f\u8f93\u5165\u7684\u8bb0\u5f55\u3002\u8fd8\u5141\u8bb8QueryRecord\u7ec4\u4ef6\u7684\u5355\u4e2a\u5b9e\u4f8b\u5177\u6709\u591a\u4e2aSQL\u67e5\u8be2\uff0c\u6bcf\u4e2a\u67e5\u8be2\u8fd4\u56de\u4e00\u7ec4\u4e0d\u540c\u7684\u5217\u548c\u805a\u5408\u3002\u56e0\u6b64\uff0c\u6d3e\u751f\u7684\u6a21\u5f0f\u5c06\u6ca1\u6709\u6a21\u5f0f\u540d\u79f0\uff0c\u56e0\u6b64\uff0c\u5982\u679c\u4ece\u8bb0\u5f55\u7ee7\u627f\u6a21\u5f0f\uff0c\u5219\u914d\u7f6e\u7684\u5199\u5165\u670d\u52a1\u4e0d\u4f1a\u5c1d\u8bd5\u5c06\u6a21\u5f0f\u540d\u79f0\u4f5c\u4e3a\u5c5e\u6027\u7f16\u5199\uff0c\u8fd9\u4e00\u70b9\u5f88\u91cd\u8981\u3002\u6709\u5173\u66f4\u591a\u4fe1\u606f\uff0c\u8bf7\u53c2\u9605\u7ec4\u4ef6\u4f7f\u7528\u6587\u6863\u3002
__Tags=sql, query, calcite, route, record, transform, select, update, modify, etl, filter, record, csv, json, logs, text, avro, aggregate, \u67e5\u8be2, \u8bb0\u5f55
record-reader.displayName=\u8bfb\u53d6\u670d\u52a1
record-reader.description=\u6307\u5b9a\u7528\u4e8e\u89e3\u6790\u4f20\u5165\u6570\u636e\u548c\u786e\u5b9a\u6570\u636e\u7ed3\u6784\u7684\u670d\u52a1
record-writer.displayName=\u5199\u5165\u670d\u52a1
record-writer.description=\u6307\u5b9a\u7528\u4e8e\u5c06\u7ed3\u679c\u5199\u5165\u6570\u636e\u6d41\u7684\u670d\u52a1
include-zero-record-flowfiles.displayName=\u5305\u62ec\u96f6\u8bb0\u5f55\u6570\u636e\u6d41
include-zero-record-flowfiles.description=\u5bf9\u4f20\u5165\u7684\u6570\u636e\u6d41\u8fd0\u884cSQL\u8bed\u53e5\u65f6\uff0c\u5982\u679c\u7ed3\u679c\u6ca1\u6709\u6570\u636e\uff0c\u5219\u6b64\u5c5e\u6027\u51b3\u5b9a\u662f\u5426\u4ecd\u65e7\u8f93\u51fa\u6570\u636e\u6d41
__AllowableValue.include-zero-record-flowfiles.false.displayName=\u4e0d\u5305\u542b
__AllowableValue.include-zero-record-flowfiles.true.displayName=\u5305\u542b
cache-schema.displayName=\u7f13\u5b58\u6a21\u5f0f(Schema)
cache-schema.description=\u89e3\u6790SQL\u67e5\u8be2\u5e76\u6d3e\u751f\u6570\u636e\u6d41\u7684\u6a21\u5f0f\u4ee3\u4ef7\u76f8\u5bf9\u9ad8\u6602\u3002 \u5982\u679c\u8bbe\u7f6e\u7f13\u5b58\uff0c\u5219\u7ec4\u4ef6\u5c06\u7f13\u5b58\u8fd9\u4e9b\u503c\uff0c\u4ee5\u4fbf\u7ec4\u4ef6\u66f4\u9ad8\u6548\uff0c\u66f4\u5feb\u3002 \u4f46\u662f\uff0c\u5982\u679c\u8fd9\u6837\u505a\uff0c\u5219\u7b2c\u4e00\u4e2a\u6570\u636e\u6d41\u6d3e\u751f\u7684\u6a21\u5f0f\u5fc5\u987b\u80fd\u5e94\u7528\u4e8e\u6240\u6709\u540e\u7ee7\u7684\u6570\u636e\u6d41\u3002 \u5982\u679c\u6240\u6709\u6570\u636e\u6d41\u90fd\u6ca1\u6709\u5b8c\u5168\u76f8\u540c\u7684\u6a21\u5f0f\uff0c\u6216\u8005SQL SELECT\u8bed\u53e5\u4f7f\u7528\u8868\u8fbe\u5f0f\u8bed\u8a00\uff0c\u5219\u6b64\u503c\u5e94\u8bbe\u7f6e\u4e3afalse\u3002
__AllowableValue.cache-schema.false.displayName=\u4e0d\u7f13\u5b58
__AllowableValue.cache-schema.true.displayName=\u7f13\u5b58
The_name_of_the_relationship_to_route_data_to.description=\u6bcf\u4e2a\u7528\u6237\u81ea\u5b9a\u4e49\u7684\u5c5e\u6027\u90fd\u9700\u8981\u6307\u5b9a\u8981\u5728\u6570\u636e\u4e0a\u6267\u884c\u7684SQL SELECT\u8bed\u53e5\uff0c\u6240\u9009\u7684\u6570\u636e\u5c06\u8def\u7531\u5230\u540d\u79f0\u4e3a\u5c5e\u6027\u540d\u79f0\u7684\u8fde\u7ebf
__Relationship.failure.description=\u5982\u679c\u6570\u636e\u6d41\u56e0\u4efb\u4f55\u539f\u56e0\u5904\u7406\u5931\u8d25\uff08\u4f8b\u5982\uff0cSQL\u8bed\u53e5\u5305\u542b\u8f93\u5165\u6570\u636e\u4e2d\u4e0d\u5b58\u5728\u7684\u5217\uff09\uff0c\u5219\u539f\u59cb\u8f93\u5165\u6570\u636e\u6d41\u5c06\u8def\u7531\u5230\u6b64\u8fde\u7ebf
__Relationship.original.description=\u539f\u59cb\u8f93\u5165\u6570\u636e\u6d41\u88ab\u8f93\u51fa\u5230\u8be5\u8fde\u7ebf
__Relationship.Property_Name.description=\u6bcf\u4e2a\u7528\u6237\u5b9a\u4e49\u7684\u5c5e\u6027\u90fd\u4e3a\u6b64\u7ec4\u4ef6\u5b9a\u4e49\u65b0\u7684\u52a8\u6001\u8fde\u7ebf\u3002
__WritesAttribute.mime.type.description=\u5c06mime.type\u5c5e\u6027\u8bbe\u7f6e\u4e3a\u5199\u5165\u670d\u52a1\u6307\u5b9a\u7684MIME\u7c7b\u578b
__WritesAttribute.record.count.description=\u9009\u4e2d\u67e5\u8be2\u7684\u8bb0\u5f55\u6570
