__CapabilityDescription=\u4ece\u76ee\u5f55\u4e2d\u7684\u8bfb\u53d6\u6587\u4ef6\u5e76\u521b\u5efa\u76f8\u5e94\u7684\u6587\u4ef6\u5185\u5bb9\u6570\u636e\u6d41\u8f93\u51fa\u3002 \u5982\u679c\u6587\u4ef6\u6ca1\u6709\u8bfb\u53d6\u6743\u9650\uff0c\u5c06\u88ab\u5ffd\u7565\u3002
__Tags=local, files, filesystem, ingest, ingress, get, source, input, \u6587\u4ef6, \u8bfb\u53d6
Input_Directory.displayName=\u8bfb\u53d6\u76ee\u5f55
Input_Directory.description=\u6307\u5b9a\u8bfb\u53d6\u6587\u4ef6\u7684\u76ee\u5f55
File_Filter.displayName=\u6587\u4ef6\u8fc7\u6ee4\u5668
File_Filter.description=\u4ec5\u9009\u53d6\u540d\u79f0\u4e0e\u7ed9\u5b9a\u6b63\u5219\u8868\u8fbe\u5f0f\u5339\u914d\u7684\u6587\u4ef6
Path_Filter.displayName=\u8def\u5f84\u8fc7\u6ee4\u5668
Path_Filter.description=\u5f53<\u8fed\u4ee3\u5b50\u76ee\u5f55>\u53c2\u6570\u9009\u662f\u65f6\uff0c\u53ea\u626b\u63cf\u8def\u5f84\u4e0e\u7ed9\u5b9a\u6b63\u5219\u8868\u8fbe\u5f0f\u5339\u914d\u7684\u5b50\u76ee\u5f55
Batch_Size.displayName=\u5206\u6279\u6570\u91cf
Batch_Size.description=\u6bcf\u6b21\u8fed\u4ee3\u5904\u7406\u4e2d\u8981\u8bfb\u53d6\u7684\u6700\u5927\u6587\u4ef6\u6570
Keep_Source_File.displayName=\u4fdd\u7559\u6e90\u6587\u4ef6
Keep_Source_File.description=\u5982\u679c\u4e3a\u4fdd\u7559\uff0c\u5219\u5728\u5c06\u6587\u4ef6\u590d\u5236\u5230\u5185\u5bb9\u4ed3\u5e93\u540e\u4e0d\u4f1a\u5220\u9664\u8be5\u6587\u4ef6;\u8be5\u53c2\u6570\u53ef\u4ee5\u4fdd\u8bc1\u6587\u4ef6\u88ab\u4fdd\u7559\uff0c\u4e14\u5bf9\u4e8e\u6d4b\u8bd5\u65f6\u5f88\u6709\u7528\u3002\u5982\u679c\u4e0d\u4fdd\u7559\uff0c\u5219\u9700\u8981\u6587\u4ef6\u7684\u5199\u5165\u6743\u9650\uff0c\u5426\u5219\u5ffd\u7565\u8be5\u6587\u4ef6\u3002
__AllowableValue.Keep_Source_File.false.displayName=\u4e0d\u4fdd\u7559
__AllowableValue.Keep_Source_File.true.displayName=\u4fdd\u7559
Recurse_Subdirectories.displayName=\u8fed\u4ee3\u5b50\u76ee\u5f55
Recurse_Subdirectories.description=\u9009\u62e9\u662f\u5426\u8fed\u4ee3\u5904\u7406\u5b50\u76ee\u5f55\uff0c\u5e76\u4ece\u4e2d\u8bfb\u53d6\u6587\u4ef6\u3002
__AllowableValue.Recurse_Subdirectories.false.displayName=\u5426
__AllowableValue.Recurse_Subdirectories.true.displayName=\u662f
Polling_Interval.displayName=\u8f6e\u8be2\u95f4\u9694
Polling_Interval.description=\u8868\u793a\u5728\u5904\u7406\u76ee\u5f55\u8fed\u4ee3\u4e4b\u524d\u7684\u7b49\u5f85\u65f6\u95f4
Ignore_Hidden_Files.displayName=\u5ffd\u7565\u9690\u85cf\u6587\u4ef6
Ignore_Hidden_Files.description=\u9009\u62e9\u662f\u5426\u5ffd\u7565\u9690\u85cf\u6587\u4ef6
__AllowableValue.Ignore_Hidden_Files.false.displayName=\u4e0d\u5ffd\u7565
__AllowableValue.Ignore_Hidden_Files.true.displayName=\u5ffd\u7565
Minimum_File_Age.displayName=\u6700\u65e9\u6587\u4ef6\u4fee\u6539\u65f6\u95f4
Minimum_File_Age.description=\u6587\u4ef6\u88ab\u8bfb\u53d6\u7684\u6700\u65e9\u4fee\u6539\u65f6\u95f4\u9650\u5b9a\uff0c\u4efb\u4f55\u5c0f\u4e8e\u6b64\u65f6\u95f4\u91cf\u7684\u6587\u4ef6\uff08\u6839\u636e\u6700\u540e\u4fee\u6539\u65e5\u671f\uff09\u5c06\u88ab\u5ffd\u7565
Maximum_File_Age.displayName=\u6700\u665a\u6587\u4ef6\u4fee\u6539\u65f6\u95f4
Maximum_File_Age.description=\u6587\u4ef6\u88ab\u8bfb\u53d6\u7684\u6700\u665a\u4fee\u6539\u65f6\u95f4\u9650\u5b9a\uff0c\u4efb\u4f55\u8d85\u8fc7\u6b64\u65f6\u95f4\u91cf\u7684\u6587\u4ef6\uff08\u6839\u636e\u4e0a\u6b21\u4fee\u6539\u65e5\u671f\uff09\u90fd\u5c06\u88ab\u5ffd\u7565
Minimum_File_Size.displayName=\u6700\u5c0f\u6587\u4ef6\u5927\u5c0f\u9650\u5b9a
Minimum_File_Size.description=\u80fd\u88ab\u8bfb\u53d6\u7684\u6700\u5c0f\u6587\u4ef6\u5927\u5c0f
Maximum_File_Size.displayName=\u6700\u5927\u6587\u4ef6\u5927\u5c0f\u9650\u5b9a
Maximum_File_Size.description=\u80fd\u88ab\u8bfb\u53d6\u7684\u6700\u5927\u6587\u4ef6\u5927\u5c0f
__Relationship.success.description=\u6210\u529f\u8bfb\u53d6\u6587\u4ef6\u540e\u7684\u6587\u4ef6\u5185\u5bb9\u6570\u636e\u6d41\u8f93\u51fa
__WritesAttribute.filename.description=\u8bfb\u53d6\u7684\u6587\u4ef6\u540d\u5b57
__WritesAttribute.path.description=\u57fa\u4e8e\u8bfb\u53d6\u76ee\u5f55\u7684\u6587\u4ef6\u76f8\u5bf9\u8def\u5f84\u3002\u4f8b\u5982\uff0c\u5982\u679c<\u8bfb\u53d6\u76ee\u5f55>\u53c2\u6570\u8bbe\u7f6e\u4e3a/tmp\uff0c\u5219\u4ece/tmp\u4e2d\u8bfb\u53d6\u7684\u6587\u4ef6\u7684path\u5c5e\u6027\u5c06\u8bbe\u7f6e\u4e3a./\u3002\u5982\u679c<\u8fed\u4ee3\u5b50\u76ee\u5f55>\u53c2\u6570\u8bbe\u7f6e\u4e3atrue\u5e76\u4e14\u4ece/tmp/abc/1/2/3\u4e2d\u8bfb\u53d6\u6587\u4ef6\uff0c\u5219path\u5c5e\u6027\u5c06\u8bbe\u7f6e\u4e3aabc/1/2/3
__WritesAttribute.file.creationTime.description=\u6587\u4ef6\u7684\u521b\u5efa\u65f6\u95f4\u3002\u53ef\u80fd\u65e0\u6cd5\u5728\u6240\u6709\u6587\u4ef6\u7cfb\u7edf\u4e0a\u8fd0\u884c
__WritesAttribute.file.lastModifiedTime.description=\u6587\u4ef6\u7684\u6700\u540e\u4fee\u6539\u65f6\u95f4\u3002\u53ef\u80fd\u65e0\u6cd5\u5728\u6240\u6709\u6587\u4ef6\u7cfb\u7edf\u4e0a\u8fd0\u884c
__WritesAttribute.file.lastAccessTime.description=\u6587\u4ef6\u7684\u6700\u540e\u8bbf\u95ee\u65f6\u95f4\u3002\u53ef\u80fd\u65e0\u6cd5\u5728\u6240\u6709\u6587\u4ef6\u7cfb\u7edf\u4e0a\u8fd0\u884c
__WritesAttribute.file.owner.description=\u6587\u4ef6\u7684\u6240\u6709\u8005\u3002\u53ef\u80fd\u65e0\u6cd5\u5728\u6240\u6709\u6587\u4ef6\u7cfb\u7edf\u4e0a\u8fd0\u884c
__WritesAttribute.file.group.description=\u6587\u4ef6\u7684\u7ec4\u6240\u6709\u8005\u3002\u53ef\u80fd\u65e0\u6cd5\u5728\u6240\u6709\u6587\u4ef6\u7cfb\u7edf\u4e0a\u8fd0\u884c
__WritesAttribute.file.permissions.description=\u6587\u4ef6\u7684\u8bfb/\u5199/\u6267\u884c\u6743\u9650\u3002\u53ef\u80fd\u65e0\u6cd5\u5728\u6240\u6709\u6587\u4ef6\u7cfb\u7edf\u4e0a\u8fd0\u884c
__WritesAttribute.absolute.path.description=\u6587\u4ef6\u7684\u7edd\u5bf9\u8def\u5f84
__Restriction.read-filesystem.label=\u8bfb\u6587\u4ef6\u7cfb\u7edf
__Restriction.read-filesystem.explanation=\u57fa\u4e8e\u5f53\u524d\u5e73\u53f0\u53ef\u8bbf\u95ee\u7684\u6743\u9650\uff0c\u63d0\u4f9b\u76f8\u5e94\u7684\u8bfb\u53d6\u6587\u4ef6\u64cd\u4f5c\u6743\u9650\u3002
__Restriction.write-filesystem.label=\u5199\u6587\u4ef6\u7cfb\u7edf
__Restriction.write-filesystem.explanation=\u57fa\u4e8e\u5f53\u524d\u5e73\u53f0\u53ef\u8bbf\u95ee\u7684\u6743\u9650\uff0c\u63d0\u4f9b\u76f8\u5e94\u7684\u5199\u5165\u6587\u4ef6\u64cd\u4f5c\u6743\u9650\u3002
