__CapabilityDescription=\u751f\u6210SQL Select\u67e5\u8be2\u8bed\u53e5\u6216\u4f7f\u7528\u63d0\u4f9b\u7684\u8bed\u53e5\uff0c\u5e76\u6267\u884c\u540e\u83b7\u5f97\u6240\u6709\u6570\u636e\u884c\u3002 \u67e5\u8be2\u7ed3\u679c\u88ab\u8f6c\u6362\u4e3aAvro\u683c\u5f0f\u8f93\u51fa\u3002\u5f88\u591a\u53c2\u6570\u652f\u6301\u8868\u8fbe\u5f0f\u8bed\u8a00\uff0c\u4f46\u662f\u8be5\u7ec4\u4ef6\u4e0d\u5141\u8bb8\u6709\u8f93\u5165\u8fde\u63a5\u3002\u6240\u4ee5\u53c2\u6570\u4ec5\u652f\u6301\u53d8\u91cf\u8868\u8fbe\u5f0f\u3002 \u5982\u679c\u60f3\u8981\u901a\u8fc7\u8f93\u5165\u6570\u636e\u6d41\u5185\u5bb9\u6765\u6267\u884c\u67e5\u8be2\uff0c\u53ef\u4f7f\u7528GenerateTableFetch\u6216ExecuteSQL\u7ec4\u4ef6\u3002 \u8be5\u7ec4\u4ef6\u652f\u6301\u4efb\u610f\u5927\u7684\u67e5\u8be2\u7ed3\u679c\u3002\u8be5\u7ec4\u4ef6\u4e5f\u53ef\u8bbe\u7f6e\u65f6\u95f4\u89e6\u53d1\u6216CRON\u8868\u8fbe\u5f0f\u6765\u8c03\u5ea6\u6267\u884c\u3002\u8be5\u7ec4\u4ef6\u5e94\u8be5\u53ea\u8fd0\u884c\u5728\u4e3b\u8282\u70b9\u4e0a\u3002\u6570\u636e\u6d41\u5c5e\u6027'querydbtable.row.count'\u8868\u793a\u591a\u5c11\u6570\u636e\u884c\u88ab\u67e5\u8be2\u51fa\u6765\u3002
__Tags=sql, select, jdbc, query, database, \u6570\u636e\u5e93, \u67e5\u8be2
Database_Connection_Pooling_Service.displayName=\u6570\u636e\u5e93\u8fde\u63a5\u6c60
Database_Connection_Pooling_Service.description=\u6570\u636e\u5e93\u8fde\u63a5\u6c60\u63d0\u4f9b\u6570\u636e\u5e93\u8fde\u63a5
db-fetch-db-type.displayName=\u6570\u636e\u5e93\u7c7b\u578b
db-fetch-db-type.description=\u88ab\u7528\u6765\u751f\u6210\u7279\u6b8a\u4ee3\u7801\u7684\u6570\u636e\u5e93\u7c7b\u578b\u3002\u5f88\u591a\u60c5\u51b5\u4e0b\uff0c'\u901a\u7528'\u7c7b\u578b\u5df2\u7ecf\u8db3\u591f\u4e86\uff0c\u4f46\u662f\u4e00\u4e9b\u6570\u636e\u5e93\uff08\u6bd4\u5982Oracle)\u9700\u8981\u81ea\u5b9a\u4e49SQL\u5b50\u53e5
__AllowableValue.db-fetch-db-type.Generic.displayName=\u901a\u7528
__AllowableValue.db-fetch-db-type.Generic.description=\u901a\u7528\u7684ANSI SQL
__AllowableValue.db-fetch-db-type.MS_SQL_2008.displayName=MS SQL 2008
__AllowableValue.db-fetch-db-type.MS_SQL_2008.description=\u517c\u5bb9 MS SQL 2008\u7248\u672c
__AllowableValue.db-fetch-db-type.MS_SQL_2012+.displayName=MS SQL 2012+
__AllowableValue.db-fetch-db-type.MS_SQL_2012+.description=\u517c\u5bb9 MS SQL 2012\u7248\u672c\u6216\u66f4\u9ad8
__AllowableValue.db-fetch-db-type.MySQL.displayName=MySQL
__AllowableValue.db-fetch-db-type.MySQL.description=\u517c\u5bb9 MySQL SQL
__AllowableValue.db-fetch-db-type.Oracle.displayName=Oracle
__AllowableValue.db-fetch-db-type.Oracle.description=\u517c\u5bb9 Oracle SQL
__AllowableValue.db-fetch-db-type.Oracle_12+.displayName=Oracle 12+
__AllowableValue.db-fetch-db-type.Oracle_12+.description=\u517c\u5bb9 Oracle 12\u7248\u672c\u6216\u66f4\u9ad8
Table_Name.displayName=\u8868\u540d
Table_Name.description=\u6570\u636e\u5e93\u8868\u540d\u3002\u5f53\u81ea\u5b9a\u4e49\u67e5\u8be2\u8bed\u53e5\u65f6\uff0c\u8be5\u53c2\u6570\u88ab\u7528\u505a\u67e5\u8be2\u7684\u522b\u540d\uff0c\u5e76\u4f5c\u4e3a\u4e00\u4e2a\u5c5e\u6027\u5728\u6570\u636e\u6d41\u4e2d\u8f93\u51fa
Columns_to_Return.displayName=\u8fd4\u56de\u5b57\u6bb5
Columns_to_Return.description=\u67e5\u8be2\u8bed\u53e5\u4e2d\u7684\u5b57\u6bb5\u5217\u8868\u4e14\u7531\u82f1\u6587\u9017\u53f7\u5206\u9694\u3002 \u5982\u679c\u662f\u7279\u6b8a\u7684\u5b57\u6bb5\u540d\uff08\u6bd4\u5982\u9700\u8981\u8f6c\u4e49\uff09\uff0c\u5219\u6bcf\u4e2a\u5b57\u6bb5\u90fd\u5e94\u8be5\u91c7\u7528\u76f8\u540c\u7684\u5904\u7406\u3002\u5982\u679c\u8be5\u53c2\u6570\u6ca1\u6709\u8bbe\u7f6e\u5b57\u6bb5\u5217\u8868\uff0c\u8868\u7684\u6240\u6709\u5b57\u6bb5\u5c06\u8fd4\u56de\u3002\u6ce8\u610f\uff1a\u63d0\u4f9b\u8868\u7684\u4e00\u7cfb\u5217\u5b57\u6bb5\u540d\u6709\u52a9\u4e8e\u540e\u7eed\u5bf9\u6570\u636e\u7684\u589e\u91cf\u64cd\u4f5c\u3002
db-fetch-where-clause.displayName=\u989d\u5916\u7684WHERE\u5b50\u53e5
db-fetch-where-clause.description=\u5f53\u6784\u9020SQL\u67e5\u8be2\u65f6\uff0c\u53ef\u9644\u52a0\u81ea\u5b9a\u4e49\u7684WHERE\u5b50\u53e5
db-fetch-sql-query.displayName=\u81ea\u5b9a\u4e49\u67e5\u8be2
db-fetch-sql-query.description=\u4f7f\u7528\u81ea\u5b9a\u4e49\u7684SQL\u67e5\u8be2\u6765\u83b7\u53d6\u7ed3\u679c\uff0c\u8be5\u67e5\u8be2\u5c06\u88ab\u5305\u88c5\u6210\u5b50\u67e5\u8be2\uff0c\u800c\u4e0d\u662f\u4ece\u5176\u4ed6\u5c5e\u6027\u4e2d\u6784\u5efaSQL\u67e5\u8be2\uff0c\u5e76\u4e14\u8be5\u67e5\u8be2\u4e0d\u80fd\u5305\u542bORDER BY\u3002
Maximum-value_Columns.displayName=\u6700\u5927\u503c\u5b57\u6bb5
Maximum-value_Columns.description=\u7531\u82f1\u6587\u9017\u53f7\u5206\u9694\u7684\u5b57\u6bb5\u5217\u8868\u3002\u7ec4\u4ef6\u7528\u4e8e\u8ffd\u8e2a\u7ec4\u4ef6\u8fd0\u884c\u65f6\u6240\u8fd4\u56de\u6bcf\u5217\u5b57\u6bb5\u7684\u6700\u5927\u503c\u3002\u4f7f\u7528\u591a\u4e2a\u5b57\u6bb5\uff0c\u901a\u8fc7\u63a7\u5236\u5b57\u6bb5\u7684\u5148\u540e\u987a\u5e8f\uff0c\u5e76\u4e14\u671f\u671b\u6bcf\u4e2a\u5217\u7684\u503c\u589e\u52a0\u5f97\u6bd4\u524d\u4e00\u5217\u7684\u503c\u6162\u5f97\u591a\u3002\u56e0\u6b64\uff0c\u4f7f\u7528\u591a\u4e2a\u5217\u610f\u5473\u7740\u5217\u7684\u5c42\u6b21\u7ed3\u6784\uff0c\u901a\u5e38\u7528\u4e8e\u5bf9\u8868\u8fdb\u884c\u5206\u533a\u3002\u8be5\u7ec4\u4ef6\u53ef\u7528\u4e8e\u4ec5\u8bfb\u53d6\u540e\u7eed\u8bfb\u53d6\u6dfb\u52a0\u6216\u66f4\u65b0\u7684\u6570\u636e\u3002\u9700\u8981\u6ce8\u610f\u7684\u662f\u4e00\u4e9bJDBC\u7c7b\u578b\uff0c\u6bd4\u5982bit\u6216boolean\u4e0d\u5efa\u8bae\u4f5c\u4e3a\u6700\u5927\u503c\u53c2\u6570\uff0c\u5e76\u53ef\u80fd\u5bfc\u81f4\u9519\u8bef\u7684\u5904\u7406\u3002 \u5982\u679c\u4e0d\u63d0\u4f9b\u4efb\u4f55\u5b57\u6bb5\uff0c\u8868\u4e2d\u7684\u6240\u6709\u884c\uff0c\u5c06\u4e88\u4ee5\u8003\u8651\uff0c\u8fd9\u53ef\u80fd\u4f1a\u5f71\u54cd\u6027\u80fd\u3002\u6ce8\u610f\uff1a\u901a\u8fc7\u63d0\u4f9b\u8868\u7684\u6700\u5927\u503c\u5b57\u6bb5\u5bf9\u4e8e\u589e\u91cf\u8bfb\u53d6\u6570\u636e\u975e\u5e38\u6709\u7528\u3002
Max_Wait_Time.displayName=\u6267\u884c\u7b49\u5f85\u65f6\u95f4
Max_Wait_Time.description=\u5141\u8bb8\u6267\u884cSQL\u8bed\u53e5\u7684\u6700\u5927\u7b49\u5f85\u65f6\u95f4\uff0c0\u8868\u793a\u65e0\u9650\u5236\uff0c\u4e14\u5c0f\u4e8e1\u79d2\u88ab\u89c6\u4e3a\u7b49\u540c0\u79d2\u3002
Fetch_Size.displayName=\u8bfb\u53d6\u5927\u5c0f
Fetch_Size.description=\u6bcf\u6b21\u4ece\u6570\u636e\u5e93\u83b7\u53d6\u7ed3\u679c\u96c6\u7684\u6570\u636e\u884c\u6570\u3002\u8fd9\u53d6\u51b3\u4e8e\u6570\u636e\u5e93\u9a71\u52a8\u662f\u5426\u652f\u6301\uff0c\u7ed3\u679c\u4e5f\u53ef\u80fd\u662f\u4e0d\u51c6\u786e\u7684\u3002\u5982\u679c\u8bbe\u7f6e\u4e3a0\uff0c\u8868\u793a\u5ffd\u7565\u8be5\u8bbe\u7f6e
qdbt-max-rows.displayName=\u6bcf\u4e2a\u6570\u636e\u6d41\u7684\u6700\u5927\u884c\u6570
qdbt-max-rows.description=\u9488\u5bf9\u6bcf\u4e2a\u8f93\u51fa\u6570\u636e\u6d41\u6240\u8981\u5305\u542b\u7684\u7ed3\u679c\u6700\u5927\u884c\u6570\u3002\u53ef\u901a\u8fc7\u8be5\u53c2\u6570\u6307\u5b9a\u5c06\u975e\u5e38\u5927\u7684\u7ed3\u679c\u96c6\u62c6\u5206\u6210\u591a\u4e2a\u6570\u636e\u6d41\u8f93\u51fa\u3002\u5982\u679c\u8bbe\u7f6e\u4e3a0\uff0c\u5219\u6240\u6709\u7ed3\u679c\u90fd\u5c06\u8f93\u51fa\u5230\u5355\u4e2a\u6570\u636e\u6d41\u4e2d\u3002
qdbt-output-batch-size.displayName=\u5206\u6279\u6570\u91cf
qdbt-output-batch-size.description=\u5728\u63d0\u4ea4\u5904\u7406\u4f1a\u8bdd\u4e4b\u524d\uff0c\u8f93\u51fa\u6570\u636e\u6d41\u961f\u5217\u7684\u5927\u5c0f\u3002\u5f53\u8bbe\u7f6e\u4e3a0\u65f6\uff0c\u5f53\u6240\u6709\u7ed3\u679c\u90fd\u88ab\u5904\u7406\u4e14\u8f93\u51fa\u6570\u636e\u6d41\u51c6\u5907\u4f20\u8f93\u6570\u636e\u7ed9\u4e0b\u6e38\u8fde\u7ebf\u65f6\uff0c\u63d0\u4ea4\u5904\u7406\u4f1a\u8bdd\u3002\u5bf9\u4e8e\u5927\u91cf\u7684\u7ed3\u679c\uff0c\u53ef\u80fd\u5bfc\u81f4\u5927\u91cf\u6570\u636e\u6d41\u88ab\u4f20\u8f93\u3002 \u5982\u679c\u53c2\u6570\u88ab\u8bbe\u7f6e\uff0c\u5f53\u6307\u5b9a\u6570\u91cf\u7684\u6570\u636e\u6d41\u51c6\u5907\u597d\u4f20\u8f93\u540e\uff0c\u5219\u4f1a\u8bdd\u5c06\u88ab\u63d0\u4ea4\u5e76\u88ab\u91ca\u653e\u5230\u4e0b\u6e38\u8fde\u7ebf\u3002\u6ce8\u610f\uff1a\u5f53\u8be5\u53c2\u6570\u88ab\u8bbe\u7f6e\u65f6\uff0c'maxvalue.*' \u548c 'fragment.count' \u5c5e\u6027\u4e0d\u4f1a\u4f20\u8f93\u5230\u6570\u636e\u6d41\u4e2d\u3002
qdbt-max-frags.displayName=\u6700\u5927\u5207\u7247\u6570
qdbt-max-frags.description=\u6700\u5927\u5207\u7247\u6570. \u5982\u679c\u8bbe\u7f6e\u4e3a0\uff0c\u5219\u8fd4\u56de\u6240\u6709\u7684\u5207\u7247\u3002\u5f53\u7ec4\u4ef6\u5904\u7406\u5927\u6570\u636e\u8868\u65f6\u8fd9\u80fd\u5f88\u597d\u7684\u9632\u6b62OutOfMemoryError\u95ee\u9898\u3002\u6ce8\u610f\uff1a\u8bbe\u7f6e\u8be5\u53c2\u6570\u53ef\u5bfc\u81f4\u6570\u636e\u4e22\u5931\uff0c\u4e14\u8f93\u5165\u7ed3\u679c\u8fd8\u662f\u65e0\u5e8f\u7684\uff0c\u8fd8\u53ef\u80fd\u5207\u7247\u7684\u8fb9\u754c\u5bfc\u81f4\u6570\u636e\u4e0d\u5305\u542b\u5230\u7ed3\u679c\u96c6\u4e2d\u3002
dbf-normalize.displayName=\u89c4\u8303\u5316\u8868/\u5217\u540d
dbf-normalize.description=\u662f\u5426\u6539\u53d8\u4e00\u4e9b\u4e0d\u517c\u5bb9avro\u683c\u5f0f\u7684\u7279\u6b8a\u5b57\u7b26\uff0c\u4e3a\u4e86\u9002\u5e94Avro\u683c\u5f0f\uff0c\u6bd4\u5982\u5192\u53f7\u3001\u53e5\u53f7\u4f1a\u88ab\u6539\u6210\u4e0b\u5212\u7ebf\u3002
__AllowableValue.dbf-normalize.false.displayName=\u5426
__AllowableValue.dbf-normalize.true.displayName=\u662f
dbf-user-logical-types.displayName=\u4f7f\u7528Avro\u6570\u636e\u7c7b\u578b
dbf-user-logical-types.description=\u662f\u5426\u4f7f\u7528Avro\u903b\u8f91\u7684\u6570\u636e\u7c7b\u578b\uff0c\u6bd4\u5982 \u65f6\u95f4\uff0c\u6570\u5b57\uff0c\u65e5\u671f\u7b49\u683c\u5f0f\uff0c\u5982\u679c\u5426\uff0c\u90a3\u4e48\u5c06\u4ee5\u5b57\u7b26\u4e32\u4ee3\u66ff\u539f\u6709\u7684\u6570\u636e\u7c7b\u578b\u3002\u5982\u679c\u662f\uff0c\u903b\u8f91\u6570\u636e\u7c7b\u578b\u5c06\u57fa\u4e8e\u5982\u4e0b\u89c4\u5219\uff1a'DECIMAL/NUMBER' \u5bf9\u5e94 'decimal','DATE' \u5bf9\u5e94 'date-millis'\uff0c'TIME' \u5bf9\u5e94 'time-millis', 'TIMESTAMP' \u5bf9\u5e94 'timestamp-millis'\u3002
__AllowableValue.dbf-user-logical-types.false.displayName=\u5426
__AllowableValue.dbf-user-logical-types.true.displayName=\u662f
dbf-default-precision.displayName=\u5c0f\u6570\u7cbe\u5ea6
dbf-default-precision.description=\u5f53\u7c7b\u578b\u662f'DECIMAL/NUMBER' \u5bf9\u5e94 'decimal'\u7684\u9ed8\u8ba4\u5c0f\u6570\u7cbe\u5ea6
dbf-default-scale.displayName=\u5c0f\u6570\u56db\u820d\u4e94\u5165\u4f4d\u6570
dbf-default-scale.description=\u5f53\u7c7b\u578b\u662f'DECIMAL/NUMBER' \u5bf9\u5e94 'decimal'\u7684\u56db\u820d\u4e94\u5165\u7684\u5c0f\u6570\u4f4d\u6570
initial.maxvalue.max_value_column.description=\u4e3a<\u6700\u5927\u503c\u5b57\u6bb5>\u6307\u5b9a\u521d\u59cb\u5316\u6700\u5927\u503c\u3002\u5c5e\u6027\u5c06\u88ab\u6dfb\u52a0\u4e3a\u683c\u5f0f\uff1a `initial.maxvalue.{max_value_column}`. \u6b64\u503c\u4ec5\u5728\u7b2c\u4e00\u6b21\u8bbf\u95ee\u8868\u65f6\u4f7f\u7528\u3002
__Relationship.success.description=\u6210\u529f\u5730\u4eceSQL\u67e5\u8be2\u8bed\u53e5\u7ed3\u679c\u96c6\u4e2d\u521b\u5efa\u6570\u636e\u6d41\u8f93\u51fa\u5230\u6b64\u8fde\u7ebf
__WritesAttribute.tablename.description=\u7528\u4e8e\u67e5\u8be2\u7684\u8868\u540d
__WritesAttribute.querydbtable.row.count.description=\u67e5\u8be2\u7ed3\u679c\u884c\u6570
__WritesAttribute.fragment.identifier.description=\u5982\u679c\u8bbe\u7f6e<\u6bcf\u4e2a\u6570\u636e\u6d41\u7684\u6700\u5927\u884c\u6570>\uff0c\u6240\u6709\u4ece\u76f8\u540c\u7ed3\u679c\u96c6\u4ea7\u751f\u7684\u6570\u636e\u6d41\u5177\u6709\u76f8\u540c\u7684'fragment.identifier'\u5c5e\u6027\u503c\u3002\u53ef\u7528\u4e8e\u5173\u8054\u67e5\u8be2\u7ed3\u679c\u3002
__WritesAttribute.fragment.count.description=\u5982\u679c\u8bbe\u7f6e<\u6bcf\u4e2a\u6570\u636e\u6d41\u7684\u6700\u5927\u884c\u6570>\uff0c\u4ece\u5355\u4e2a\u7ed3\u679c\u96c6\u4e2d\u6d3e\u751f\u51fa\u6765\u7684\u6570\u636e\u6d41\u6570\u3002 \u53ef\u7ed3\u5408'fragment.identifier'\u5c5e\u6027\u6765\u83b7\u77e5\u591a\u5c11\u4e2a\u6570\u636e\u6d41\u5c5e\u4e8e\u76f8\u540c\u7684\u7ed3\u679c\u96c6\u3002\u5982\u679c\u8bbe\u7f6e<\u6279\u91cf\u8f93\u51fa\u5927\u5c0f>\uff0c\u5219\u8be5\u5c5e\u6027\u5c06\u4e0d\u4f1a\u88ab\u8bbe\u7f6e\u3002
__WritesAttribute.fragment.index.description=\u5982\u679c\u8bbe\u7f6e<\u6bcf\u4e2a\u6570\u636e\u6d41\u7684\u6700\u5927\u884c\u6570>\uff0c\u7528\u4e8e\u6807\u8bc6\u6570\u636e\u6d41\u5728\u6765\u81ea\u4e8e\u76f8\u540c\u7ed3\u679c\u96c6\u7684\u8f93\u51fa\u6570\u636e\u6d41\u5217\u8868\u4e2d\u7684\u5148\u540e\u987a\u5e8f\u3002 \u53ef\u7ed3\u5408'fragment.identifier'\u5c5e\u6027\u6765\u83b7\u77e5\u6570\u636e\u6d41\u5c5e\u4e8e\u76f8\u540c\u7684\u7ed3\u679c\u96c6\u4e14\u5904\u4e8e\u5e8f\u5217\u4e2d\u7684\u4ec0\u4e48\u4f4d\u7f6e\u3002
__WritesAttribute.maxvalue._.description=\u6bcf\u4e2a\u5c5e\u6027\u5305\u542b\u4e86\u6765\u81ea\u4e8e<\u6700\u5927\u503c\u5b57\u6bb5>\u5bf9\u5e94\u7684\u5b57\u6bb5\u503c\u3002 \u5c5e\u6027\u524d\u7f00\u4e3a\u5b57\u6bb5\u540d\u3002 \u5982\u679c\u8bbe\u7f6e<\u6279\u91cf\u8f93\u51fa\u5927\u5c0f>\uff0c\u5219\u8be5\u5c5e\u6027\u5c06\u4e0d\u4f1a\u88ab\u8bbe\u7f6e\u3002
__Stateful.description=\u9488\u5bf9\u6307\u5b9a\u8868\u6267\u884c\u67e5\u8be2\u540e\uff0c\u6307\u5b9a\u5b57\u6bb5\u7684\u6700\u5927\u503c\u5c06\u88ab\u7528\u4e8e\u5c06\u6765\u7684\u67e5\u8be2\u6267\u884c\u3002\u57fa\u4e8e\u6b64\uff0c\u7ec4\u4ef6\u53ef\u8bfb\u53d6\u7684\u8bb0\u5f55\u662f\u5927\u4e8e\u6700\u5927\u503c\u7684\u8bbe\u7f6e\u3002\u8fd9\u53ef\u7528\u4e8e\u589e\u91cf\u8bfb\u53d6\uff0c\u65b0\u589e\u52a0\u7684\u6570\u636e\u884c\u3002\u4e3a\u4e86\u6e05\u9664\u6700\u5927\u503c\uff0c\u53ef\u901a\u8fc7\u72b6\u6001\u7ba1\u7406\u4e2d\u6e05\u9664\u7ec4\u4ef6\u7684\u72b6\u6001\u3002
