__CapabilityDescription=\u4f7f\u7528 "\u7ad9\u70b9\u5230\u7ad9\u70b9" \u534f\u8bae\u53d1\u5e03\u6e90\u4e8b\u4ef6\u3002
__Tags=provenance, lineage, tracking, site, site to site, \u6e90, \u7cfb, \u8ffd\u8e2a, \u7ad9\u70b9, \u7ad9\u70b9\u5230\u7ad9\u70b9
Destination_URL.displayName=\u76ee\u6807URL
Destination_URL.description=\u8981\u5c06\u6570\u636e\u53d1\u9001\u5230\u76ee\u6807\u5e73\u53f0\u5b9e\u4f8b\u7684URL\u5e94\u8be5\u662f\u683c\u5f0f\u4e3ahttp(s)\://host\:port/runtime \u7684\u4ee5\u5192\u53f7\u5206\u5272\u7684\u5730\u5740\u5217\u8868\u3002
Input_Port_Name.displayName=\u8f93\u5165\u7aef\u53e3
Input_Port_Name.description=\u8981\u4f20\u9001\u6570\u636e\u7684\u8f93\u5165\u7aef\u53e3\u7684\u540d\u79f0\u3002
SSL_Context_Service.displayName=SSL\u670d\u52a1
SSL_Context_Service.description=\u4e0e\u76ee\u6807\u901a\u4fe1\u65f6\u4f7f\u7528\u7684SSL\u4e0a\u4e0b\u6587\u670d\u52a1\u3002\u5982\u679c\u672a\u6307\u5b9a\uff0c\u901a\u4fe1\u5c06\u4e0d\u5b89\u5168\u3002
Instance_URL.displayName=\u5b9e\u4f8bURL
Instance_URL.description=\u8981\u5728\u6bcf\u4e2a\u4e8b\u4ef6\u7684\u5185\u5bb9URI\u4e2d\u4f7f\u7528\u6b64\u5b9e\u4f8b\u7684URL\u3002
Compress_Events.displayName=\u538b\u7f29\u4e8b\u4ef6
Compress_Events.description=\u6307\u793a\u662f\u5426\u538b\u7f29\u6b63\u5728\u53d1\u9001\u7684\u6570\u636e\u3002
__AllowableValue.Compress_Events.false.displayName=\u5426
__AllowableValue.Compress_Events.true.displayName=\u662f
Communications_Timeout.displayName=\u901a\u4fe1\u8d85\u65f6
Communications_Timeout.description=\u6307\u5b9a\u5728\u786e\u5b9a\u53d1\u751f\u9519\u8bef\u5e76\u53d6\u6d88\u4e8b\u52a1\u4e4b\u524d\u7b49\u5f85\u76ee\u6807\u54cd\u5e94\u7684\u65f6\u95f4
Batch_Size.displayName=\u5206\u6279\u6570\u91cf
Batch_Size.description=\u6307\u5b9a\u6700\u591a\u5728\u4e00\u4e2a\u6279\u5904\u7406\u4e2d\u53d1\u9001\u7684\u8bb0\u5f55\u6570\u3002
s2s-transport-protocol.displayName=\u4f20\u8f93\u534f\u8bae
s2s-transport-protocol.description=\u6307\u5b9a\u7528\u4e8e\u7ad9\u70b9\u5230\u7ad9\u70b9\u901a\u4fe1\u7684\u4f20\u8f93\u534f\u8bae\u3002
__AllowableValue.s2s-transport-protocol.HTTP.displayName=HTTP
__AllowableValue.s2s-transport-protocol.RAW.displayName=RAW
s2s-http-proxy-hostname.displayName=HTTP\u4ee3\u7406\u4e3b\u673a\u540d
s2s-http-proxy-hostname.description=\u6307\u5b9a\u8981\u4f7f\u7528\u7684\u4ee3\u7406\u670d\u52a1\u5668\u7684\u4e3b\u673a\u540d\u3002\u5982\u679c\u672a\u6307\u5b9a\uff0c\u5219HTTP\u6d41\u91cf\u5c06\u76f4\u63a5\u53d1\u9001\u5230\u76ee\u6807\u5e73\u53f0\u5b9e\u4f8b\u3002
s2s-http-proxy-port.displayName=HTTP\u4ee3\u7406\u7aef\u53e3
s2s-http-proxy-port.description=\u6307\u5b9a\u4ee3\u7406\u670d\u52a1\u5668\u7684\u7aef\u53e3\u53f7\uff0c\u53ef\u9009\u3002\u5982\u679c\u672a\u6307\u5b9a\uff0c\u5c06\u4f7f\u7528\u9ed8\u8ba4\u7aef\u53e380\u3002
s2s-http-proxy-username.displayName=HTTP\u4ee3\u7406\u7528\u6237\u540d
s2s-http-proxy-username.description=\u6307\u5b9a\u8981\u8fde\u63a5\u5230\u4ee3\u7406\u670d\u52a1\u5668\u7684\u7528\u6237\u540d\uff0c\u53ef\u9009\u3002
s2s-http-proxy-password.displayName=HTTP\u4ee3\u7406\u7528\u6237\u5bc6\u7801
s2s-http-proxy-password.description=\u6307\u5b9a\u7528\u4e8e\u8fde\u63a5\u4ee3\u7406\u670d\u52a1\u5668\u7684\u7528\u6237\u5bc6\u7801\uff0c\u53ef\u9009\u3002
record-writer.displayName=\u8bb0\u5f55\u8f93\u51fa\u670d\u52a1
record-writer.description=\u6307\u5b9a\u7528\u4e8e\u5199\u5165\u8bb0\u5f55\u7684\u63a7\u5236\u5668\u670d\u52a1\u3002
Platform.displayName=\u5e73\u53f0
Platform.description=\u7528\u4e8e\u6bcf\u4e2a\u6765\u6e90\u4e8b\u4ef6\u4e2d\u5e73\u53f0\u5b57\u6bb5\u7684\u503c\u3002
s2s-prov-task-event-filter.displayName=\u8981\u5305\u542b\u7684\u4e8b\u4ef6\u7c7b\u578b
s2s-prov-task-event-filter.description=\u4ee5\u9017\u53f7\u5206\u9694\u7684\u4e8b\u4ef6\u7c7b\u578b\u5217\u8868\uff0c\u7528\u4e8e\u8fc7\u6ee4\u62a5\u544a\u4efb\u52a1\u53d1\u9001\u7684\u6e90\u4e8b\u4ef6\u3002\u53ef\u7528\u7684\u4e8b\u4ef6\u7c7b\u578b\u6709[CREATE, RECEIVE, FETCH, SEND, REMOTE_INVOCATION, DOWNLOAD, DROP, EXPIRE, FORK, JOIN, CLONE, CONTENT_MODIFIED, ATTRIBUTES_MODIFIED, ROUTE, ADDINFO, REPLAY, UNKNOWN]\u3002\u5982\u679c\u672a\u8bbe\u7f6e\u8fc7\u6ee4\u5668\uff0c\u5219\u53d1\u9001\u6240\u6709\u4e8b\u4ef6\u3002\u5982\u679c\u8bbe\u7f6e\u4e86\u591a\u4e2a\u8fc7\u6ee4\u5668\uff0c\u5219\u8fc7\u6ee4\u5668\u4f1a\u7d2f\u52a0\u3002
s2s-prov-task-event-filter-exclude.displayName=\u8981\u6392\u9664\u7684\u4e8b\u4ef6\u7c7b\u578b
s2s-prov-task-event-filter-exclude.description=\u4ee5\u9017\u53f7\u5206\u9694\u7684\u4e8b\u4ef6\u7c7b\u578b\u5217\u8868\uff0c\u7528\u4e8e\u6392\u9664\u62a5\u544a\u4efb\u52a1\u53d1\u9001\u7684\u6e90\u4e8b\u4ef6\u3002\u53ef\u7528\u7684\u4e8b\u4ef6\u7c7b\u578b\u6709[CREATE, RECEIVE, FETCH, SEND, REMOTE_INVOCATION, DOWNLOAD, DROP, EXPIRE, FORK, JOIN, CLONE, CONTENT_MODIFIED, ATTRIBUTES_MODIFIED, ROUTE, ADDINFO, REPLAY, UNKNOWN]. \u5982\u679c\u672a\u8bbe\u7f6e\u8fc7\u6ee4\u5668\uff0c\u5219\u53d1\u9001\u6240\u6709\u4e8b\u4ef6\u3002\u5982\u679c\u8bbe\u7f6e\u4e86\u591a\u4e2a\u8fc7\u6ee4\u5668\uff0c\u5219\u8fc7\u6ee4\u5668\u4f1a\u7d2f\u52a0\u3002\u5982\u679c\u4e8b\u4ef6\u7c7b\u578b\u5305\u542b\u5728\u6b64\u5904\u8981\u5305\u62ec\u548c\u8981\u6392\u9664\u7684\u4e8b\u4ef6\u7c7b\u578b\u4e2d\uff0c\u5219\u6392\u9664\u4f18\u5148\uff0c\u5e76\u4e14\u4e0d\u4f1a\u53d1\u9001\u4e8b\u4ef6\u3002
s2s-prov-task-type-filter.displayName=\u8981\u5305\u542b\u7684\u7ec4\u4ef6\u7c7b\u578b
s2s-prov-task-type-filter.description=\u57fa\u4e8e\u7ec4\u4ef6\u7c7b\u578b\u8fc7\u6ee4\u6e90\u4e8b\u4ef6\u7684\u6b63\u5219\u8868\u8fbe\u5f0f\u3002\u4ec5\u53d1\u9001\u4e0e\u6b63\u5219\u8868\u8fbe\u5f0f\u5339\u914d\u7684\u4e8b\u4ef6\u3002\u5982\u679c\u672a\u8bbe\u7f6e\u8fc7\u6ee4\u5668\uff0c\u5219\u53d1\u9001\u6240\u6709\u4e8b\u4ef6\u3002\u5982\u679c\u8bbe\u7f6e\u4e86\u591a\u4e2a\u8fc7\u6ee4\u5668\uff0c\u5219\u8fc7\u6ee4\u5668\u4f1a\u7d2f\u52a0\u3002
s2s-prov-task-type-filter-exclude.displayName=\u8981\u6392\u9664\u7684\u7ec4\u4ef6\u7c7b\u578b
s2s-prov-task-type-filter-exclude.description=\u57fa\u4e8e\u7ec4\u4ef6\u7c7b\u578b\u6392\u9664\u6e90\u4e8b\u4ef6\u7684\u6b63\u5219\u8868\u8fbe\u5f0f\u3002\u5c06\u4e0d\u4f1a\u53d1\u9001\u4e0e\u6b63\u5219\u8868\u8fbe\u5f0f\u5339\u914d\u7684\u4e8b\u4ef6\u3002\u5982\u679c\u672a\u8bbe\u7f6e\u8fc7\u6ee4\u5668\uff0c\u5219\u53d1\u9001\u6240\u6709\u4e8b\u4ef6\u3002\u5982\u679c\u8bbe\u7f6e\u4e86\u591a\u4e2a\u8fc7\u6ee4\u5668\uff0c\u5219\u8fc7\u6ee4\u5668\u4f1a\u7d2f\u52a0\u3002\u5982\u679c\u7ec4\u4ef6\u7c7b\u578b\u5305\u542b\u5728\u6b64\u5904\u8981\u5305\u542b\u548c\u8981\u6392\u9664\u7684\u7ec4\u4ef6\u7c7b\u578b\u4e2d\uff0c\u5219\u6392\u9664\u4f18\u5148\uff0c\u5e76\u4e14\u4e0d\u4f1a\u53d1\u9001\u4e8b\u4ef6\u3002
s2s-prov-task-id-filter.displayName=\u8981\u5305\u542b\u7684\u7ec4\u4ef6ID
s2s-prov-task-id-filter.description=\u4ee5\u9017\u53f7\u5206\u9694\u7684\u7ec4\u4ef6UUID\u5217\u8868\uff0c\u7528\u4e8e\u8fc7\u6ee4\u62a5\u544a\u4efb\u52a1\u53d1\u9001\u7684\u6e90\u4e8b\u4ef6\u3002\u5982\u679c\u672a\u8bbe\u7f6e\u8fc7\u6ee4\u5668\uff0c\u5219\u53d1\u9001\u6240\u6709\u4e8b\u4ef6\u3002\u5982\u679c\u8bbe\u7f6e\u4e86\u591a\u4e2a\u8fc7\u6ee4\u5668\uff0c\u5219\u8fc7\u6ee4\u5668\u4f1a\u7d2f\u52a0\u3002
s2s-prov-task-id-filter-exclude.displayName=\u8981\u6392\u9664\u7684\u7ec4\u4ef6ID
s2s-prov-task-id-filter-exclude.description=\u4ee5\u9017\u53f7\u5206\u9694\u7684\u7ec4\u4ef6UUID\u5217\u8868\uff0c\u7528\u4e8e\u6392\u9664\u62a5\u544a\u4efb\u52a1\u53d1\u9001\u7684\u6e90\u4e8b\u4ef6\u3002\u5982\u679c\u672a\u8bbe\u7f6e\u8fc7\u6ee4\u5668\uff0c\u5219\u53d1\u9001\u6240\u6709\u4e8b\u4ef6\u3002\u5982\u679c\u8bbe\u7f6e\u4e86\u591a\u4e2a\u8fc7\u6ee4\u5668\uff0c\u5219\u8fc7\u6ee4\u5668\u4f1a\u7d2f\u52a0\u3002\u5982\u679c\u7ec4\u4ef6UUID\u5305\u542b\u5728\u6b64\u5904\u8981\u5305\u62ec\u548c\u8981\u6392\u9664\u7684\u7ec4\u4ef6ID\u4e2d\uff0c\u5219\u6392\u9664\u4f18\u5148\uff0c\u5e76\u4e14\u4e0d\u4f1a\u53d1\u9001\u4e8b\u4ef6\u3002
start-position.displayName=\u8d77\u59cb\u4f4d\u7f6e
start-position.description=\u5982\u679c\u4ece\u672a\u8fd0\u884c\u8fc7\u62a5\u544a\u4efb\u52a1\uff0c\u6216\u8005\u7528\u6237\u5df2\u91cd\u7f6e\u5176\u72b6\u6001\uff0c\u5219\u6307\u5b9a\u62a5\u544a\u4efb\u52a1\u5e94\u5728\u6e90\u4e8b\u4ef6\u6d41\u4e2d\u7684\u4f4d\u7f6e
__AllowableValue.start-position.beginning-of-stream.displayName=\u8d77\u59cb\u6d41
__AllowableValue.start-position.beginning-of-stream.description=\u4ece\u8d77\u59cb\u6d41\uff08\u6700\u65e9\u5f00\u59cb\u7684\u4e8b\u4ef6\uff09\u8bfb\u53d6\u6e90\u4e8b\u4ef6
__AllowableValue.start-position.end-of-stream.displayName=\u7ec8\u6b62\u6d41
__AllowableValue.start-position.end-of-stream.description=\u4ece\u7ec8\u6b62\u6d41\u8bfb\u53d6\u6e90\u5b9e\u8df5\uff0c\u5ffd\u7565\u65e7\u4e8b\u4ef6
__Stateful.description=\u5b58\u50a8\u62a5\u544a\u4efb\u52a1\u7684\u6700\u540e\u4e00\u4e2a\u4e8b\u4ef6ID\uff0c\u4ee5\u4fbf\u5728\u91cd\u65b0\u542f\u52a8\u65f6\u4efb\u52a1\u77e5\u9053\u5b83\u505c\u6b62\u7684\u4f4d\u7f6e\u3002
__Restriction.export-nifi-details.label=\u5bfc\u51fa\u5e73\u53f0\u8be6\u7ec6\u4fe1\u606f
__Restriction.export-nifi-details.explanation=\u4f7f\u64cd\u4f5c\u5458\u80fd\u591f\u5c06\u6e90\u4e8b\u4ef6\u4e2d\u5305\u542b\u7684\u654f\u611f\u8be6\u7ec6\u4fe1\u606f\u53d1\u9001\u5230\u4efb\u4f55\u5916\u90e8\u7cfb\u7edf\u3002
